{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\rober\Downloads\Replication\log New Zealand.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}11 Apr 2024, 23:15:04
{txt}
{com}. 
. set scheme s1color
{txt}
{com}. 
. use "C:\Users\rober\Downloads\Replication\NZESPanel93_96_99.dta", clear
{txt}
{com}. 
. label drop _all
{txt}
{com}. 
. ********************************************************************************
. 
. * PREPARATION OF VARIABLES
. 
. ********************************************************************************
. 
. *** 1) Main Variables
. 
. ****1) DVs 
. 
. *1: National vs. 0: the rest (Labour+Alliance+Greens)
. 
. ***
. 
. **1999
. 
. *nvot99p         byte    %8.0g      LABU       validated party vote
. 
. gen DV_99_1=0 if nvot99p==1
{txt}(491 missing values generated)

{com}. replace DV_99_1=1 if nvot99p==2
{txt}(228 real changes made)

{com}. replace DV_99_1=0 if nvot99p==3
{txt}(59 real changes made)

{com}. replace DV_99_1=0 if nvot99p==4
{txt}(37 real changes made)

{com}. 
. ***
. 
. **1996
. 
. *pnvot96p        byte    %14.0g     NVOT96P    Validated Party Vote
. 
. gen DV_96_1=0 if pnvot96p==1
{txt}(554 missing values generated)

{com}. replace DV_96_1=1 if pnvot96p==2
{txt}(249 real changes made)

{com}. replace DV_96_1=0 if pnvot96p==3
{txt}(81 real changes made)

{com}. replace DV_96_1=0 if pnvot96p==4
{txt}(77 real changes made)

{com}. 
. ***
. 
. **1993
. 
. *nvot93e         byte    %11.0g     LABZ       Vote in 1993 after Validation
. 
. 
. gen DV_93_1=0 if nvot93e==1
{txt}(537 missing values generated)

{com}. replace DV_93_1=1 if nvot93e==2
{txt}(271 real changes made)

{com}. replace DV_93_1=0 if nvot93e==3
{txt}(149 real changes made)

{com}. replace DV_93_1=0 if nvot93e==4
{txt}(45 real changes made)

{com}. 
. ******
. 
. ****2) IVs
. 
. lookfor income

{txt}Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:lowspd         }{txt}{bind: byte    }{bind:%12.0g    }{space 1}{bind:LABI     }{bind:  }{res}{res}Spending on Low Income Earners{p_end}
{p 0 48}{bind:nrincum        }{txt}{bind: byte    }{bind:%12.0g    }{space 1}{bind:LABAQ    }{bind:  }{res}{res}Personal Income{p_end}
{p 0 48}{bind:npincum        }{txt}{bind: byte    }{bind:%12.0g    }{space 1}{bind:LABAQ    }{bind:  }{res}{res}Partner Income{p_end}
{p 0 48}{bind:hincome        }{txt}{bind: byte    }{bind:%12.0g    }{space 1}{bind:LABAQ    }{bind:  }{res}{res}Household Income{p_end}
{p 0 48}{bind:plowsp         }{txt}{bind: int     }{bind:%37.0g    }{space 1}{bind:LABG     }{bind:  }{res}{res}Spending on Low Income Earners{p_end}
{p 0 48}{bind:penvr          }{txt}{bind: int     }{bind:%37.0g    }{space 1}{bind:LABN     }{bind:  }{res}{res}Respondent Environment Incomes{p_end}
{p 0 48}{bind:penvnat        }{txt}{bind: int     }{bind:%37.0g    }{space 1}{bind:LABN     }{bind:  }{res}{res}National Environment Incomes{p_end}
{p 0 48}{bind:penvlab        }{txt}{bind: int     }{bind:%37.0g    }{space 1}{bind:LABN     }{bind:  }{res}{res}Labour Environment Incomes{p_end}
{p 0 48}{bind:penvnzf        }{txt}{bind: int     }{bind:%37.0g    }{space 1}{bind:LABN     }{bind:  }{res}{res}NZ First Environment Incomes{p_end}
{p 0 48}{bind:penvall        }{txt}{bind: int     }{bind:%37.0g    }{space 1}{bind:LABN     }{bind:  }{res}{res}Alliance Environment Incomes{p_end}
{p 0 48}{bind:penvact        }{txt}{bind: int     }{bind:%37.0g    }{space 1}{bind:LABN     }{bind:  }{res}{res}ACT Environment Incomes{p_end}
{p 0 48}{bind:penvun         }{txt}{bind: int     }{bind:%37.0g    }{space 1}{bind:LABN     }{bind:  }{res}{res}United Environment Incomes{p_end}
{p 0 48}{bind:penvcc         }{txt}{bind: int     }{bind:%37.0g    }{space 1}{bind:LABN     }{bind:  }{res}{res}Christians Environment Incomes{p_end}
{p 0 48}{bind:qrincum        }{txt}{bind: byte    }{bind:%37.0g    }{space 1}{bind:LABAK    }{bind:  }{res}{res}Personal Income{p_end}
{p 0 48}{bind:qpincum        }{txt}{bind: int     }{bind:%37.0g    }{space 1}{bind:LABAK    }{bind:  }{res}{res}Partner Income{p_end}
{p 0 48}{bind:qhincum        }{txt}{bind: byte    }{bind:%37.0g    }{space 1}{bind:LABAK    }{bind:  }{res}{res}Household Income{p_end}
{p 0 48}{bind:slowsp         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABL     }{bind:  }{res}{res}spending on assisting low income families{p_end}
{p 0 48}{bind:senvr          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:senvr    }{bind:  }{res}{res}respondent environment incomes{p_end}
{p 0 48}{bind:srincum        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABAK    }{bind:  }{res}{res}personal income{p_end}
{p 0 48}{bind:shincum        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABAK    }{bind:  }{res}{res}household income{p_end}
{txt}
{com}. lookfor vote

{txt}Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:talk           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABA     }{bind:  }{res}{res}Talk about how to vote{p_end}
{p 0 48}{bind:nvot           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:NVOT     }{bind:  }{res}{res}Voted or Not{p_end}
{p 0 48}{bind:vot93e         }{txt}{bind: byte    }{bind:%11.0g    }{space 1}{bind:LABZ     }{bind:  }{res}{res}Vote in 1993 Election{p_end}
{p 0 48}{bind:votif          }{txt}{bind: byte    }{bind:%12.0g    }{space 1}{bind:LABAA    }{bind:  }{res}{res}How Nonvoters Might Vote{p_end}
{p 0 48}{bind:votsec         }{txt}{bind: byte    }{bind:%12.0g    }{space 1}{bind:LABAA    }{bind:  }{res}{res}Second Choice Vote{p_end}
{p 0 48}{bind:vtwcan         }{txt}{bind: byte    }{bind:%13.0g    }{space 1}{bind:VTWCAN   }{bind:  }{res}{res}Vote for Candidate{p_end}
{p 0 48}{bind:vtwpar         }{txt}{bind: byte    }{bind:%14.0g    }{space 1}{bind:LABY     }{bind:  }{res}{res}Vote for Party{p_end}
{p 0 48}{bind:nvotdif        }{txt}{bind: byte    }{bind:%15.0g    }{space 1}{bind:NVOTDIF  }{bind:  }{res}{res}Thought Might Vote Differently{p_end}
{p 0 48}{bind:vot90x         }{txt}{bind: byte    }{bind:%14.0g    }{space 1}{bind:LABAB    }{bind:  }{res}{res}Vote in 1990{p_end}
{p 0 48}{bind:vot87x         }{txt}{bind: byte    }{bind:%14.0g    }{space 1}{bind:LABAB    }{bind:  }{res}{res}Vote in 1987{p_end}
{p 0 48}{bind:vtpar          }{txt}{bind: byte    }{bind:%13.0g    }{space 1}{bind:VTPAR    }{bind:  }{res}{res}Party Always Voted For{p_end}
{p 0 48}{bind:refnon         }{txt}{bind: byte    }{bind:%29.0g    }{space 1}{bind:REFNON   }{bind:  }{res}{res}Voted or Did Not Vote in Referendum{p_end}
{p 0 48}{bind:refvot         }{txt}{bind: byte    }{bind:%10.0g    }{space 1}{bind:REFVOT   }{bind:  }{res}{res}Vote in 1993 Referendum{p_end}
{p 0 48}{bind:nstragc        }{txt}{bind: byte    }{bind:%15.0g    }{space 1}{bind:NSTRAGC  }{bind:  }{res}{res}Consider Strategic Vote Local{p_end}
{p 0 48}{bind:nduty          }{txt}{bind: byte    }{bind:%20.0g    }{space 1}{bind:LABP     }{bind:  }{res}{res}Citizens Duty to Vote{p_end}
{p 0 48}{bind:waste          }{txt}{bind: byte    }{bind:%20.0g    }{space 1}{bind:LABP     }{bind:  }{res}{res}Vote is Wasted{p_end}
{p 0 48}{bind:count          }{txt}{bind: byte    }{bind:%20.0g    }{space 1}{bind:LABP     }{bind:  }{res}{res}My vote Really Counts{p_end}
{p 0 48}{bind:nwt            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Final Weight Unvalidated Vote{p_end}
{p 0 48}{bind:vv             }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Validated Votes{p_end}
{p 0 48}{bind:nvot93e        }{txt}{bind: byte    }{bind:%11.0g    }{space 1}{bind:LABZ     }{bind:  }{res}{res}Vote in 1993 after Validation{p_end}
{p 0 48}{bind:nnwt           }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Final Weight Validated Vote{p_end}
{p 0 48}{bind:ptalk          }{txt}{bind: int     }{bind:%37.0g    }{space 1}{bind:LABB     }{bind:  }{res}{res}A2b. Talk about how to vote{p_end}
{p 0 48}{bind:pmmpu          }{txt}{bind: byte    }{bind:%37.0g    }{space 1}{bind:PMMPU    }{bind:  }{res}{res}Which Vote is Most Important{p_end}
{p 0 48}{bind:pp96vt         }{txt}{bind: byte    }{bind:%37.0g    }{space 1}{bind:LABU     }{bind:  }{res}{res}Voted for Party or Not{p_end}
{p 0 48}{bind:pe96vt         }{txt}{bind: byte    }{bind:%37.0g    }{space 1}{bind:LABU     }{bind:  }{res}{res}Voted electorate or Not{p_end}
{p 0 48}{bind:vot96p         }{txt}{bind: byte    }{bind:%37.0g    }{space 1}{bind:LABV     }{bind:  }{res}{res}1996 Party Vote{p_end}
{p 0 48}{bind:vot96if        }{txt}{bind: byte    }{bind:%37.0g    }{space 1}{bind:LABV     }{bind:  }{res}{res}How Nonvoters Might Vote{p_end}
{p 0 48}{bind:vot96e         }{txt}{bind: byte    }{bind:%37.0g    }{space 1}{bind:LABV     }{bind:  }{res}{res}1996 Electorate Vote{p_end}
{p 0 48}{bind:fppima         }{txt}{bind: byte    }{bind:%37.0g    }{space 1}{bind:LABV     }{bind:  }{res}{res}How Would Vote Under FPP{p_end}
{p 0 48}{bind:pvtdifa        }{txt}{bind: int     }{bind:%37.0g    }{space 1}{bind:LABV     }{bind:  }{res}{res}Thought Might Vote Differently{p_end}
{p 0 48}{bind:pvtdifb        }{txt}{bind: int     }{bind:%37.0g    }{space 1}{bind:LABV     }{bind:  }{res}{res}Thought Might Vote Differently{p_end}
{p 0 48}{bind:pvtdifc        }{txt}{bind: int     }{bind:%37.0g    }{space 1}{bind:LABV     }{bind:  }{res}{res}Thought Might Vote Differently{p_end}
{p 0 48}{bind:pvotdif        }{txt}{bind: int     }{bind:%37.0g    }{space 1}{bind:PVOTDIF  }{bind:  }{res}{res}Thought Might Vote Differently{p_end}
{p 0 48}{bind:pvot93e        }{txt}{bind: byte    }{bind:%37.0g    }{space 1}{bind:PVOT93E  }{bind:  }{res}{res}Vote in 1993 Election{p_end}
{p 0 48}{bind:pvot90e        }{txt}{bind: int     }{bind:%37.0g    }{space 1}{bind:PVOT90E  }{bind:  }{res}{res}Vote in 1990{p_end}
{p 0 48}{bind:palways        }{txt}{bind: byte    }{bind:%37.0g    }{space 1}{bind:PALWAYS  }{bind:  }{res}{res}Party Always Voted For{p_end}
{p 0 48}{bind:prefvot        }{txt}{bind: byte    }{bind:%37.0g    }{space 1}{bind:LABAB    }{bind:  }{res}{res}Vote in 1993 Referendum{p_end}
{p 0 48}{bind:pwaste         }{txt}{bind: int     }{bind:%37.0g    }{space 1}{bind:LABJ     }{bind:  }{res}{res}Vote is Wasted{p_end}
{p 0 48}{bind:pduty          }{txt}{bind: byte    }{bind:%37.0g    }{space 1}{bind:LABJ     }{bind:  }{res}{res}Citizens Duty to Vote{p_end}
{p 0 48}{bind:pcount         }{txt}{bind: int     }{bind:%37.0g    }{space 1}{bind:LABJ     }{bind:  }{res}{res}My vote Really Counts{p_end}
{p 0 48}{bind:chance         }{txt}{bind: int     }{bind:%37.0g    }{space 1}{bind:LABJ     }{bind:  }{res}{res}Not important vote if party lose{p_end}
{p 0 48}{bind:pstable        }{txt}{bind: int     }{bind:%37.0g    }{space 1}{bind:LABJ     }{bind:  }{res}{res}Vote for Stable Government{p_end}
{p 0 48}{bind:vot96x         }{txt}{bind: byte    }{bind:%37.0g    }{space 1}{bind:LABV     }{bind:  }{res}{res}1996 Party Vote{p_end}
{p 0 48}{bind:vot96y         }{txt}{bind: byte    }{bind:%37.0g    }{space 1}{bind:LABV     }{bind:  }{res}{res}1993 Electorate Vote{p_end}
{p 0 48}{bind:fppimx         }{txt}{bind: byte    }{bind:%37.0g    }{space 1}{bind:LABV     }{bind:  }{res}{res}How Would Vote Under FPP{p_end}
{p 0 48}{bind:pwt            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}weight for party vote and maori - non campaign samples{p_end}
{p 0 48}{bind:qwtm           }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}weight for party vote/ maori and hsld size (campaign){p_end}
{p 0 48}{bind:pnvot96p       }{txt}{bind: byte    }{bind:%14.0g    }{space 1}{bind:NVOT96P  }{bind:  }{res}{res}Validated Party Vote{p_end}
{p 0 48}{bind:nqwt           }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Full validated party vote weight{p_end}
{p 0 48}{bind:svoted         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Validated vote{p_end}
{p 0 48}{bind:nnvt96p        }{txt}{bind: byte    }{bind:%37.0g    }{space 1}{bind:LABV     }{bind:  }{res}{res}Validated party vote{p_end}
{p 0 48}{bind:cvt96p         }{txt}{bind: byte    }{bind:%37.0g    }{space 1}{bind:LABV     }{bind:  }{res}{res}Corrected unvalidated party vote{p_end}
{p 0 48}{bind:voted          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:voted    }{bind:  }{res}{res}validated vote{p_end}
{p 0 48}{bind:spec           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:spec     }{bind:  }{res}{res}special vote{p_end}
{p 0 48}{bind:type           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:type     }{bind:  }{res}{res}type of vote{p_end}
{p 0 48}{bind:stalk          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABB     }{bind:  }{res}{res}talk about how to vote{p_end}
{p 0 48}{bind:smmpu          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:smmpu    }{bind:  }{res}{res}which vote is most important{p_end}
{p 0 48}{bind:vot99p         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABU     }{bind:  }{res}{res}1999 party vote{p_end}
{p 0 48}{bind:vot99if        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABU     }{bind:  }{res}{res}how nonvoters might vote{p_end}
{p 0 48}{bind:vot99e         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABU     }{bind:  }{res}{res}1999 electorate vote{p_end}
{p 0 48}{bind:sfppima        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABU     }{bind:  }{res}{res}how would vote under fpp{p_end}
{p 0 48}{bind:svtwhnp        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABV     }{bind:  }{res}{res}when made party vote decision{p_end}
{p 0 48}{bind:svtwhne        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABV     }{bind:  }{res}{res}when made electorate vote decision{p_end}
{p 0 48}{bind:svotdif        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:svotdif  }{bind:  }{res}{res}thought might vote differently{p_end}
{p 0 48}{bind:mpref          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:mpref    }{bind:  }{res}{res}mp referendum vote{p_end}
{p 0 48}{bind:crimref        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:crimref  }{bind:  }{res}{res}crime referendum vote{p_end}
{p 0 48}{bind:svot96p        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:svot96p  }{bind:  }{res}{res}1996 party vote{p_end}
{p 0 48}{bind:srefvot        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:srefvot  }{bind:  }{res}{res}vote in 1993 referendum{p_end}
{p 0 48}{bind:ptyprop        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:ptyprop  }{bind:  }{res}{res}party more than half seats or same as votes{p_end}
{p 0 48}{bind:twovote        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABW     }{bind:  }{res}{res}no point in two votes{p_end}
{p 0 48}{bind:elecseat       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABW     }{bind:  }{res}{res}no point in party vote to national or labour{p_end}
{p 0 48}{bind:candlst        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABW     }{bind:  }{res}{res}voters decide party list{p_end}
{p 0 48}{bind:pvotedec       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABX     }{bind:  }{res}{res}party vote decides seats in parliament{p_end}
{p 0 48}{bind:lt5perc        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABX     }{bind:  }{res}{res}no seats if less than 5% vote{p_end}
{p 0 48}{bind:parldec        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABP     }{bind:  }{res}{res}parliament not voters make decisions{p_end}
{p 0 48}{bind:sduty          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABP     }{bind:  }{res}{res}citizens duty to vote{p_end}
{p 0 48}{bind:scount         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABP     }{bind:  }{res}{res}my vote really counts{p_end}
{p 0 48}{bind:vot99pp        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABU     }{bind:  }{res}{res}extended vote in 1999{p_end}
{p 0 48}{bind:vot99ee        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABU     }{bind:  }{res}{res}extended electorate vote{p_end}
{p 0 48}{bind:pvwt           }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}party vote weight on unvalidated voting{p_end}
{p 0 48}{bind:split          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}split or straight vote{p_end}
{p 0 48}{bind:nvot99p        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABU     }{bind:  }{res}{res}validated party vote{p_end}
{p 0 48}{bind:nvot99e        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}validated electorate vote{p_end}
{p 0 48}{bind:nvot99ee       }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:LABU     }{bind:  }{res}{res}extended validated electorate vote{p_end}
{p 0 48}{bind:nvot99pp       }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:LABU     }{bind:  }{res}{res}extended validated party vote{p_end}
{p 0 48}{bind:vvsplit        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}validated split vote{p_end}
{p 0 48}{bind:nnpvwt         }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}validated party vote weight{p_end}
{txt}
{com}. 
. *Personal income
. recode nrincum 9=.
{txt}(32 changes made to {bf:nrincum})

{com}. xtile nrincum3 = nrincum, nq(3)
{txt}
{com}. xtile nrincum4 = nrincum, nq(4)
{txt}
{com}. xtile nrincum5 = nrincum, nq(5)
{txt}
{com}. 
. *Household income
. recode hincome 9=.
{txt}(39 changes made to {bf:hincome})

{com}. xtile hincome3 = hincome, nq(3)
{txt}
{com}. xtile hincome4 = hincome, nq(4)
{txt}
{com}. xtile hincome5 = hincome, nq(5)
{txt}
{com}.  
.         *Narrow middle class (33/33/33)
. recode nrincum3 1=1 2/3=0 else=., gen(lowerclass)
{txt}(390 differences between {bf:nrincum3} and {bf:lowerclass})

{com}. recode nrincum3 2=1 1=0 3=0 else=., gen(middleclass)
{txt}(654 differences between {bf:nrincum3} and {bf:middleclass})

{com}. recode nrincum3 3=1 1/2=0 else=., gen(upperclass)
{txt}(654 differences between {bf:nrincum3} and {bf:upperclass})

{com}. 
.         *Wide middle class (25/50/25)
. recode nrincum4 1=1 2/4=0 else=., gen(lowerclass2)
{txt}(390 differences between {bf:nrincum4} and {bf:lowerclass2})

{com}. recode nrincum4 2/3=1 1=0 4=0 else=., gen(middleclass2)
{txt}(654 differences between {bf:nrincum4} and {bf:middleclass2})

{com}. recode nrincum4 4=1 1/3=0 else=., gen(upperclass2)
{txt}(654 differences between {bf:nrincum4} and {bf:upperclass2})

{com}. 
.         *Wide middle class (20/60/20)
. recode nrincum5 1=1 2/5=0 else=., gen(lowerclass3)
{txt}(390 differences between {bf:nrincum5} and {bf:lowerclass3})

{com}. recode nrincum5 2/4=1 1=0 5=0 else=., gen(middleclass3)
{txt}(654 differences between {bf:nrincum5} and {bf:middleclass3})

{com}. recode nrincum5 5=1 1/4=0 else=., gen(upperclass3)
{txt}(654 differences between {bf:nrincum5} and {bf:upperclass3})

{com}. 
.         *Narrow middle class (40/20/40)
. recode nrincum5 1/2=1 3/5=0 else=., gen(lowerclass4)
{txt}(390 differences between {bf:nrincum5} and {bf:lowerclass4})

{com}. recode nrincum5 3=1 1/2=0 4/5=0 else=., gen(middleclass4)
{txt}(654 differences between {bf:nrincum5} and {bf:middleclass4})

{com}. recode nrincum5 4/5=1 1/3=0 else=., gen(upperclass4)
{txt}(654 differences between {bf:nrincum5} and {bf:upperclass4})

{com}. 
.         *Narrow middle class (33/33/33)
. recode hincome3 1=1 2/3=0 else=., gen(lowerclass5)
{txt}(367 differences between {bf:hincome3} and {bf:lowerclass5})

{com}. recode hincome3 2=1 1=0 3=0 else=., gen(middleclass5)
{txt}(602 differences between {bf:hincome3} and {bf:middleclass5})

{com}. recode hincome3 3=1 1/2=0 else=., gen(upperclass5)
{txt}(602 differences between {bf:hincome3} and {bf:upperclass5})

{com}. 
.         *Wide middle class (25/50/25)
. recode hincome4 1=1 2/4=0 else=., gen(lowerclass6)
{txt}(434 differences between {bf:hincome4} and {bf:lowerclass6})

{com}. recode hincome4 2/3=1 1=0 4=0 else=., gen(middleclass6)
{txt}(602 differences between {bf:hincome4} and {bf:middleclass6})

{com}. recode hincome4 4=1 1/3=0 else=., gen(upperclass6)
{txt}(602 differences between {bf:hincome4} and {bf:upperclass6})

{com}. 
.         *Wide middle class (20/60/20)
. recode hincome5 1=1 2/5=0 else=., gen(lowerclass7)
{txt}(434 differences between {bf:hincome5} and {bf:lowerclass7})

{com}. recode hincome5 2/4=1 1=0 5=0 else=., gen(middleclass7)
{txt}(602 differences between {bf:hincome5} and {bf:middleclass7})

{com}. recode hincome5 5=1 1/4=0 else=., gen(upperclass7)
{txt}(602 differences between {bf:hincome5} and {bf:upperclass7})

{com}. 
.         *Narrow middle class (40/20/40)
. recode hincome5 1/2=1 3/5=0 else=., gen(lowerclass8)
{txt}(434 differences between {bf:hincome5} and {bf:lowerclass8})

{com}. recode hincome5 3=1 1/2=0 4/5=0 else=., gen(middleclass8)
{txt}(602 differences between {bf:hincome5} and {bf:middleclass8})

{com}. recode hincome5 4/5=1 1/3=0 else=., gen(upperclass8)
{txt}(602 differences between {bf:hincome5} and {bf:upperclass8})

{com}. 
. tab nrincum3

{txt}3 quantiles {c |}
 of nrincum {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        264       40.37       40.37
{txt}          2 {c |}{res}        187       28.59       68.96
{txt}          3 {c |}{res}        203       31.04      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        654      100.00
{txt}
{com}. tab nrincum4

{txt}4 quantiles {c |}
 of nrincum {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        264       40.37       40.37
{txt}          2 {c |}{res}        122       18.65       59.02
{txt}          3 {c |}{res}        142       21.71       80.73
{txt}          4 {c |}{res}        126       19.27      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        654      100.00
{txt}
{com}. tab nrincum5

{txt}5 quantiles {c |}
 of nrincum {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        264       40.37       40.37
{txt}          3 {c |}{res}        187       28.59       68.96
{txt}          4 {c |}{res}         77       11.77       80.73
{txt}          5 {c |}{res}        126       19.27      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        654      100.00
{txt}
{com}. 
. tab hincome3

{txt}3 quantiles {c |}
 of hincome {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        235       39.04       39.04
{txt}          2 {c |}{res}        267       44.35       83.39
{txt}          3 {c |}{res}        100       16.61      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        602      100.00
{txt}
{com}. tab hincome4

{txt}4 quantiles {c |}
 of hincome {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        168       27.91       27.91
{txt}          2 {c |}{res}        154       25.58       53.49
{txt}          3 {c |}{res}        180       29.90       83.39
{txt}          4 {c |}{res}        100       16.61      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        602      100.00
{txt}
{com}. tab hincome5

{txt}5 quantiles {c |}
 of hincome {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        168       27.91       27.91
{txt}          2 {c |}{res}        154       25.58       53.49
{txt}          3 {c |}{res}         75       12.46       65.95
{txt}          4 {c |}{res}        105       17.44       83.39
{txt}          5 {c |}{res}        100       16.61      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        602      100.00
{txt}
{com}. 
. sum lowerclass* middleclass* upperclass*

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}lowerclass {c |}{res}        654    .4036697    .4910083          0          1
{txt}{space 1}lowerclass2 {c |}{res}        654    .4036697    .4910083          0          1
{txt}{space 1}lowerclass3 {c |}{res}        654    .4036697    .4910083          0          1
{txt}{space 1}lowerclass4 {c |}{res}        654    .4036697    .4910083          0          1
{txt}{space 1}lowerclass5 {c |}{res}        602    .3903654    .4882379          0          1
{txt}{hline 13}{c +}{hline 57}
{space 1}lowerclass6 {c |}{res}        602    .2790698    .4489149          0          1
{txt}{space 1}lowerclass7 {c |}{res}        602    .2790698    .4489149          0          1
{txt}{space 1}lowerclass8 {c |}{res}        602    .5348837    .4991964          0          1
{txt}{space 1}middleclass {c |}{res}        654    .2859327    .4522034          0          1
{txt}middleclass2 {c |}{res}        654    .4036697    .4910083          0          1
{txt}{hline 13}{c +}{hline 57}
middleclass3 {c |}{res}        654    .4036697    .4910083          0          1
{txt}middleclass4 {c |}{res}        654    .2859327    .4522034          0          1
{txt}middleclass5 {c |}{res}        602    .4435216    .4972131          0          1
{txt}middleclass6 {c |}{res}        602    .5548173    .4973993          0          1
{txt}middleclass7 {c |}{res}        602    .5548173    .4973993          0          1
{txt}{hline 13}{c +}{hline 57}
middleclass8 {c |}{res}        602    .1245847    .3305221          0          1
{txt}{space 2}upperclass {c |}{res}        654    .3103976    .4630105          0          1
{txt}{space 1}upperclass2 {c |}{res}        654    .1926606    .3946906          0          1
{txt}{space 1}upperclass3 {c |}{res}        654    .1926606    .3946906          0          1
{txt}{space 1}upperclass4 {c |}{res}        654    .3103976    .4630105          0          1
{txt}{hline 13}{c +}{hline 57}
{space 1}upperclass5 {c |}{res}        602     .166113    .3724915          0          1
{txt}{space 1}upperclass6 {c |}{res}        602     .166113    .3724915          0          1
{txt}{space 1}upperclass7 {c |}{res}        602     .166113    .3724915          0          1
{txt}{space 1}upperclass8 {c |}{res}        602    .3405316    .4742821          0          1
{txt}
{com}. 
. ******
. 
. ****3) Controls
. 
. *Respondent Environment Growth
. mvdecode envrsp, mv(0)
      {txt}envrsp:{res}{col 15}30{txt} missing values generated

{com}. 
. rename nage age
{res}{txt}
{com}. gen female=1 if nsex==2
{txt}(370 missing values generated)

{com}. replace female=0 if nsex==1
{txt}(370 real changes made)

{com}. gen ideol=nlscale
{txt}(59 missing values generated)

{com}. mvdecode ideol, mv(0 8)
       {txt}ideol:{res}{col 15}161{txt} missing values generated

{com}. *ideol has lots of MVs
. 
. gen edu=edqual
{txt}(19 missing values generated)

{com}. gen uni=0 if edqual!=.
{txt}(19 missing values generated)

{com}. replace uni=1 if edqual==6
{txt}(83 real changes made)

{com}. 
. gen RUDE=nurbn
{txt}(5 missing values generated)

{com}. recode RUDE (5=1) (1=5) (2=4) (4=2)
{txt}(559 changes made to {bf:RUDE})

{com}. 
. gen religiosity=ngodgo
{txt}(4 missing values generated)

{com}. recode religiosity (5=1) (1=5) (4=2) (2=4)
{txt}(688 changes made to {bf:religiosity})

{com}. 
. sum age female ideol edu RUDE religiosity

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}age {c |}{res}        755    49.95629    14.87274         18         86
{txt}{space 6}female {c |}{res}        761    .5137976    .5001383          0          1
{txt}{space 7}ideol {c |}{res}        541    4.157116    1.235018          1          7
{txt}{space 9}edu {c |}{res}        742    2.568733    2.272286          0          6
{txt}{space 8}RUDE {c |}{res}        756    3.078042    1.421871          1          5
{txt}{hline 13}{c +}{hline 57}
{space 1}religiosity {c |}{res}        757    2.174373    1.431405          1          5
{txt}
{com}. 
. ******
. 
. ****4) Mechanisms
. 
. /*
> taxr            byte    %13.0g     LABH       Importance of Tax
> taxes           byte    %19.0g     LABF       Reduce Taxes
> taxi            byte    %16.0g     TAXI       Taxes and Health and Education
> taxresp         byte    %12.0g     LABQ       Respondent Redistribution
> youtax          byte    %8.0g      YOUTAX     More or Less Tax
> */
. 
. sum taxr taxes taxi taxresp youtax

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}taxr {c |}{res}        723    2.250346    .9942267          1          5
{txt}{space 7}taxes {c |}{res}        714     2.87535     1.18541          0          5
{txt}{space 8}taxi {c |}{res}        752    3.505319    1.078774          1          6
{txt}{space 5}taxresp {c |}{res}        718    3.135097    1.704819          0          7
{txt}{space 6}youtax {c |}{res}        721    2.421637    .7282232          0          3
{txt}
{com}. 
. tab taxr

 {txt}Importance {c |}
     of Tax {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        185       25.59       25.59
{txt}          2 {c |}{res}        256       35.41       61.00
{txt}          3 {c |}{res}        218       30.15       91.15
{txt}          4 {c |}{res}         44        6.09       97.23
{txt}          5 {c |}{res}         20        2.77      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        723      100.00
{txt}
{com}. tab taxes

     {txt}Reduce {c |}
      Taxes {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         31        4.34        4.34
{txt}          1 {c |}{res}         50        7.00       11.34
{txt}          2 {c |}{res}        168       23.53       34.87
{txt}          3 {c |}{res}        240       33.61       68.49
{txt}          4 {c |}{res}        178       24.93       93.42
{txt}          5 {c |}{res}         47        6.58      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        714      100.00
{txt}
{com}. tab taxresp

 {txt}Respondent {c |}
Redistribut {c |}
        ion {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         59        8.22        8.22
{txt}          1 {c |}{res}         89       12.40       20.61
{txt}          2 {c |}{res}         79       11.00       31.62
{txt}          3 {c |}{res}        176       24.51       56.13
{txt}          4 {c |}{res}        171       23.82       79.94
{txt}          5 {c |}{res}         84       11.70       91.64
{txt}          6 {c |}{res}         48        6.69       98.33
{txt}          7 {c |}{res}         12        1.67      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        718      100.00
{txt}
{com}. tab youtax

    {txt}More or {c |}
   Less Tax {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         25        3.47        3.47
{txt}          1 {c |}{res}         28        3.88        7.35
{txt}          2 {c |}{res}        286       39.67       47.02
{txt}          3 {c |}{res}        382       52.98      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        721      100.00
{txt}
{com}. 
. /*Salience*/
. 
. gen taxr_2=taxr
{txt}(38 missing values generated)

{com}. 
. mvdecode taxr, mv(0)
{txt}
{com}. 
. gen salient=1 if taxr<3
{txt}(320 missing values generated)

{com}. replace salient=0 if taxr>2 & taxr!=.
{txt}(282 real changes made)

{com}. 
. recode taxr (5=1) (1=5) (4=2) (2=4)
{txt}(505 changes made to {bf:taxr})

{com}. 
. replace taxr=2 if taxr==1
{txt}(20 real changes made)

{com}. 
. recode taxr_2 (5=1) (1=5) (4=2) (2=4)
{txt}(505 changes made to {bf:taxr_2})

{com}. replace taxr_2=0 if taxr==.
{txt}(38 real changes made)

{com}. 
. *salience now is good: from less to more
. 
. /*Position*/
. 
. tab taxes

     {txt}Reduce {c |}
      Taxes {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         31        4.34        4.34
{txt}          1 {c |}{res}         50        7.00       11.34
{txt}          2 {c |}{res}        168       23.53       34.87
{txt}          3 {c |}{res}        240       33.61       68.49
{txt}          4 {c |}{res}        178       24.93       93.42
{txt}          5 {c |}{res}         47        6.58      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        714      100.00
{txt}
{com}. gen taxes_2=taxes
{txt}(47 missing values generated)

{com}. mvdecode taxes, mv(0)
       {txt}taxes:{res}{col 15}31{txt} missing values generated

{com}. recode taxes (5=1) (1=5) (4=2) (2=4)
{txt}(443 changes made to {bf:taxes})

{com}. 
. tab taxresp

 {txt}Respondent {c |}
Redistribut {c |}
        ion {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         59        8.22        8.22
{txt}          1 {c |}{res}         89       12.40       20.61
{txt}          2 {c |}{res}         79       11.00       31.62
{txt}          3 {c |}{res}        176       24.51       56.13
{txt}          4 {c |}{res}        171       23.82       79.94
{txt}          5 {c |}{res}         84       11.70       91.64
{txt}          6 {c |}{res}         48        6.69       98.33
{txt}          7 {c |}{res}         12        1.67      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        718      100.00
{txt}
{com}. gen taxresp_2=taxresp
{txt}(43 missing values generated)

{com}. mvdecode taxresp, mv(0)
     {txt}taxresp:{res}{col 15}59{txt} missing values generated

{com}. recode taxresp (7=1) (1=7) (6=2) (2=6) (5=3) (3=5)
{txt}(488 changes made to {bf:taxresp})

{com}. 
. tab youtax

    {txt}More or {c |}
   Less Tax {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         25        3.47        3.47
{txt}          1 {c |}{res}         28        3.88        7.35
{txt}          2 {c |}{res}        286       39.67       47.02
{txt}          3 {c |}{res}        382       52.98      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        721      100.00
{txt}
{com}. gen youtax_2=youtax
{txt}(40 missing values generated)

{com}. mvdecode youtax, mv(0)
      {txt}youtax:{res}{col 15}25{txt} missing values generated

{com}. recode youtax (1=3) (2=1) (3=2)
{txt}(696 changes made to {bf:youtax})

{com}. 
. tab taxi

  {txt}Taxes and {c |}
 Health and {c |}
  Education {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         37        4.92        4.92
{txt}          2 {c |}{res}         70        9.31       14.23
{txt}          3 {c |}{res}        263       34.97       49.20
{txt}          4 {c |}{res}        260       34.57       83.78
{txt}          5 {c |}{res}        102       13.56       97.34
{txt}          6 {c |}{res}         20        2.66      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        752      100.00
{txt}
{com}. gen taxi_2=taxi
{txt}(9 missing values generated)

{com}. mvdecode taxi, mv(6)
        {txt}taxi:{res}{col 15}20{txt} missing values generated

{com}. 
. pwcorr taxr taxes taxi taxresp youtax, sig

             {txt}{c |}     taxr    taxes     taxi  taxresp   youtax
{hline 13}{c +}{hline 45}
        taxr {c |} {res}  1.0000 
             {txt}{c |}
             {c |}
       taxes {c |} {res}  0.2669   1.0000 
             {txt}{c |}{res}   0.0000
             {txt}{c |}
        taxi {c |} {res} -0.2275  -0.4596   1.0000 
             {txt}{c |}{res}   0.0000   0.0000
             {txt}{c |}
     taxresp {c |} {res} -0.0905  -0.1625   0.3652   1.0000 
             {txt}{c |}{res}   0.0214   0.0001   0.0000
             {txt}{c |}
      youtax {c |} {res} -0.2133  -0.3951   0.3182   0.0330   1.0000 
             {txt}{c |}{res}   0.0000   0.0000   0.0000   0.4097
             {txt}{c |}

{com}. 
. ********************************************************************************
. * Standardizing numerical predictors as suggested by Gelman 2008
. ********************************************************************************
. 
. gen ideol_sq=ideol*ideol
{txt}(220 missing values generated)

{com}. 
. foreach var of varlist age ideol ideol_sq edu RUDE religiosity envrsp {c -(} 
{txt}  2{com}.         quietly: sum `var' 
{txt}  3{com}.         gen `var'_r = (`var' - `r(mean)') / (2 * `r(sd)') 
{txt}  4{com}. {c )-}
{txt}(6 missing values generated)
(220 missing values generated)
(220 missing values generated)
(19 missing values generated)
(5 missing values generated)
(4 missing values generated)
(83 missing values generated)

{com}. 
. label var age "Age"
{txt}
{com}. label var ideol "Ideology"
{txt}
{com}. label var edu "Education"
{txt}
{com}. label var RUDE "Rural-urban divide"
{txt}
{com}. label var religiosity "Religiosity"
{txt}
{com}. label var envrsp "Env-growth attitudes"
{txt}
{com}. 
. ********************************************************************************
. 
. * PREPARATION OF THE DATASET: Panel Analysis
. 
. ********************************************************************************
. 
. gen id=_n
{txt}
{com}. expand 3
{txt}(1,522 observations created)

{com}. bysort id: gen id2=_n
{txt}
{com}. 
. gen DV_1=DV_93_1 if id2==1
{txt}(1,594 missing values generated)

{com}. replace DV_1=DV_96_1 if id2==2 
{txt}(614 real changes made)

{com}. replace DV_1=DV_99_1 if id2==3
{txt}(594 real changes made)

{com}. 
. gen treatment=0
{txt}
{com}. replace treatment=1 if id2==2 | id2==3
{txt}(1,522 real changes made)

{com}. 
. gen treatment_96=0
{txt}
{com}. replace treatment_96=1 if id2==2
{txt}(761 real changes made)

{com}. 
. gen treatment_99=0
{txt}
{com}. replace treatment_99=1 if id2==3
{txt}(761 real changes made)

{com}. 
. gen middle_96=treatment_96*middleclass
{txt}(321 missing values generated)

{com}. gen middle_99=treatment_99*middleclass
{txt}(321 missing values generated)

{com}. 
. gen middle_96_bis=treatment_96*upperclass
{txt}(321 missing values generated)

{com}. gen middle_99_bis=treatment_99*upperclass
{txt}(321 missing values generated)

{com}. 
. gen day=nday if id2==1
{txt}(1,524 missing values generated)

{com}. replace day=qday if id2==2
{txt}(755 real changes made)

{com}. replace day=sday if id2==3
{txt}(759 real changes made)

{com}. 
. *Because of lack of power...
. replace day=21 if day==20
{txt}(84 real changes made)

{com}. replace day=28 if day==27
{txt}(15 real changes made)

{com}. 
. gen ideol_2=ideol
{txt}(660 missing values generated)

{com}. replace ideol_2=2 if ideol==1
{txt}(57 real changes made)

{com}. replace ideol_2=6 if ideol==7
{txt}(45 real changes made)

{com}. 
. gen envrsp_2=envrsp
{txt}(249 missing values generated)

{com}. replace envrsp_2=2 if envrsp==1
{txt}(153 real changes made)

{com}. replace envrsp_2=6 if envrsp==7
{txt}(174 real changes made)

{com}. 
. /*
> taxr            byte    %13.0g     LABH       Importance of Tax (reverse code (done), 5 cats)
> taxes           byte    %19.0g     LABF       Reduce Taxes (reverse code (done) 4 cats)
> taxi            byte    %16.0g     TAXI       Taxes and Health and Education (5)
> taxresp         byte    %12.0g     LABQ       Respondent Redistribution (reverse code (done), 7)
> youtax          byte    %8.0g      YOUTAX     More or Less Tax
> 
> ptax            byte    %37.0g     LABF       Importance of Tax Rates (we need to reverse, 5 cats)
> ptaxes          int     %37.0g     LABJ       Reduce Taxes (we need to reverse, 5 cats)
> ptaxi           int     %37.0g     PTAXI      Taxes and Health and Education (5)
> ptaxr           int     %37.0g     LABO       Respondent Redistribution (we need to reverse, 7)
> qyoutax         int     %37.0g     QYOUTAX    More or Less Tax
> 
> stax            byte    %8.0g      LABE       importance of tax (we need to reverse, 5 cats)
> staxes          byte    %8.0g      LABN       reduce taxes (we need to reverse, 5 cats)
> staxi           byte    %8.0g      staxi      taxes and health and education (7)
> staxr           byte    %8.0g      staxr      respondent redistribution (we need to reverse, 7)
> syoutax         byte    %8.0g      syoutax    more or less tax
> */
. 
. mvdecode ptax, mv(0 9 887)
{txt}
{com}. 
. gen salient_2=1 if ptax<3
{txt}(882 missing values generated)

{com}. replace salient_2=0 if ptax>2 & ptax!=.
{txt}(783 real changes made)

{com}. 
. recode ptax (5=1) (1=5) (4=2) (2=4)
{txt}(1,605 changes made to {bf:ptax})

{com}. 
. mvdecode stax, mv(9)
{txt}
{com}. recode stax (5=1) (1=5) (4=2) (2=4)
{txt}(1,428 changes made to {bf:stax})

{com}. 
. gen sal=taxr if id2==1
{txt}(1,560 missing values generated)

{com}. replace sal=ptax if id2==2
{txt}(728 real changes made)

{com}. replace sal=stax if id2==3
{txt}(705 real changes made)

{com}. 
. mvdecode ptaxes, mv(0 887)
      {txt}ptaxes:{res}{col 15}114{txt} missing values generated

{com}. mvdecode staxes, mv(9)
      {txt}staxes:{res}{col 15}84{txt} missing values generated

{com}. 
. recode ptaxes (5=1) (1=5) (4=2) (2=4)
{txt}(1,533 changes made to {bf:ptaxes})

{com}. recode staxes (5=1) (1=5) (4=2) (2=4)
{txt}(1,509 changes made to {bf:staxes})

{com}. 
. gen pos=taxes if id2==1
{txt}(1,600 missing values generated)

{com}. replace pos=ptaxes if id2==2
{txt}(696 real changes made)

{com}. replace pos=staxes if id2==3
{txt}(714 real changes made)

{com}. 
. mvdecode taxi, mv(0 9 887)
{txt}
{com}. mvdecode ptaxi, mv(0 9 887)
       {txt}ptaxi:{res}{col 15}75{txt} missing values generated

{com}. mvdecode staxi, mv(0 9 887)
       {txt}staxi:{res}{col 15}45{txt} missing values generated

{com}. 
. *the (small) problem with taxes and taxi is that they don't use the same exact metric over waves
. 
. mvdecode ptaxr, mv(0 887)
       {txt}ptaxr:{res}{col 15}114{txt} missing values generated

{com}. mvdecode staxr, mv(9)
       {txt}staxr:{res}{col 15}69{txt} missing values generated

{com}. 
. recode ptaxr (7=1) (1=7) (6=2) (2=6) (5=3) (3=5)
{txt}(1,623 changes made to {bf:ptaxr})

{com}. recode staxr (7=1) (1=7) (6=2) (2=6) (5=3) (3=5)
{txt}(1,530 changes made to {bf:staxr})

{com}. 
. gen pos_2=taxresp if id2==1
{txt}(1,624 missing values generated)

{com}. replace pos_2=ptaxr if id2==2
{txt}(709 real changes made)

{com}. replace pos_2=staxr if id2==3
{txt}(695 real changes made)

{com}. 
. mvdecode qyoutax, mv(0 887)
     {txt}qyoutax:{res}{col 15}93{txt} missing values generated

{com}. mvdecode syoutax, mv(9)
     {txt}syoutax:{res}{col 15}48{txt} missing values generated

{com}. 
. recode qyoutax (1=3) (2=1) (3=2)
{txt}(2,139 changes made to {bf:qyoutax})

{com}. recode syoutax (1=3) (2=1) (3=2)
{txt}(2,094 changes made to {bf:syoutax})

{com}. 
. gen pos_3=youtax if id2==1
{txt}(1,587 missing values generated)

{com}. replace pos_3=qyoutax if id2==2
{txt}(713 real changes made)

{com}. replace pos_3=syoutax if id2==3
{txt}(698 real changes made)

{com}. 
. gen pos_4=taxi if id2==1
{txt}(1,551 missing values generated)

{com}. replace pos_4=ptaxi if id2==2
{txt}(713 real changes made)

{com}. replace pos_4=staxi if id2==3
{txt}(703 real changes made)

{com}. 
. sum sal pos* taxes taxi

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}sal {c |}{res}      2,156    3.749536    .9567805          1          5
{txt}{space 6}postmt {c |}{res}      2,124    45.01836     32.9547          0        100
{txt}{space 6}postph {c |}{res}      2,283    .0407359     .197721          0          1
{txt}{space 9}pos {c |}{res}      2,093    3.159102    1.071091          1          5
{txt}{space 7}pos_2 {c |}{res}      2,063    4.372758    1.590824          1          7
{txt}{hline 13}{c +}{hline 57}
{space 7}pos_3 {c |}{res}      2,107    1.593735    .5616069          1          3
{txt}{space 7}pos_4 {c |}{res}      2,148    3.763966    1.436002          1          7
{txt}{space 7}taxes {c |}{res}      2,049    2.994143      1.0369          1          5
{txt}{space 8}taxi {c |}{res}      2,196    3.437158    1.009821          1          5
{txt}
{com}. 
. pwcorr taxr ptax stax

             {txt}{c |}     taxr     ptax     stax
{hline 13}{c +}{hline 27}
        taxr {c |} {res}  1.0000 
        {txt}ptax {c |} {res}  0.4085   1.0000 
        {txt}stax {c |} {res}  0.3219   0.3759   1.0000 
{txt}
{com}. pwcorr taxes ptaxes staxes

             {txt}{c |}    taxes   ptaxes   staxes
{hline 13}{c +}{hline 27}
       taxes {c |} {res}  1.0000 
      {txt}ptaxes {c |} {res}  0.4825   1.0000 
      {txt}staxes {c |} {res}  0.4254   0.4517   1.0000 
{txt}
{com}. pwcorr taxi ptaxi staxi

             {txt}{c |}     taxi    ptaxi    staxi
{hline 13}{c +}{hline 27}
        taxi {c |} {res}  1.0000 
       {txt}ptaxi {c |} {res}  0.4629   1.0000 
       {txt}staxi {c |} {res}  0.4219   0.5006   1.0000 
{txt}
{com}. pwcorr taxresp ptaxr staxr

             {txt}{c |}  taxresp    ptaxr    staxr
{hline 13}{c +}{hline 27}
     taxresp {c |} {res}  1.0000 
       {txt}ptaxr {c |} {res}  0.5585   1.0000 
       {txt}staxr {c |} {res}  0.4551   0.5662   1.0000 
{txt}
{com}. pwcorr youtax qyoutax syoutax

             {txt}{c |}   youtax  qyoutax  syoutax
{hline 13}{c +}{hline 27}
      youtax {c |} {res}  1.0000 
     {txt}qyoutax {c |} {res}  0.4182   1.0000 
     {txt}syoutax {c |} {res}  0.3141   0.4591   1.0000 
{txt}
{com}. 
. ********************************************************************************
. 
. ***** DESCRIPTIVE STATISTICS
. 
. ********************************************************************************
. 
. egen missing = rowmiss(DV_1 middleclass treatment treatment_96 treatment_99 upperclass ideol_2 day sal pos_2 envrsp religiosity RUDE)
{txt}
{com}. 
. sum DV_1 DV_93_1 DV_96_1 middleclass treatment treatment_96 treatment_99 upperclass ideol day sal pos_2 envrsp_r religiosity_r RUDE_r if missing == 0 & DV_93_1!=. & DV_96_1!=. & DV_99_1!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=.

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}DV_1 {c |}{res}        771    .4085603    .4918868          0          1
{txt}{space 5}DV_93_1 {c |}{res}        771    .4124514    .4925951          0          1
{txt}{space 5}DV_96_1 {c |}{res}        771    .4124514    .4925951          0          1
{txt}{space 1}middleclass {c |}{res}        771    .2412451    .4281164          0          1
{txt}{space 3}treatment {c |}{res}        771    .6666667    .4717105          0          1
{txt}{hline 13}{c +}{hline 57}
treatment_96 {c |}{res}        771    .3333333    .4717105          0          1
{txt}treatment_99 {c |}{res}        771    .3333333    .4717105          0          1
{txt}{space 2}upperclass {c |}{res}        771    .3618677    .4808527          0          1
{txt}{space 7}ideol {c |}{res}        771    4.050584    1.261326          1          7
{txt}{space 9}day {c |}{res}        771    15.18288    7.936208          1         31
{txt}{hline 13}{c +}{hline 57}
{space 9}sal {c |}{res}        771    3.705577    .9549366          1          5
{txt}{space 7}pos_2 {c |}{res}        771    4.499351    1.546151          1          7
{txt}{space 4}envrsp_r {c |}{res}        771   -.0153387    .4896264  -.9504814   .9246681
{txt}religiosit~r {c |}{res}        771    .0111265    .4953101  -.4102168   .9870121
{txt}{space 6}RUDE_r {c |}{res}        771     .061495    .4831691  -.7307425   .6758553
{txt}
{com}. 
. ***shockingly enough, the DV has the same mean in 1993 and 1996
. 
. ********************************************************************************
. 
. ***** ANALYSIS
. 
. ********************************************************************************
. 
. *Each Table:
. **93 vs 96
. **93 vs 96+99
. **93 vs 96 vs 99
. 
. ***In order to avoid the situation where one case only appears in one wave of the analyses, ///
> /// we restrict them to those cases that have valid values across all waves for all variables
> 
. *Main Analysis Logit NZ (Table C1 & Figures 3 and 4)
. 
. eststo clear
{txt}
{com}. 
. eststo: logit DV_1 middleclass##treatment upperclass i.ideol_2 i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r if DV_93_1!=. & DV_96_1!=. & DV_99_1!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=. & id2<3, vce(cluster id) or

{res}{txt}Iteration 0:{space 2}Log pseudolikelihood = {res:-348.35751}  
Iteration 1:{space 2}Log pseudolikelihood = {res:-204.06935}  
Iteration 2:{space 2}Log pseudolikelihood = {res:-198.20069}  
Iteration 3:{space 2}Log pseudolikelihood = {res: -198.0894}  
Iteration 4:{space 2}Log pseudolikelihood = {res:-198.08926}  
Iteration 5:{space 2}Log pseudolikelihood = {res:-198.08926}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:514}
{txt}{col 57}{lalign 13:Wald chi2({res:49})}{col 70} = {res}{ralign 6:181.06}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-198.08926}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.4314}

{txt}{ralign 87:(Std. err. adjusted for {res:257} clusters in {res:id})}
{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}                 DV_1{col 23}{c |} Odds ratio{col 35}   std. err.{col 47}      z{col 55}   P>|z|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}1.middleclass {c |}{col 23}{res}{space 2} 2.295252{col 35}{space 2} 1.056262{col 46}{space 1}    1.81{col 55}{space 3}0.071{col 63}{space 4} .9313491{col 76}{space 3} 5.656508
{txt}{space 10}1.treatment {c |}{col 23}{res}{space 2} .8199918{col 35}{space 2} .2715988{col 46}{space 1}   -0.60{col 55}{space 3}0.549{col 63}{space 4} .4284236{col 76}{space 3} 1.569443
{txt}{space 21} {c |}
middleclass#treatment {c |}
{space 17}1 1  {c |}{col 23}{res}{space 2} .3334022{col 35}{space 2} .1570509{col 46}{space 1}   -2.33{col 55}{space 3}0.020{col 63}{space 4} .1324358{col 76}{space 3} .8393276
{txt}{space 21} {c |}
{space 11}upperclass {c |}{col 23}{res}{space 2} 3.806182{col 35}{space 2}  1.55806{col 46}{space 1}    3.27{col 55}{space 3}0.001{col 63}{space 4}  1.70628{col 76}{space 3} 8.490411
{txt}{space 21} {c |}
{space 14}ideol_2 {c |}
{space 19}3  {c |}{col 23}{res}{space 2} .8961381{col 35}{space 2} .7501851{col 46}{space 1}   -0.13{col 55}{space 3}0.896{col 63}{space 4} .1737031{col 76}{space 3} 4.623196
{txt}{space 19}4  {c |}{col 23}{res}{space 2} 4.375653{col 35}{space 2}  3.33436{col 46}{space 1}    1.94{col 55}{space 3}0.053{col 63}{space 4} .9826651{col 76}{space 3}  19.4841
{txt}{space 19}5  {c |}{col 23}{res}{space 2} 20.98555{col 35}{space 2} 16.96603{col 46}{space 1}    3.76{col 55}{space 3}0.000{col 63}{space 4} 4.302846{col 76}{space 3} 102.3493
{txt}{space 19}6  {c |}{col 23}{res}{space 2}  57.7058{col 35}{space 2} 50.93671{col 46}{space 1}    4.59{col 55}{space 3}0.000{col 63}{space 4} 10.22979{col 76}{space 3} 325.5159
{txt}{space 21} {c |}
{space 18}day {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .0707803{col 35}{space 2} .1302359{col 46}{space 1}   -1.44{col 55}{space 3}0.150{col 63}{space 4} .0019218{col 76}{space 3} 2.606903
{txt}{space 19}3  {c |}{col 23}{res}{space 2} .0155486{col 35}{space 2} .0249118{col 46}{space 1}   -2.60{col 55}{space 3}0.009{col 63}{space 4} .0006728{col 76}{space 3} .3593164
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .3235354{col 35}{space 2} .2731854{col 46}{space 1}   -1.34{col 55}{space 3}0.181{col 63}{space 4} .0618284{col 76}{space 3} 1.692995
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .2641304{col 35}{space 2} .2634537{col 46}{space 1}   -1.33{col 55}{space 3}0.182{col 63}{space 4} .0373936{col 76}{space 3} 1.865689
{txt}{space 19}6  {c |}{col 23}{res}{space 2} .7075845{col 35}{space 2} .5030837{col 46}{space 1}   -0.49{col 55}{space 3}0.627{col 63}{space 4} .1756244{col 76}{space 3} 2.850834
{txt}{space 19}7  {c |}{col 23}{res}{space 2}  .252455{col 35}{space 2} .2703104{col 46}{space 1}   -1.29{col 55}{space 3}0.199{col 63}{space 4} .0309584{col 76}{space 3} 2.058679
{txt}{space 19}8  {c |}{col 23}{res}{space 2} .2367295{col 35}{space 2} .1948187{col 46}{space 1}   -1.75{col 55}{space 3}0.080{col 63}{space 4}  .047179{col 76}{space 3} 1.187835
{txt}{space 19}9  {c |}{col 23}{res}{space 2} .8036935{col 35}{space 2} .9349188{col 46}{space 1}   -0.19{col 55}{space 3}0.851{col 63}{space 4} .0822066{col 76}{space 3} 7.857317
{txt}{space 18}10  {c |}{col 23}{res}{space 2} .1193365{col 35}{space 2} .1288444{col 46}{space 1}   -1.97{col 55}{space 3}0.049{col 63}{space 4} .0143798{col 76}{space 3} .9903599
{txt}{space 18}11  {c |}{col 23}{res}{space 2} .1758367{col 35}{space 2} .1364873{col 46}{space 1}   -2.24{col 55}{space 3}0.025{col 63}{space 4} .0384055{col 76}{space 3} .8050556
{txt}{space 18}12  {c |}{col 23}{res}{space 2} 1.566852{col 35}{space 2} 1.774435{col 46}{space 1}    0.40{col 55}{space 3}0.692{col 63}{space 4} .1702376{col 76}{space 3} 14.42117
{txt}{space 18}13  {c |}{col 23}{res}{space 2} .1466174{col 35}{space 2} .1873162{col 46}{space 1}   -1.50{col 55}{space 3}0.133{col 63}{space 4} .0119868{col 76}{space 3} 1.793362
{txt}{space 18}14  {c |}{col 23}{res}{space 2} .0540979{col 35}{space 2} .0524265{col 46}{space 1}   -3.01{col 55}{space 3}0.003{col 63}{space 4} .0080961{col 76}{space 3} .3614792
{txt}{space 18}15  {c |}{col 23}{res}{space 2} .2701479{col 35}{space 2} .1961142{col 46}{space 1}   -1.80{col 55}{space 3}0.071{col 63}{space 4} .0651135{col 76}{space 3} 1.120811
{txt}{space 18}16  {c |}{col 23}{res}{space 2} .2259365{col 35}{space 2} .1504171{col 46}{space 1}   -2.23{col 55}{space 3}0.025{col 63}{space 4} .0612773{col 76}{space 3} .8330543
{txt}{space 18}17  {c |}{col 23}{res}{space 2} .2473773{col 35}{space 2} .2020104{col 46}{space 1}   -1.71{col 55}{space 3}0.087{col 63}{space 4} .0499185{col 76}{space 3} 1.225909
{txt}{space 18}18  {c |}{col 23}{res}{space 2} .0738856{col 35}{space 2} .0600568{col 46}{space 1}   -3.21{col 55}{space 3}0.001{col 63}{space 4} .0150201{col 76}{space 3} .3634515
{txt}{space 18}19  {c |}{col 23}{res}{space 2} .2630659{col 35}{space 2} .2241073{col 46}{space 1}   -1.57{col 55}{space 3}0.117{col 63}{space 4} .0495361{col 76}{space 3} 1.397037
{txt}{space 18}21  {c |}{col 23}{res}{space 2} .1999202{col 35}{space 2} .1610942{col 46}{space 1}   -2.00{col 55}{space 3}0.046{col 63}{space 4} .0412064{col 76}{space 3} .9699483
{txt}{space 18}22  {c |}{col 23}{res}{space 2} .2424219{col 35}{space 2}  .182401{col 46}{space 1}   -1.88{col 55}{space 3}0.060{col 63}{space 4} .0554776{col 76}{space 3} 1.059317
{txt}{space 18}23  {c |}{col 23}{res}{space 2} .3118967{col 35}{space 2} .2243021{col 46}{space 1}   -1.62{col 55}{space 3}0.105{col 63}{space 4} .0761842{col 76}{space 3}   1.2769
{txt}{space 18}24  {c |}{col 23}{res}{space 2} .1112127{col 35}{space 2} .1379403{col 46}{space 1}   -1.77{col 55}{space 3}0.077{col 63}{space 4}  .009781{col 76}{space 3} 1.264516
{txt}{space 18}25  {c |}{col 23}{res}{space 2} .2332375{col 35}{space 2}  .182371{col 46}{space 1}   -1.86{col 55}{space 3}0.063{col 63}{space 4} .0503772{col 76}{space 3} 1.079848
{txt}{space 18}26  {c |}{col 23}{res}{space 2} 1.492507{col 35}{space 2}  5.61982{col 46}{space 1}    0.11{col 55}{space 3}0.915{col 63}{space 4} .0009308{col 76}{space 3} 2393.277
{txt}{space 18}28  {c |}{col 23}{res}{space 2} .1559656{col 35}{space 2} .1623414{col 46}{space 1}   -1.79{col 55}{space 3}0.074{col 63}{space 4} .0202783{col 76}{space 3} 1.199574
{txt}{space 18}29  {c |}{col 23}{res}{space 2}  .325449{col 35}{space 2} .2800586{col 46}{space 1}   -1.30{col 55}{space 3}0.192{col 63}{space 4} .0602557{col 76}{space 3} 1.757792
{txt}{space 18}30  {c |}{col 23}{res}{space 2} .0836534{col 35}{space 2} .0889247{col 46}{space 1}   -2.33{col 55}{space 3}0.020{col 63}{space 4} .0104146{col 76}{space 3} .6719281
{txt}{space 18}31  {c |}{col 23}{res}{space 2} .2096951{col 35}{space 2}  .162043{col 46}{space 1}   -2.02{col 55}{space 3}0.043{col 63}{space 4} .0461124{col 76}{space 3} .9535841
{txt}{space 21} {c |}
{space 18}sal {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .2021734{col 35}{space 2} .2184026{col 46}{space 1}   -1.48{col 55}{space 3}0.139{col 63}{space 4} .0243329{col 76}{space 3} 1.679789
{txt}{space 19}3  {c |}{col 23}{res}{space 2} .1843173{col 35}{space 2} .1993652{col 46}{space 1}   -1.56{col 55}{space 3}0.118{col 63}{space 4} .0221244{col 76}{space 3} 1.535538
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .2635179{col 35}{space 2} .2812202{col 46}{space 1}   -1.25{col 55}{space 3}0.211{col 63}{space 4} .0325408{col 76}{space 3}  2.13399
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .1994084{col 35}{space 2} .2152199{col 46}{space 1}   -1.49{col 55}{space 3}0.135{col 63}{space 4} .0240463{col 76}{space 3}  1.65363
{txt}{space 21} {c |}
{space 16}pos_2 {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .1826523{col 35}{space 2} .2824049{col 46}{space 1}   -1.10{col 55}{space 3}0.271{col 63}{space 4} .0088217{col 76}{space 3} 3.781786
{txt}{space 19}3  {c |}{col 23}{res}{space 2} .2759788{col 35}{space 2} .4161809{col 46}{space 1}   -0.85{col 55}{space 3}0.393{col 63}{space 4} .0143631{col 76}{space 3} 5.302771
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .0505286{col 35}{space 2}  .074916{col 46}{space 1}   -2.01{col 55}{space 3}0.044{col 63}{space 4} .0027638{col 76}{space 3} .9237762
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .0498583{col 35}{space 2} .0722524{col 46}{space 1}   -2.07{col 55}{space 3}0.039{col 63}{space 4} .0029122{col 76}{space 3} .8536115
{txt}{space 19}6  {c |}{col 23}{res}{space 2} .0348254{col 35}{space 2} .0519298{col 46}{space 1}   -2.25{col 55}{space 3}0.024{col 63}{space 4} .0018734{col 76}{space 3} .6473865
{txt}{space 19}7  {c |}{col 23}{res}{space 2}  .005862{col 35}{space 2} .0094146{col 46}{space 1}   -3.20{col 55}{space 3}0.001{col 63}{space 4} .0002518{col 76}{space 3} .1364931
{txt}{space 21} {c |}
{space 13}envrsp_r {c |}{col 23}{res}{space 2} 1.908921{col 35}{space 2} .6583403{col 46}{space 1}    1.87{col 55}{space 3}0.061{col 63}{space 4} .9710226{col 76}{space 3} 3.752724
{txt}{space 8}religiosity_r {c |}{col 23}{res}{space 2} 2.122326{col 35}{space 2} .6891991{col 46}{space 1}    2.32{col 55}{space 3}0.020{col 63}{space 4} 1.123039{col 76}{space 3} 4.010784
{txt}{space 15}RUDE_r {c |}{col 23}{res}{space 2} .7561478{col 35}{space 2} .2419007{col 46}{space 1}   -0.87{col 55}{space 3}0.382{col 63}{space 4} .4039217{col 76}{space 3} 1.415521
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 23.79031{col 35}{space 2} 47.55571{col 46}{space 1}    1.59{col 55}{space 3}0.113{col 63}{space 4}  .473029{col 76}{space 3} 1196.499
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}
({res}est1{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est1:est1}}{col 14}{c |}{res}{col 16}       514{col 28}-348.3575{col 39}-198.0893{col 50}    50{col 58} 496.1785{col 69} 708.2897
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M1
{txt}
{com}. 
. *Figure 4
. contrast middleclass#treatment
{res}
{txt}Contrasts of marginal linear predictions

{txt}{p2colset 1 10 10 2}{...}
{p2col:Margins:}{res:asbalanced}{p_end}
{p2colreset}{...}

{res}{col 1}{text}{hline 22}{c TT}{hline 11}{hline 12}{hline 11}
{col 23}{text}{c |}         df{col 35}        chi2{col 47}     P>chi2
{res}{col 1}{text}{hline 22}{c +}{hline 11}{hline 12}{hline 11}
middleclass#treatment {res}{col 23}{text}{c |}{result}{space 2}        1{col 35}{space 3}     5.44{col 47}{space 2}   0.0197
{col 1}{text}{hline 22}{c BT}{hline 11}{hline 12}{hline 11}
{res}{txt}
{com}. margins, at(middleclass=(1) treatment=(0 1)) level(90)
{res}
{txt}{col 1}Predictive margins{col 60}{lalign 13:Number of obs}{col 73} = {res}{ralign 3:514}
{txt}{col 1}Model VCE: {res:Robust}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(DV_1), predict()}{p_end}
{p2colreset}{...}
{lalign 7:1._at: }{space 0}{lalign 11:middleclass} = {res:{ralign 1:1}}
{lalign 7:}{space 0}{lalign 11:treatment} = {res:{ralign 1:0}}
{lalign 7:2._at: }{space 0}{lalign 11:middleclass} = {res:{ralign 1:1}}
{lalign 7:}{space 0}{lalign 11:treatment} = {res:{ralign 1:1}}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [90% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}_at {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .5197045{col 26}{space 2} .0469887{col 37}{space 1}   11.06{col 46}{space 3}0.000{col 54}{space 4}  .442415{col 67}{space 3}  .596994
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .3592348{col 26}{space 2} .0440776{col 37}{space 1}    8.15{col 46}{space 3}0.000{col 54}{space 4} .2867336{col 67}{space 3} .4317361
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. marginsplot, plotopts(connect(none)) title("", position(12)) xtitle("Probability of Voting Right for the Middle-Income Group") ytitle("Electoral System") horizontal xline(.4377132) yscale(range(-.1(.1)1.1)) ylabel(0 "FPP" 1 "PR(MMP)") xlabel(, grid glwidth(medthin) glcolor(gs8) glpattern(dot)) name(Figure4, replace) 
{res}
{text}{p 0 0 2}Variables that uniquely identify margins: {bf:treatment}{p_end}
{res}{txt}
{com}. graph save Figure4, replace
{res}{txt}file {bf:Figure4.gph} saved

{com}. dis (.4405434+.434883)/2
{res}.4377132
{txt}
{com}. 
. *
. 
. eststo: logit DV_1 middleclass##treatment upperclass i.ideol_2 i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r if DV_93_1!=. & DV_96_1!=. & DV_99_1!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=., vce(cluster id) or

{res}{txt}Iteration 0:{space 2}Log pseudolikelihood = {res:-521.45063}  
Iteration 1:{space 2}Log pseudolikelihood = {res:-307.83018}  
Iteration 2:{space 2}Log pseudolikelihood = {res:-299.76356}  
Iteration 3:{space 2}Log pseudolikelihood = {res:-299.25996}  
Iteration 4:{space 2}Log pseudolikelihood = {res: -299.2582}  
Iteration 5:{space 2}Log pseudolikelihood = {res: -299.2582}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:771}
{txt}{col 57}{lalign 13:Wald chi2({res:49})}{col 70} = {res}{ralign 6:235.75}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 9:-299.2582}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.4261}

{txt}{ralign 87:(Std. err. adjusted for {res:257} clusters in {res:id})}
{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}                 DV_1{col 23}{c |} Odds ratio{col 35}   std. err.{col 47}      z{col 55}   P>|z|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}1.middleclass {c |}{col 23}{res}{space 2} 2.289493{col 35}{space 2} 1.029744{col 46}{space 1}    1.84{col 55}{space 3}0.066{col 63}{space 4}  .948189{col 76}{space 3}   5.5282
{txt}{space 10}1.treatment {c |}{col 23}{res}{space 2} .8751691{col 35}{space 2} .2181099{col 46}{space 1}   -0.54{col 55}{space 3}0.593{col 63}{space 4} .5369765{col 76}{space 3} 1.426358
{txt}{space 21} {c |}
middleclass#treatment {c |}
{space 17}1 1  {c |}{col 23}{res}{space 2} .3938187{col 35}{space 2} .1779993{col 46}{space 1}   -2.06{col 55}{space 3}0.039{col 63}{space 4} .1623932{col 76}{space 3} .9550472
{txt}{space 21} {c |}
{space 11}upperclass {c |}{col 23}{res}{space 2} 3.521189{col 35}{space 2} 1.283477{col 46}{space 1}    3.45{col 55}{space 3}0.001{col 63}{space 4} 1.723556{col 76}{space 3} 7.193714
{txt}{space 21} {c |}
{space 14}ideol_2 {c |}
{space 19}3  {c |}{col 23}{res}{space 2} .7931665{col 35}{space 2}   .65055{col 46}{space 1}   -0.28{col 55}{space 3}0.778{col 63}{space 4} .1589331{col 76}{space 3} 3.958352
{txt}{space 19}4  {c |}{col 23}{res}{space 2} 4.281593{col 35}{space 2} 3.277613{col 46}{space 1}    1.90{col 55}{space 3}0.057{col 63}{space 4} .9549922{col 76}{space 3} 19.19601
{txt}{space 19}5  {c |}{col 23}{res}{space 2} 17.47941{col 35}{space 2} 14.00754{col 46}{space 1}    3.57{col 55}{space 3}0.000{col 63}{space 4} 3.634091{col 76}{space 3}  84.0732
{txt}{space 19}6  {c |}{col 23}{res}{space 2} 42.60987{col 35}{space 2} 37.04784{col 46}{space 1}    4.32{col 55}{space 3}0.000{col 63}{space 4} 7.752099{col 76}{space 3} 234.2077
{txt}{space 21} {c |}
{space 18}day {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .1968724{col 35}{space 2}  .209958{col 46}{space 1}   -1.52{col 55}{space 3}0.128{col 63}{space 4} .0243448{col 76}{space 3} 1.592075
{txt}{space 19}3  {c |}{col 23}{res}{space 2}  .052662{col 35}{space 2} .0512957{col 46}{space 1}   -3.02{col 55}{space 3}0.003{col 63}{space 4} .0078051{col 76}{space 3} .3553156
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .4744821{col 35}{space 2}  .370158{col 46}{space 1}   -0.96{col 55}{space 3}0.339{col 63}{space 4} .1028422{col 76}{space 3} 2.189113
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .3297885{col 35}{space 2} .2871575{col 46}{space 1}   -1.27{col 55}{space 3}0.203{col 63}{space 4} .0598503{col 76}{space 3} 1.817206
{txt}{space 19}6  {c |}{col 23}{res}{space 2} .4787117{col 35}{space 2} .2934688{col 46}{space 1}   -1.20{col 55}{space 3}0.229{col 63}{space 4} .1439642{col 76}{space 3} 1.591818
{txt}{space 19}7  {c |}{col 23}{res}{space 2} .3418421{col 35}{space 2}  .244937{col 46}{space 1}   -1.50{col 55}{space 3}0.134{col 63}{space 4} .0839309{col 76}{space 3} 1.392288
{txt}{space 19}8  {c |}{col 23}{res}{space 2} .3125336{col 35}{space 2} .1967408{col 46}{space 1}   -1.85{col 55}{space 3}0.065{col 63}{space 4} .0910045{col 76}{space 3} 1.073323
{txt}{space 19}9  {c |}{col 23}{res}{space 2} .6812158{col 35}{space 2} .6131153{col 46}{space 1}   -0.43{col 55}{space 3}0.670{col 63}{space 4} .1167285{col 76}{space 3} 3.975506
{txt}{space 18}10  {c |}{col 23}{res}{space 2} .3893086{col 35}{space 2} .2719358{col 46}{space 1}   -1.35{col 55}{space 3}0.177{col 63}{space 4} .0990197{col 76}{space 3} 1.530617
{txt}{space 18}11  {c |}{col 23}{res}{space 2} .2569244{col 35}{space 2} .1942682{col 46}{space 1}   -1.80{col 55}{space 3}0.072{col 63}{space 4} .0583696{col 76}{space 3}   1.1309
{txt}{space 18}12  {c |}{col 23}{res}{space 2} 2.015587{col 35}{space 2} 2.171655{col 46}{space 1}    0.65{col 55}{space 3}0.515{col 63}{space 4} .2439447{col 76}{space 3} 16.65374
{txt}{space 18}13  {c |}{col 23}{res}{space 2}  .104264{col 35}{space 2} .1037562{col 46}{space 1}   -2.27{col 55}{space 3}0.023{col 63}{space 4} .0148279{col 76}{space 3} .7331452
{txt}{space 18}14  {c |}{col 23}{res}{space 2} .1192914{col 35}{space 2} .0831496{col 46}{space 1}   -3.05{col 55}{space 3}0.002{col 63}{space 4} .0304296{col 76}{space 3} .4676508
{txt}{space 18}15  {c |}{col 23}{res}{space 2} .4792999{col 35}{space 2} .3010883{col 46}{space 1}   -1.17{col 55}{space 3}0.242{col 63}{space 4} .1399254{col 76}{space 3} 1.641792
{txt}{space 18}16  {c |}{col 23}{res}{space 2} .3894278{col 35}{space 2} .2373688{col 46}{space 1}   -1.55{col 55}{space 3}0.122{col 63}{space 4} .1179213{col 76}{space 3} 1.286061
{txt}{space 18}17  {c |}{col 23}{res}{space 2}  .283264{col 35}{space 2} .2007459{col 46}{space 1}   -1.78{col 55}{space 3}0.075{col 63}{space 4} .0706244{col 76}{space 3}  1.13613
{txt}{space 18}18  {c |}{col 23}{res}{space 2} .1295994{col 35}{space 2} .0970997{col 46}{space 1}   -2.73{col 55}{space 3}0.006{col 63}{space 4} .0298441{col 76}{space 3} .5627921
{txt}{space 18}19  {c |}{col 23}{res}{space 2} .3457224{col 35}{space 2} .2948988{col 46}{space 1}   -1.25{col 55}{space 3}0.213{col 63}{space 4} .0649619{col 76}{space 3}  1.83991
{txt}{space 18}21  {c |}{col 23}{res}{space 2} .3633491{col 35}{space 2} .2415516{col 46}{space 1}   -1.52{col 55}{space 3}0.128{col 63}{space 4} .0987306{col 76}{space 3} 1.337199
{txt}{space 18}22  {c |}{col 23}{res}{space 2} .3982715{col 35}{space 2} .2709566{col 46}{space 1}   -1.35{col 55}{space 3}0.176{col 63}{space 4} .1049736{col 76}{space 3} 1.511048
{txt}{space 18}23  {c |}{col 23}{res}{space 2} .4780404{col 35}{space 2} .3139552{col 46}{space 1}   -1.12{col 55}{space 3}0.261{col 63}{space 4} .1319575{col 76}{space 3} 1.731789
{txt}{space 18}24  {c |}{col 23}{res}{space 2} .2071675{col 35}{space 2} .2296832{col 46}{space 1}   -1.42{col 55}{space 3}0.156{col 63}{space 4} .0235835{col 76}{space 3} 1.819846
{txt}{space 18}25  {c |}{col 23}{res}{space 2}  .405547{col 35}{space 2} .3033286{col 46}{space 1}   -1.21{col 55}{space 3}0.228{col 63}{space 4} .0936236{col 76}{space 3} 1.756697
{txt}{space 18}26  {c |}{col 23}{res}{space 2} 1.882386{col 35}{space 2}  3.22649{col 46}{space 1}    0.37{col 55}{space 3}0.712{col 63}{space 4} .0654204{col 76}{space 3} 54.16319
{txt}{space 18}28  {c |}{col 23}{res}{space 2} .5628476{col 35}{space 2} .4421677{col 46}{space 1}   -0.73{col 55}{space 3}0.464{col 63}{space 4} .1206966{col 76}{space 3} 2.624742
{txt}{space 18}29  {c |}{col 23}{res}{space 2} .4771192{col 35}{space 2} .3459179{col 46}{space 1}   -1.02{col 55}{space 3}0.307{col 63}{space 4} .1152111{col 76}{space 3} 1.975875
{txt}{space 18}30  {c |}{col 23}{res}{space 2} .1254566{col 35}{space 2} .1319677{col 46}{space 1}   -1.97{col 55}{space 3}0.048{col 63}{space 4}  .015963{col 76}{space 3} .9859888
{txt}{space 18}31  {c |}{col 23}{res}{space 2} .2960958{col 35}{space 2} .2296499{col 46}{space 1}   -1.57{col 55}{space 3}0.117{col 63}{space 4} .0647509{col 76}{space 3} 1.353999
{txt}{space 21} {c |}
{space 18}sal {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .2875562{col 35}{space 2} .2354604{col 46}{space 1}   -1.52{col 55}{space 3}0.128{col 63}{space 4} .0577738{col 76}{space 3} 1.431246
{txt}{space 19}3  {c |}{col 23}{res}{space 2} .2793075{col 35}{space 2} .2306079{col 46}{space 1}   -1.54{col 55}{space 3}0.122{col 63}{space 4} .0553726{col 76}{space 3} 1.408867
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .4565753{col 35}{space 2} .3700323{col 46}{space 1}   -0.97{col 55}{space 3}0.333{col 63}{space 4} .0932512{col 76}{space 3} 2.235477
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .3286257{col 35}{space 2}  .274362{col 46}{space 1}   -1.33{col 55}{space 3}0.183{col 63}{space 4} .0639813{col 76}{space 3} 1.687913
{txt}{space 21} {c |}
{space 16}pos_2 {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .2647283{col 35}{space 2} .2192932{col 46}{space 1}   -1.60{col 55}{space 3}0.109{col 63}{space 4} .0522023{col 76}{space 3}  1.34249
{txt}{space 19}3  {c |}{col 23}{res}{space 2} .3200435{col 35}{space 2} .2674131{col 46}{space 1}   -1.36{col 55}{space 3}0.173{col 63}{space 4} .0622279{col 76}{space 3}  1.64601
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .0553759{col 35}{space 2} .0439286{col 46}{space 1}   -3.65{col 55}{space 3}0.000{col 63}{space 4} .0116971{col 76}{space 3} .2621574
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .0543279{col 35}{space 2} .0413374{col 46}{space 1}   -3.83{col 55}{space 3}0.000{col 63}{space 4}  .012228{col 76}{space 3} .2413747
{txt}{space 19}6  {c |}{col 23}{res}{space 2} .0348305{col 35}{space 2} .0291462{col 46}{space 1}   -4.01{col 55}{space 3}0.000{col 63}{space 4} .0067558{col 76}{space 3} .1795745
{txt}{space 19}7  {c |}{col 23}{res}{space 2} .0076671{col 35}{space 2} .0075455{col 46}{space 1}   -4.95{col 55}{space 3}0.000{col 63}{space 4} .0011141{col 76}{space 3} .0527634
{txt}{space 21} {c |}
{space 13}envrsp_r {c |}{col 23}{res}{space 2} 1.871256{col 35}{space 2} .6314468{col 46}{space 1}    1.86{col 55}{space 3}0.063{col 63}{space 4} .9658266{col 76}{space 3} 3.625495
{txt}{space 8}religiosity_r {c |}{col 23}{res}{space 2} 2.335794{col 35}{space 2}  .722586{col 46}{space 1}    2.74{col 55}{space 3}0.006{col 63}{space 4} 1.273833{col 76}{space 3} 4.283085
{txt}{space 15}RUDE_r {c |}{col 23}{res}{space 2} .8066589{col 35}{space 2} .2500525{col 46}{space 1}   -0.69{col 55}{space 3}0.488{col 63}{space 4} .4393695{col 76}{space 3} 1.480983
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 9.279232{col 35}{space 2} 12.82948{col 46}{space 1}    1.61{col 55}{space 3}0.107{col 63}{space 4}  .617504{col 76}{space 3}  139.439
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}
({res}est2{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est2:est2}}{col 14}{c |}{res}{col 16}       771{col 28}-521.4506{col 39}-299.2582{col 50}    50{col 58} 698.5164{col 69} 930.9008
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M2
{txt}
{com}. 
. *
. 
. eststo: logit DV_1 i.middleclass i.treatment_96 i.treatment_99 middle_96 middle_99 upperclass i.ideol_2 i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r if DV_93_1!=. & DV_96_1!=. & DV_99_1!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=., vce(cluster id) or

{res}{txt}Iteration 0:{space 2}Log pseudolikelihood = {res:-521.45063}  
Iteration 1:{space 2}Log pseudolikelihood = {res:-307.56637}  
Iteration 2:{space 2}Log pseudolikelihood = {res:-299.56152}  
Iteration 3:{space 2}Log pseudolikelihood = {res:-299.07458}  
Iteration 4:{space 2}Log pseudolikelihood = {res:-299.07293}  
Iteration 5:{space 2}Log pseudolikelihood = {res:-299.07293}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:771}
{txt}{col 57}{lalign 13:Wald chi2({res:51})}{col 70} = {res}{ralign 6:236.09}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-299.07293}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.4265}

{txt}{ralign 80:(Std. err. adjusted for {res:257} clusters in {res:id})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}          DV_1{col 16}{c |} Odds ratio{col 28}   std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}1.middleclass {c |}{col 16}{res}{space 2} 2.285962{col 28}{space 2} 1.029287{col 39}{space 1}    1.84{col 48}{space 3}0.066{col 56}{space 4} .9458088{col 69}{space 3} 5.525029
{txt}1.treatment_96 {c |}{col 16}{res}{space 2}  .956375{col 28}{space 2} .2741301{col 39}{space 1}   -0.16{col 48}{space 3}0.876{col 56}{space 4} .5453112{col 69}{space 3} 1.677305
{txt}1.treatment_99 {c |}{col 16}{res}{space 2}  .794217{col 28}{space 2} .2158783{col 39}{space 1}   -0.85{col 48}{space 3}0.397{col 56}{space 4} .4661995{col 69}{space 3} 1.353027
{txt}{space 5}middle_96 {c |}{col 16}{res}{space 2} .3403486{col 28}{space 2} .1562293{col 39}{space 1}   -2.35{col 48}{space 3}0.019{col 56}{space 4} .1384201{col 69}{space 3} .8368523
{txt}{space 5}middle_99 {c |}{col 16}{res}{space 2} .4582882{col 28}{space 2} .2492636{col 39}{space 1}   -1.43{col 48}{space 3}0.151{col 56}{space 4} .1578225{col 69}{space 3} 1.330787
{txt}{space 4}upperclass {c |}{col 16}{res}{space 2} 3.516841{col 28}{space 2} 1.282001{col 39}{space 1}    3.45{col 48}{space 3}0.001{col 56}{space 4} 1.721323{col 69}{space 3} 7.185268
{txt}{space 14} {c |}
{space 7}ideol_2 {c |}
{space 12}3  {c |}{col 16}{res}{space 2} .7896459{col 28}{space 2} .6452665{col 39}{space 1}   -0.29{col 48}{space 3}0.773{col 56}{space 4} .1591714{col 69}{space 3} 3.917416
{txt}{space 12}4  {c |}{col 16}{res}{space 2} 4.212562{col 28}{space 2} 3.219173{col 39}{space 1}    1.88{col 48}{space 3}0.060{col 56}{space 4} .9420451{col 69}{space 3}  18.8374
{txt}{space 12}5  {c |}{col 16}{res}{space 2} 17.28697{col 28}{space 2} 13.79897{col 39}{space 1}    3.57{col 48}{space 3}0.000{col 56}{space 4} 3.616298{col 69}{space 3} 82.63678
{txt}{space 12}6  {c |}{col 16}{res}{space 2} 42.01648{col 28}{space 2} 36.43748{col 39}{space 1}    4.31{col 48}{space 3}0.000{col 56}{space 4} 7.677885{col 69}{space 3} 229.9311
{txt}{space 14} {c |}
{space 11}day {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .1994515{col 28}{space 2} .2158101{col 39}{space 1}   -1.49{col 48}{space 3}0.136{col 56}{space 4} .0239233{col 69}{space 3} 1.662849
{txt}{space 12}3  {c |}{col 16}{res}{space 2} .0542656{col 28}{space 2} .0532518{col 39}{space 1}   -2.97{col 48}{space 3}0.003{col 56}{space 4} .0079291{col 69}{space 3} .3713847
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .4524986{col 28}{space 2} .3602374{col 39}{space 1}   -1.00{col 48}{space 3}0.319{col 56}{space 4} .0950538{col 69}{space 3} 2.154095
{txt}{space 12}5  {c |}{col 16}{res}{space 2} .3243258{col 28}{space 2} .2868827{col 39}{space 1}   -1.27{col 48}{space 3}0.203{col 56}{space 4} .0572862{col 69}{space 3} 1.836169
{txt}{space 12}6  {c |}{col 16}{res}{space 2}  .489489{col 28}{space 2} .2978963{col 39}{space 1}   -1.17{col 48}{space 3}0.240{col 56}{space 4} .1484955{col 69}{space 3} 1.613513
{txt}{space 12}7  {c |}{col 16}{res}{space 2} .3604653{col 28}{space 2} .2639153{col 39}{space 1}   -1.39{col 48}{space 3}0.163{col 56}{space 4} .0858331{col 69}{space 3} 1.513812
{txt}{space 12}8  {c |}{col 16}{res}{space 2}  .329414{col 28}{space 2} .2116758{col 39}{space 1}   -1.73{col 48}{space 3}0.084{col 56}{space 4}  .093492{col 69}{space 3} 1.160673
{txt}{space 12}9  {c |}{col 16}{res}{space 2} .7255768{col 28}{space 2} .6616622{col 39}{space 1}   -0.35{col 48}{space 3}0.725{col 56}{space 4} .1214681{col 69}{space 3} 4.334154
{txt}{space 11}10  {c |}{col 16}{res}{space 2} .4147079{col 28}{space 2} .2934955{col 39}{space 1}   -1.24{col 48}{space 3}0.214{col 56}{space 4} .1035936{col 69}{space 3} 1.660166
{txt}{space 11}11  {c |}{col 16}{res}{space 2}  .254831{col 28}{space 2} .1928628{col 39}{space 1}   -1.81{col 48}{space 3}0.071{col 56}{space 4}  .057815{col 69}{space 3} 1.123218
{txt}{space 11}12  {c |}{col 16}{res}{space 2} 1.937495{col 28}{space 2} 2.106833{col 39}{space 1}    0.61{col 48}{space 3}0.543{col 56}{space 4} .2299554{col 69}{space 3} 16.32441
{txt}{space 11}13  {c |}{col 16}{res}{space 2} .1078699{col 28}{space 2} .1059127{col 39}{space 1}   -2.27{col 48}{space 3}0.023{col 56}{space 4}  .015745{col 69}{space 3}  .739022
{txt}{space 11}14  {c |}{col 16}{res}{space 2} .1191678{col 28}{space 2} .0843637{col 39}{space 1}   -3.00{col 48}{space 3}0.003{col 56}{space 4} .0297549{col 69}{space 3} .4772645
{txt}{space 11}15  {c |}{col 16}{res}{space 2} .4889781{col 28}{space 2} .3030752{col 39}{space 1}   -1.15{col 48}{space 3}0.248{col 56}{space 4}  .145112{col 69}{space 3}  1.64769
{txt}{space 11}16  {c |}{col 16}{res}{space 2} .3945652{col 28}{space 2} .2391294{col 39}{space 1}   -1.53{col 48}{space 3}0.125{col 56}{space 4} .1202933{col 69}{space 3} 1.294185
{txt}{space 11}17  {c |}{col 16}{res}{space 2}  .291316{col 28}{space 2} .2052366{col 39}{space 1}   -1.75{col 48}{space 3}0.080{col 56}{space 4} .0732284{col 69}{space 3} 1.158908
{txt}{space 11}18  {c |}{col 16}{res}{space 2} .1293447{col 28}{space 2} .0965808{col 39}{space 1}   -2.74{col 48}{space 3}0.006{col 56}{space 4} .0299338{col 69}{space 3} .5589015
{txt}{space 11}19  {c |}{col 16}{res}{space 2} .3482753{col 28}{space 2} .2973885{col 39}{space 1}   -1.24{col 48}{space 3}0.217{col 56}{space 4} .0653268{col 69}{space 3} 1.856754
{txt}{space 11}21  {c |}{col 16}{res}{space 2} .3690362{col 28}{space 2} .2437046{col 39}{space 1}   -1.51{col 48}{space 3}0.131{col 56}{space 4} .1011466{col 69}{space 3} 1.346439
{txt}{space 11}22  {c |}{col 16}{res}{space 2}  .394395{col 28}{space 2} .2690625{col 39}{space 1}   -1.36{col 48}{space 3}0.173{col 56}{space 4} .1035686{col 69}{space 3} 1.501878
{txt}{space 11}23  {c |}{col 16}{res}{space 2} .4762834{col 28}{space 2} .3115487{col 39}{space 1}   -1.13{col 48}{space 3}0.257{col 56}{space 4} .1321519{col 69}{space 3} 1.716554
{txt}{space 11}24  {c |}{col 16}{res}{space 2} .2136599{col 28}{space 2}  .234615{col 39}{space 1}   -1.41{col 48}{space 3}0.160{col 56}{space 4} .0248335{col 69}{space 3} 1.838264
{txt}{space 11}25  {c |}{col 16}{res}{space 2} .4034158{col 28}{space 2} .2997933{col 39}{space 1}   -1.22{col 48}{space 3}0.222{col 56}{space 4} .0940142{col 69}{space 3} 1.731061
{txt}{space 11}26  {c |}{col 16}{res}{space 2} 2.028764{col 28}{space 2} 3.512126{col 39}{space 1}    0.41{col 48}{space 3}0.683{col 56}{space 4} .0681806{col 69}{space 3} 60.36739
{txt}{space 11}28  {c |}{col 16}{res}{space 2} .5624055{col 28}{space 2} .4609127{col 39}{space 1}   -0.70{col 48}{space 3}0.483{col 56}{space 4} .1128385{col 69}{space 3} 2.803119
{txt}{space 11}29  {c |}{col 16}{res}{space 2} .4729155{col 28}{space 2} .3430268{col 39}{space 1}   -1.03{col 48}{space 3}0.302{col 56}{space 4} .1141219{col 69}{space 3} 1.959738
{txt}{space 11}30  {c |}{col 16}{res}{space 2} .1197003{col 28}{space 2} .1258198{col 39}{space 1}   -2.02{col 48}{space 3}0.043{col 56}{space 4} .0152538{col 69}{space 3} .9393194
{txt}{space 11}31  {c |}{col 16}{res}{space 2} .2794621{col 28}{space 2} .2167362{col 39}{space 1}   -1.64{col 48}{space 3}0.100{col 56}{space 4} .0611189{col 69}{space 3} 1.277822
{txt}{space 14} {c |}
{space 11}sal {c |}
{space 12}2  {c |}{col 16}{res}{space 2}  .285224{col 28}{space 2} .2307335{col 39}{space 1}   -1.55{col 48}{space 3}0.121{col 56}{space 4} .0584254{col 69}{space 3}  1.39242
{txt}{space 12}3  {c |}{col 16}{res}{space 2} .2767923{col 28}{space 2} .2253187{col 39}{space 1}   -1.58{col 48}{space 3}0.115{col 56}{space 4} .0561365{col 69}{space 3} 1.364779
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .4525183{col 28}{space 2}   .36199{col 39}{space 1}   -0.99{col 48}{space 3}0.322{col 56}{space 4} .0943455{col 69}{space 3} 2.170457
{txt}{space 12}5  {c |}{col 16}{res}{space 2} .3246128{col 28}{space 2} .2667335{col 39}{space 1}   -1.37{col 48}{space 3}0.171{col 56}{space 4} .0648538{col 69}{space 3} 1.624785
{txt}{space 14} {c |}
{space 9}pos_2 {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .2723139{col 28}{space 2} .2258048{col 39}{space 1}   -1.57{col 48}{space 3}0.117{col 56}{space 4} .0536102{col 69}{space 3} 1.383224
{txt}{space 12}3  {c |}{col 16}{res}{space 2} .3296974{col 28}{space 2} .2745593{col 39}{space 1}   -1.33{col 48}{space 3}0.183{col 56}{space 4} .0644567{col 69}{space 3}  1.68641
{txt}{space 12}4  {c |}{col 16}{res}{space 2}  .056646{col 28}{space 2} .0446626{col 39}{space 1}   -3.64{col 48}{space 3}0.000{col 56}{space 4} .0120792{col 69}{space 3} .2656436
{txt}{space 12}5  {c |}{col 16}{res}{space 2}  .055363{col 28}{space 2} .0420974{col 39}{space 1}   -3.81{col 48}{space 3}0.000{col 56}{space 4} .0124731{col 69}{space 3} .2457334
{txt}{space 12}6  {c |}{col 16}{res}{space 2} .0347712{col 28}{space 2} .0291594{col 39}{space 1}   -4.01{col 48}{space 3}0.000{col 56}{space 4} .0067204{col 69}{space 3} .1799053
{txt}{space 12}7  {c |}{col 16}{res}{space 2} .0077224{col 28}{space 2} .0075971{col 39}{space 1}   -4.94{col 48}{space 3}0.000{col 56}{space 4}  .001123{col 69}{space 3} .0531054
{txt}{space 14} {c |}
{space 6}envrsp_r {c |}{col 16}{res}{space 2} 1.876184{col 28}{space 2} .6318694{col 39}{space 1}    1.87{col 48}{space 3}0.062{col 56}{space 4} .9696258{col 69}{space 3} 3.630336
{txt}{space 1}religiosity_r {c |}{col 16}{res}{space 2} 2.336942{col 28}{space 2} .7226831{col 39}{space 1}    2.74{col 48}{space 3}0.006{col 56}{space 4} 1.274735{col 69}{space 3} 4.284263
{txt}{space 8}RUDE_r {c |}{col 16}{res}{space 2} .8018043{col 28}{space 2} .2483908{col 39}{space 1}   -0.71{col 48}{space 3}0.476{col 56}{space 4} .4368928{col 69}{space 3} 1.471506
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  9.23017{col 28}{space 2} 12.70399{col 39}{space 1}    1.61{col 48}{space 3}0.106{col 56}{space 4} .6218055{col 69}{space 3}  137.014
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}
({res}est3{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est3:est3}}{col 14}{c |}{res}{col 16}       771{col 28}-521.4506{col 39}-299.0729{col 50}    52{col 58} 702.1459{col 69} 943.8256
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M3
{txt}
{com}. 
. *Figure 3
. coefplot M1 M2 M3, drop(_cons *.day *.sal *.pos_2 *.ideol_2) ///
> xtitle("Odds ratios") ///
> coeflabels(1.middleclass="Middle income" 1.treatment="PR (MMP) system" 1.middleclass#1.treatment="Middle income # PR"upperclass="Upper income" age_r="Age" female="Female" ideol_r="Left-right ideology" uni="Univ. degree" envrsp_r="Env-growth attitudes" RUDE_r="Habitat size" 1.treatment_96="1996 election (PR)" 1.treatment_99="1999 election (PR)" religiosity_r="Church attendance" middle_96="Middle income # 1996" middle_99="Middle income # 1999", ///
> labsize(small)) xline(1, lcolor(red)) subtitle(, size(medium) bcolor(gs12)) levels(95 90) plotlabels("Treatment=1996" "Treatment=1996 & 1999" "Treatment=1996 or 1999") ///
> legend(size(small) region(lwidth(none)) position(4) col(1)) eform
{res}{txt}
{com}. 
. graph save Figure3, replace
{res}{txt}file {bf:Figure3.gph} saved

{com}. 
. esttab using TableC1.rtf, eform ///
>         label title (Main logit NZ) nonumbers mtitles ("M1" "M2" "M3") ///
>         starlevels(+ 0.1 * 0.05 ** 0.01 *** 0.001) ///
>         b(2) se(2) r2 ///  
>         varlabels(_cons Constant) replace
{txt}(tabulating estimates stored by eststo; specify "." to tabulate the active results)
{res}{txt}(output written to {browse  `"TableC1.rtf"'})

{com}.         
. ********************************************************************************
. 
. *Null findings regarding changes of LR Ideology over time (R&R-R2): Table C7
. 
. eststo clear
{txt}
{com}. 
. eststo: reg ideol middleclass##treatment upperclass i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r if DV_93_1!=. & DV_96_1!=. & DV_99_1!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=. & id2<3, vce(cluster id)

{txt}Linear regression                               Number of obs     = {res}       514
                                                {txt}F(45, 256)        =  {res}     3.50
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.2640
                                                {txt}Root MSE          =    {res} 1.1333

{txt}{ralign 87:(Std. err. adjusted for {res:257} clusters in {res:id})}
{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}                ideol{col 23}{c |} Coefficient{col 35}  std. err.{col 47}      t{col 55}   P>|t|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}1.middleclass {c |}{col 23}{res}{space 2} -.077097{col 35}{space 2} .1886457{col 46}{space 1}   -0.41{col 55}{space 3}0.683{col 63}{space 4}-.4485921{col 76}{space 3} .2943981
{txt}{space 10}1.treatment {c |}{col 23}{res}{space 2}-.0277794{col 35}{space 2} .1018281{col 46}{space 1}   -0.27{col 55}{space 3}0.785{col 63}{space 4}-.2283069{col 76}{space 3} .1727481
{txt}{space 21} {c |}
middleclass#treatment {c |}
{space 17}1 1  {c |}{col 23}{res}{space 2}-.0282768{col 35}{space 2} .1120376{col 46}{space 1}   -0.25{col 55}{space 3}0.801{col 63}{space 4}-.2489095{col 76}{space 3} .1923559
{txt}{space 21} {c |}
{space 11}upperclass {c |}{col 23}{res}{space 2}   .02438{col 35}{space 2} .1704198{col 46}{space 1}    0.14{col 55}{space 3}0.886{col 63}{space 4}-.3112233{col 76}{space 3} .3599834
{txt}{space 21} {c |}
{space 18}day {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .2244268{col 35}{space 2} .4040262{col 46}{space 1}    0.56{col 55}{space 3}0.579{col 63}{space 4}-.5712115{col 76}{space 3} 1.020065
{txt}{space 19}3  {c |}{col 23}{res}{space 2}-.2658472{col 35}{space 2} .5901342{col 46}{space 1}   -0.45{col 55}{space 3}0.653{col 63}{space 4}-1.427983{col 76}{space 3} .8962887
{txt}{space 19}4  {c |}{col 23}{res}{space 2}-.2091814{col 35}{space 2} .4093492{col 46}{space 1}   -0.51{col 55}{space 3}0.610{col 63}{space 4}-1.015302{col 76}{space 3} .5969393
{txt}{space 19}5  {c |}{col 23}{res}{space 2}-.1993062{col 35}{space 2} .4541465{col 46}{space 1}   -0.44{col 55}{space 3}0.661{col 63}{space 4}-1.093645{col 76}{space 3} .6950326
{txt}{space 19}6  {c |}{col 23}{res}{space 2}-.5357999{col 35}{space 2} .3880842{col 46}{space 1}   -1.38{col 55}{space 3}0.169{col 63}{space 4}-1.300044{col 76}{space 3} .2284443
{txt}{space 19}7  {c |}{col 23}{res}{space 2}-.5187582{col 35}{space 2} .3975996{col 46}{space 1}   -1.30{col 55}{space 3}0.193{col 63}{space 4}-1.301741{col 76}{space 3} .2642244
{txt}{space 19}8  {c |}{col 23}{res}{space 2}-.2931105{col 35}{space 2} .4413002{col 46}{space 1}   -0.66{col 55}{space 3}0.507{col 63}{space 4}-1.162151{col 76}{space 3} .5759304
{txt}{space 19}9  {c |}{col 23}{res}{space 2} .1195007{col 35}{space 2} .4512788{col 46}{space 1}    0.26{col 55}{space 3}0.791{col 63}{space 4}-.7691909{col 76}{space 3} 1.008192
{txt}{space 18}10  {c |}{col 23}{res}{space 2}-.3835773{col 35}{space 2} .4296084{col 46}{space 1}   -0.89{col 55}{space 3}0.373{col 63}{space 4}-1.229594{col 76}{space 3} .4624393
{txt}{space 18}11  {c |}{col 23}{res}{space 2}-.5264808{col 35}{space 2} .3726323{col 46}{space 1}   -1.41{col 55}{space 3}0.159{col 63}{space 4}-1.260296{col 76}{space 3} .2073343
{txt}{space 18}12  {c |}{col 23}{res}{space 2}-1.024046{col 35}{space 2} .5226844{col 46}{space 1}   -1.96{col 55}{space 3}0.051{col 63}{space 4}-2.053355{col 76}{space 3} .0052624
{txt}{space 18}13  {c |}{col 23}{res}{space 2}-.7957347{col 35}{space 2} .6549756{col 46}{space 1}   -1.21{col 55}{space 3}0.226{col 63}{space 4}-2.085561{col 76}{space 3} .4940917
{txt}{space 18}14  {c |}{col 23}{res}{space 2}-1.172828{col 35}{space 2} .5561083{col 46}{space 1}   -2.11{col 55}{space 3}0.036{col 63}{space 4}-2.267958{col 76}{space 3}-.0776988
{txt}{space 18}15  {c |}{col 23}{res}{space 2}  -.54758{col 35}{space 2} .3726336{col 46}{space 1}   -1.47{col 55}{space 3}0.143{col 63}{space 4}-1.281398{col 76}{space 3} .1862376
{txt}{space 18}16  {c |}{col 23}{res}{space 2} -.334045{col 35}{space 2} .3618299{col 46}{space 1}   -0.92{col 55}{space 3}0.357{col 63}{space 4}-1.046587{col 76}{space 3} .3784972
{txt}{space 18}17  {c |}{col 23}{res}{space 2}-.1592641{col 35}{space 2} .3637993{col 46}{space 1}   -0.44{col 55}{space 3}0.662{col 63}{space 4}-.8756846{col 76}{space 3} .5571564
{txt}{space 18}18  {c |}{col 23}{res}{space 2}-.0729159{col 35}{space 2} .4092477{col 46}{space 1}   -0.18{col 55}{space 3}0.859{col 63}{space 4}-.8788367{col 76}{space 3}  .733005
{txt}{space 18}19  {c |}{col 23}{res}{space 2}-.1825001{col 35}{space 2} .4078113{col 46}{space 1}   -0.45{col 55}{space 3}0.655{col 63}{space 4}-.9855923{col 76}{space 3}  .620592
{txt}{space 18}21  {c |}{col 23}{res}{space 2}-.3287785{col 35}{space 2} .4332092{col 46}{space 1}   -0.76{col 55}{space 3}0.449{col 63}{space 4}-1.181886{col 76}{space 3} .5243291
{txt}{space 18}22  {c |}{col 23}{res}{space 2}   -.3112{col 35}{space 2} .3796607{col 46}{space 1}   -0.82{col 55}{space 3}0.413{col 63}{space 4}-1.058856{col 76}{space 3} .4364559
{txt}{space 18}23  {c |}{col 23}{res}{space 2}-.2998409{col 35}{space 2} .3974371{col 46}{space 1}   -0.75{col 55}{space 3}0.451{col 63}{space 4}-1.082503{col 76}{space 3} .4828216
{txt}{space 18}24  {c |}{col 23}{res}{space 2}-.5818081{col 35}{space 2} .4333181{col 46}{space 1}   -1.34{col 55}{space 3}0.181{col 63}{space 4} -1.43513{col 76}{space 3} .2715139
{txt}{space 18}25  {c |}{col 23}{res}{space 2}-.4584894{col 35}{space 2} .4501384{col 46}{space 1}   -1.02{col 55}{space 3}0.309{col 63}{space 4}-1.344935{col 76}{space 3} .4279563
{txt}{space 18}26  {c |}{col 23}{res}{space 2}-1.293024{col 35}{space 2} .6163283{col 46}{space 1}   -2.10{col 55}{space 3}0.037{col 63}{space 4}-2.506743{col 76}{space 3}-.0793044
{txt}{space 18}28  {c |}{col 23}{res}{space 2}-.1426297{col 35}{space 2}  .699846{col 46}{space 1}   -0.20{col 55}{space 3}0.839{col 63}{space 4}-1.520818{col 76}{space 3} 1.235559
{txt}{space 18}29  {c |}{col 23}{res}{space 2}-.5773825{col 35}{space 2} .3813767{col 46}{space 1}   -1.51{col 55}{space 3}0.131{col 63}{space 4}-1.328418{col 76}{space 3} .1736527
{txt}{space 18}30  {c |}{col 23}{res}{space 2}-.2263811{col 35}{space 2} .5526036{col 46}{space 1}   -0.41{col 55}{space 3}0.682{col 63}{space 4}-1.314609{col 76}{space 3} .8618468
{txt}{space 18}31  {c |}{col 23}{res}{space 2}-.4652392{col 35}{space 2} .4872497{col 46}{space 1}   -0.95{col 55}{space 3}0.341{col 63}{space 4}-1.424767{col 76}{space 3} .4942889
{txt}{space 21} {c |}
{space 18}sal {c |}
{space 19}2  {c |}{col 23}{res}{space 2}   .28573{col 35}{space 2} .3164774{col 46}{space 1}    0.90{col 55}{space 3}0.367{col 63}{space 4}-.3375006{col 76}{space 3} .9089606
{txt}{space 19}3  {c |}{col 23}{res}{space 2} .4289999{col 35}{space 2} .2797848{col 46}{space 1}    1.53{col 55}{space 3}0.126{col 63}{space 4} -.121973{col 76}{space 3} .9799728
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .6772119{col 35}{space 2} .2711492{col 46}{space 1}    2.50{col 55}{space 3}0.013{col 63}{space 4} .1432449{col 76}{space 3} 1.211179
{txt}{space 19}5  {c |}{col 23}{res}{space 2}  .476876{col 35}{space 2} .3205668{col 46}{space 1}    1.49{col 55}{space 3}0.138{col 63}{space 4}-.1544079{col 76}{space 3}  1.10816
{txt}{space 21} {c |}
{space 16}pos_2 {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .0635414{col 35}{space 2} .4292692{col 46}{space 1}    0.15{col 55}{space 3}0.882{col 63}{space 4}-.7818072{col 76}{space 3}   .90889
{txt}{space 19}3  {c |}{col 23}{res}{space 2}-.3047804{col 35}{space 2} .3922619{col 46}{space 1}   -0.78{col 55}{space 3}0.438{col 63}{space 4}-1.077252{col 76}{space 3} .4676907
{txt}{space 19}4  {c |}{col 23}{res}{space 2}-1.016074{col 35}{space 2}  .397861{col 46}{space 1}   -2.55{col 55}{space 3}0.011{col 63}{space 4}-1.799572{col 76}{space 3} -.232577
{txt}{space 19}5  {c |}{col 23}{res}{space 2}-1.139877{col 35}{space 2} .3803843{col 46}{space 1}   -3.00{col 55}{space 3}0.003{col 63}{space 4}-1.888958{col 76}{space 3} -.390796
{txt}{space 19}6  {c |}{col 23}{res}{space 2}-1.626982{col 35}{space 2} .4015451{col 46}{space 1}   -4.05{col 55}{space 3}0.000{col 63}{space 4}-2.417734{col 76}{space 3}-.8362293
{txt}{space 19}7  {c |}{col 23}{res}{space 2}-1.915254{col 35}{space 2} .4424834{col 46}{space 1}   -4.33{col 55}{space 3}0.000{col 63}{space 4}-2.786625{col 76}{space 3}-1.043883
{txt}{space 21} {c |}
{space 13}envrsp_r {c |}{col 23}{res}{space 2}  .074175{col 35}{space 2} .1688211{col 46}{space 1}    0.44{col 55}{space 3}0.661{col 63}{space 4}  -.25828{col 76}{space 3}   .40663
{txt}{space 8}religiosity_r {c |}{col 23}{res}{space 2} .2904901{col 35}{space 2} .1366136{col 46}{space 1}    2.13{col 55}{space 3}0.034{col 63}{space 4} .0214606{col 76}{space 3} .5595197
{txt}{space 15}RUDE_r {c |}{col 23}{res}{space 2}-.0483549{col 35}{space 2}  .160589{col 46}{space 1}   -0.30{col 55}{space 3}0.764{col 63}{space 4}-.3645986{col 76}{space 3} .2678887
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 5.012535{col 35}{space 2} .5671061{col 46}{space 1}    8.84{col 55}{space 3}0.000{col 63}{space 4} 3.895748{col 76}{space 3} 6.129323
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est1:est1}}{col 14}{c |}{res}{col 16}       514{col 28}-848.3331{col 39} -769.539{col 50}    46{col 58} 1631.078{col 69}  1826.22
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M1
{txt}
{com}. 
. *
. 
. eststo: reg ideol middleclass##treatment upperclass i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r if DV_93_1!=. & DV_96_1!=. & DV_99_1!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=., vce(cluster id)

{txt}Linear regression                               Number of obs     = {res}       771
                                                {txt}F(45, 256)        =  {res}     3.54
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.2524
                                                {txt}Root MSE          =    {res} 1.1239

{txt}{ralign 87:(Std. err. adjusted for {res:257} clusters in {res:id})}
{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}                ideol{col 23}{c |} Coefficient{col 35}  std. err.{col 47}      t{col 55}   P>|t|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}1.middleclass {c |}{col 23}{res}{space 2}-.1148684{col 35}{space 2} .1803269{col 46}{space 1}   -0.64{col 55}{space 3}0.525{col 63}{space 4}-.4699816{col 76}{space 3} .2402447
{txt}{space 10}1.treatment {c |}{col 23}{res}{space 2}-.0668971{col 35}{space 2} .0760366{col 46}{space 1}   -0.88{col 55}{space 3}0.380{col 63}{space 4}-.2166341{col 76}{space 3} .0828398
{txt}{space 21} {c |}
middleclass#treatment {c |}
{space 17}1 1  {c |}{col 23}{res}{space 2} .0111653{col 35}{space 2} .0870656{col 46}{space 1}    0.13{col 55}{space 3}0.898{col 63}{space 4}-.1602908{col 76}{space 3} .1826213
{txt}{space 21} {c |}
{space 11}upperclass {c |}{col 23}{res}{space 2} .0598412{col 35}{space 2} .1608544{col 46}{space 1}    0.37{col 55}{space 3}0.710{col 63}{space 4}-.2569252{col 76}{space 3} .3766076
{txt}{space 21} {c |}
{space 18}day {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .2323518{col 35}{space 2} .3640077{col 46}{space 1}    0.64{col 55}{space 3}0.524{col 63}{space 4}-.4844791{col 76}{space 3} .9491826
{txt}{space 19}3  {c |}{col 23}{res}{space 2}-.4497364{col 35}{space 2} .5897572{col 46}{space 1}   -0.76{col 55}{space 3}0.446{col 63}{space 4} -1.61113{col 76}{space 3} .7116571
{txt}{space 19}4  {c |}{col 23}{res}{space 2}-.2094891{col 35}{space 2} .3486826{col 46}{space 1}   -0.60{col 55}{space 3}0.549{col 63}{space 4}-.8961405{col 76}{space 3} .4771624
{txt}{space 19}5  {c |}{col 23}{res}{space 2}-.1532728{col 35}{space 2} .3935684{col 46}{space 1}   -0.39{col 55}{space 3}0.697{col 63}{space 4}-.9283167{col 76}{space 3} .6217711
{txt}{space 19}6  {c |}{col 23}{res}{space 2}-.6553242{col 35}{space 2} .3373375{col 46}{space 1}   -1.94{col 55}{space 3}0.053{col 63}{space 4}-1.319634{col 76}{space 3} .0089857
{txt}{space 19}7  {c |}{col 23}{res}{space 2}-.3302332{col 35}{space 2} .3198474{col 46}{space 1}   -1.03{col 55}{space 3}0.303{col 63}{space 4}-.9601002{col 76}{space 3} .2996338
{txt}{space 19}8  {c |}{col 23}{res}{space 2}-.5437865{col 35}{space 2}  .330399{col 46}{space 1}   -1.65{col 55}{space 3}0.101{col 63}{space 4}-1.194433{col 76}{space 3} .1068596
{txt}{space 19}9  {c |}{col 23}{res}{space 2}-.1605819{col 35}{space 2} .3777624{col 46}{space 1}   -0.43{col 55}{space 3}0.671{col 63}{space 4}-.9044995{col 76}{space 3} .5833358
{txt}{space 18}10  {c |}{col 23}{res}{space 2} -.204893{col 35}{space 2} .3220758{col 46}{space 1}   -0.64{col 55}{space 3}0.525{col 63}{space 4}-.8391485{col 76}{space 3} .4293625
{txt}{space 18}11  {c |}{col 23}{res}{space 2}-.4548219{col 35}{space 2} .3319976{col 46}{space 1}   -1.37{col 55}{space 3}0.172{col 63}{space 4}-1.108616{col 76}{space 3} .1989724
{txt}{space 18}12  {c |}{col 23}{res}{space 2}-.9218757{col 35}{space 2} .4292678{col 46}{space 1}   -2.15{col 55}{space 3}0.033{col 63}{space 4}-1.767222{col 76}{space 3}-.0765298
{txt}{space 18}13  {c |}{col 23}{res}{space 2}-.5820045{col 35}{space 2} .4559489{col 46}{space 1}   -1.28{col 55}{space 3}0.203{col 63}{space 4}-1.479893{col 76}{space 3} .3158838
{txt}{space 18}14  {c |}{col 23}{res}{space 2}-.4504964{col 35}{space 2} .3989462{col 46}{space 1}   -1.13{col 55}{space 3}0.260{col 63}{space 4}-1.236131{col 76}{space 3}  .335138
{txt}{space 18}15  {c |}{col 23}{res}{space 2}-.3631787{col 35}{space 2} .2960419{col 46}{space 1}   -1.23{col 55}{space 3}0.221{col 63}{space 4}-.9461662{col 76}{space 3} .2198087
{txt}{space 18}16  {c |}{col 23}{res}{space 2}-.3823569{col 35}{space 2} .3160373{col 46}{space 1}   -1.21{col 55}{space 3}0.227{col 63}{space 4}-1.004721{col 76}{space 3} .2400071
{txt}{space 18}17  {c |}{col 23}{res}{space 2}-.1387517{col 35}{space 2} .3247691{col 46}{space 1}   -0.43{col 55}{space 3}0.670{col 63}{space 4}-.7783109{col 76}{space 3} .5008075
{txt}{space 18}18  {c |}{col 23}{res}{space 2}-.1630328{col 35}{space 2} .3634332{col 46}{space 1}   -0.45{col 55}{space 3}0.654{col 63}{space 4}-.8787322{col 76}{space 3} .5526667
{txt}{space 18}19  {c |}{col 23}{res}{space 2}-.1899279{col 35}{space 2} .3421142{col 46}{space 1}   -0.56{col 55}{space 3}0.579{col 63}{space 4}-.8636444{col 76}{space 3} .4837887
{txt}{space 18}21  {c |}{col 23}{res}{space 2}-.5390292{col 35}{space 2} .3276407{col 46}{space 1}   -1.65{col 55}{space 3}0.101{col 63}{space 4}-1.184244{col 76}{space 3} .1061851
{txt}{space 18}22  {c |}{col 23}{res}{space 2}-.4287413{col 35}{space 2} .3366843{col 46}{space 1}   -1.27{col 55}{space 3}0.204{col 63}{space 4}-1.091765{col 76}{space 3} .2342823
{txt}{space 18}23  {c |}{col 23}{res}{space 2}-.3771696{col 35}{space 2} .3461406{col 46}{space 1}   -1.09{col 55}{space 3}0.277{col 63}{space 4}-1.058815{col 76}{space 3} .3044761
{txt}{space 18}24  {c |}{col 23}{res}{space 2}-.5055374{col 35}{space 2} .3613412{col 46}{space 1}   -1.40{col 55}{space 3}0.163{col 63}{space 4}-1.217117{col 76}{space 3} .2060423
{txt}{space 18}25  {c |}{col 23}{res}{space 2} -.367946{col 35}{space 2} .3984152{col 46}{space 1}   -0.92{col 55}{space 3}0.357{col 63}{space 4}-1.152535{col 76}{space 3} .4166427
{txt}{space 18}26  {c |}{col 23}{res}{space 2}-.1909048{col 35}{space 2} .6579777{col 46}{space 1}   -0.29{col 55}{space 3}0.772{col 63}{space 4}-1.486643{col 76}{space 3} 1.104834
{txt}{space 18}28  {c |}{col 23}{res}{space 2}-.2162728{col 35}{space 2} .4140043{col 46}{space 1}   -0.52{col 55}{space 3}0.602{col 63}{space 4}-1.031561{col 76}{space 3} .5990152
{txt}{space 18}29  {c |}{col 23}{res}{space 2}-.5275927{col 35}{space 2}  .331215{col 46}{space 1}   -1.59{col 55}{space 3}0.112{col 63}{space 4}-1.179846{col 76}{space 3} .1246604
{txt}{space 18}30  {c |}{col 23}{res}{space 2}-.1707546{col 35}{space 2} .5030818{col 46}{space 1}   -0.34{col 55}{space 3}0.735{col 63}{space 4} -1.16146{col 76}{space 3} .8199512
{txt}{space 18}31  {c |}{col 23}{res}{space 2}  -.37903{col 35}{space 2} .4454087{col 46}{space 1}   -0.85{col 55}{space 3}0.396{col 63}{space 4}-1.256162{col 76}{space 3} .4981018
{txt}{space 21} {c |}
{space 18}sal {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .1392203{col 35}{space 2} .2811226{col 46}{space 1}    0.50{col 55}{space 3}0.621{col 63}{space 4}-.4143871{col 76}{space 3} .6928277
{txt}{space 19}3  {c |}{col 23}{res}{space 2} .2785615{col 35}{space 2} .2546626{col 46}{space 1}    1.09{col 55}{space 3}0.275{col 63}{space 4}-.2229389{col 76}{space 3} .7800619
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .4923711{col 35}{space 2} .2471857{col 46}{space 1}    1.99{col 55}{space 3}0.047{col 63}{space 4} .0055949{col 76}{space 3} .9791474
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .4223157{col 35}{space 2}   .28717{col 46}{space 1}    1.47{col 55}{space 3}0.143{col 63}{space 4}-.1432006{col 76}{space 3}  .987832
{txt}{space 21} {c |}
{space 16}pos_2 {c |}
{space 19}2  {c |}{col 23}{res}{space 2}-.1406265{col 35}{space 2} .2900658{col 46}{space 1}   -0.48{col 55}{space 3}0.628{col 63}{space 4}-.7118456{col 76}{space 3} .4305926
{txt}{space 19}3  {c |}{col 23}{res}{space 2}-.5795173{col 35}{space 2} .2761573{col 46}{space 1}   -2.10{col 55}{space 3}0.037{col 63}{space 4}-1.123347{col 76}{space 3}-.0356879
{txt}{space 19}4  {c |}{col 23}{res}{space 2}-1.039352{col 35}{space 2} .2747066{col 46}{space 1}   -3.78{col 55}{space 3}0.000{col 63}{space 4}-1.580324{col 76}{space 3}-.4983793
{txt}{space 19}5  {c |}{col 23}{res}{space 2}-1.221923{col 35}{space 2} .2694298{col 46}{space 1}   -4.54{col 55}{space 3}0.000{col 63}{space 4}-1.752505{col 76}{space 3}-.6913422
{txt}{space 19}6  {c |}{col 23}{res}{space 2} -1.79601{col 35}{space 2}  .290385{col 46}{space 1}   -6.18{col 55}{space 3}0.000{col 63}{space 4}-2.367858{col 76}{space 3}-1.224163
{txt}{space 19}7  {c |}{col 23}{res}{space 2}-2.021298{col 35}{space 2} .3515132{col 46}{space 1}   -5.75{col 55}{space 3}0.000{col 63}{space 4}-2.713524{col 76}{space 3}-1.329073
{txt}{space 21} {c |}
{space 13}envrsp_r {c |}{col 23}{res}{space 2} .0736455{col 35}{space 2} .1585917{col 46}{space 1}    0.46{col 55}{space 3}0.643{col 63}{space 4} -.238665{col 76}{space 3} .3859561
{txt}{space 8}religiosity_r {c |}{col 23}{res}{space 2} .3118212{col 35}{space 2} .1313898{col 46}{space 1}    2.37{col 55}{space 3}0.018{col 63}{space 4} .0530787{col 76}{space 3} .5705637
{txt}{space 15}RUDE_r {c |}{col 23}{res}{space 2}-.0781445{col 35}{space 2}  .155259{col 46}{space 1}   -0.50{col 55}{space 3}0.615{col 63}{space 4}-.3838921{col 76}{space 3} .2276031
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 5.247195{col 35}{space 2}  .462238{col 46}{space 1}   11.35{col 55}{space 3}0.000{col 63}{space 4} 4.336922{col 76}{space 3} 6.157468
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est2{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est2:est2}}{col 14}{c |}{res}{col 16}       771{col 28}  -1272.5{col 39}-1160.366{col 50}    46{col 58} 2412.732{col 69} 2626.525
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M2
{txt}
{com}. 
. *
. 
. eststo: reg ideol i.middleclass i.treatment_96 i.treatment_99 middle_96 middle_99 upperclass i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r if DV_93_1!=. & DV_96_1!=. & DV_99_1!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=., vce(cluster id)

{txt}Linear regression                               Number of obs     = {res}       771
                                                {txt}F(47, 256)        =  {res}     3.42
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.2528
                                                {txt}Root MSE          =    {res} 1.1252

{txt}{ralign 80:(Std. err. adjusted for {res:257} clusters in {res:id})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}         ideol{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}1.middleclass {c |}{col 16}{res}{space 2}-.1171787{col 28}{space 2} .1809136{col 39}{space 1}   -0.65{col 48}{space 3}0.518{col 56}{space 4}-.4734472{col 69}{space 3} .2390898
{txt}1.treatment_96 {c |}{col 16}{res}{space 2}-.0295404{col 28}{space 2} .0805709{col 39}{space 1}   -0.37{col 48}{space 3}0.714{col 56}{space 4}-.1882065{col 69}{space 3} .1291257
{txt}1.treatment_99 {c |}{col 16}{res}{space 2}-.1116067{col 28}{space 2} .0911972{col 39}{space 1}   -1.22{col 48}{space 3}0.222{col 56}{space 4}-.2911989{col 69}{space 3} .0679855
{txt}{space 5}middle_96 {c |}{col 16}{res}{space 2} .0031619{col 28}{space 2} .0989833{col 39}{space 1}    0.03{col 48}{space 3}0.975{col 56}{space 4}-.1917633{col 69}{space 3} .1980871
{txt}{space 5}middle_99 {c |}{col 16}{res}{space 2} .0231202{col 28}{space 2} .1034008{col 39}{space 1}    0.22{col 48}{space 3}0.823{col 56}{space 4}-.1805043{col 69}{space 3} .2267447
{txt}{space 4}upperclass {c |}{col 16}{res}{space 2} .0565954{col 28}{space 2} .1613357{col 39}{space 1}    0.35{col 48}{space 3}0.726{col 56}{space 4}-.2611188{col 69}{space 3} .3743096
{txt}{space 14} {c |}
{space 11}day {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .2688676{col 28}{space 2} .3618119{col 39}{space 1}    0.74{col 48}{space 3}0.458{col 56}{space 4}-.4436391{col 69}{space 3} .9813742
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.4283594{col 28}{space 2} .5884354{col 39}{space 1}   -0.73{col 48}{space 3}0.467{col 56}{space 4} -1.58715{col 69}{space 3} .7304311
{txt}{space 12}4  {c |}{col 16}{res}{space 2}-.2276482{col 28}{space 2} .3539334{col 39}{space 1}   -0.64{col 48}{space 3}0.521{col 56}{space 4}  -.92464{col 69}{space 3} .4693436
{txt}{space 12}5  {c |}{col 16}{res}{space 2}-.1675904{col 28}{space 2} .3972688{col 39}{space 1}   -0.42{col 48}{space 3}0.673{col 56}{space 4}-.9499216{col 69}{space 3} .6147407
{txt}{space 12}6  {c |}{col 16}{res}{space 2}-.6287895{col 28}{space 2} .3353565{col 39}{space 1}   -1.87{col 48}{space 3}0.062{col 56}{space 4}-1.289198{col 69}{space 3} .0316194
{txt}{space 12}7  {c |}{col 16}{res}{space 2}-.2894334{col 28}{space 2} .3211939{col 39}{space 1}   -0.90{col 48}{space 3}0.368{col 56}{space 4}-.9219522{col 69}{space 3} .3430854
{txt}{space 12}8  {c |}{col 16}{res}{space 2}-.5034028{col 28}{space 2} .3283967{col 39}{space 1}   -1.53{col 48}{space 3}0.127{col 56}{space 4}-1.150106{col 69}{space 3} .1433003
{txt}{space 12}9  {c |}{col 16}{res}{space 2}-.1117744{col 28}{space 2} .3822628{col 39}{space 1}   -0.29{col 48}{space 3}0.770{col 56}{space 4}-.8645546{col 69}{space 3} .6410058
{txt}{space 11}10  {c |}{col 16}{res}{space 2}-.1611948{col 28}{space 2}  .320705{col 39}{space 1}   -0.50{col 48}{space 3}0.616{col 56}{space 4}-.7927508{col 69}{space 3} .4703612
{txt}{space 11}11  {c |}{col 16}{res}{space 2}  -.45111{col 28}{space 2} .3313353{col 39}{space 1}   -1.36{col 48}{space 3}0.175{col 56}{space 4}  -1.1036{col 69}{space 3}   .20138
{txt}{space 11}12  {c |}{col 16}{res}{space 2}-.9343593{col 28}{space 2} .4329653{col 39}{space 1}   -2.16{col 48}{space 3}0.032{col 56}{space 4}-1.786987{col 69}{space 3} -.081732
{txt}{space 11}13  {c |}{col 16}{res}{space 2}-.5636988{col 28}{space 2} .4552347{col 39}{space 1}   -1.24{col 48}{space 3}0.217{col 56}{space 4}-1.460181{col 69}{space 3} .3327829
{txt}{space 11}14  {c |}{col 16}{res}{space 2}-.4278683{col 28}{space 2} .4028076{col 39}{space 1}   -1.06{col 48}{space 3}0.289{col 56}{space 4}-1.221107{col 69}{space 3} .3653702
{txt}{space 11}15  {c |}{col 16}{res}{space 2}-.3403947{col 28}{space 2} .2923397{col 39}{space 1}   -1.16{col 48}{space 3}0.245{col 56}{space 4}-.9160916{col 69}{space 3} .2353022
{txt}{space 11}16  {c |}{col 16}{res}{space 2}-.3671363{col 28}{space 2} .3143723{col 39}{space 1}   -1.17{col 48}{space 3}0.244{col 56}{space 4}-.9862215{col 69}{space 3} .2519489
{txt}{space 11}17  {c |}{col 16}{res}{space 2}  -.11455{col 28}{space 2} .3222534{col 39}{space 1}   -0.36{col 48}{space 3}0.723{col 56}{space 4}-.7491553{col 69}{space 3} .5200553
{txt}{space 11}18  {c |}{col 16}{res}{space 2}-.1527206{col 28}{space 2} .3609616{col 39}{space 1}   -0.42{col 48}{space 3}0.673{col 56}{space 4}-.8635529{col 69}{space 3} .5581118
{txt}{space 11}19  {c |}{col 16}{res}{space 2}-.1804577{col 28}{space 2} .3415207{col 39}{space 1}   -0.53{col 48}{space 3}0.598{col 56}{space 4}-.8530056{col 69}{space 3} .4920901
{txt}{space 11}21  {c |}{col 16}{res}{space 2}-.5117878{col 28}{space 2} .3271764{col 39}{space 1}   -1.56{col 48}{space 3}0.119{col 56}{space 4}-1.156088{col 69}{space 3} .1325121
{txt}{space 11}22  {c |}{col 16}{res}{space 2}-.4210626{col 28}{space 2}   .33472{col 39}{space 1}   -1.26{col 48}{space 3}0.210{col 56}{space 4}-1.080218{col 69}{space 3} .2380927
{txt}{space 11}23  {c |}{col 16}{res}{space 2}-.3712893{col 28}{space 2} .3450198{col 39}{space 1}   -1.08{col 48}{space 3}0.283{col 56}{space 4}-1.050728{col 69}{space 3} .3081491
{txt}{space 11}24  {c |}{col 16}{res}{space 2}-.4900667{col 28}{space 2} .3601358{col 39}{space 1}   -1.36{col 48}{space 3}0.175{col 56}{space 4}-1.199273{col 69}{space 3} .2191394
{txt}{space 11}25  {c |}{col 16}{res}{space 2}-.3718874{col 28}{space 2} .3996741{col 39}{space 1}   -0.93{col 48}{space 3}0.353{col 56}{space 4}-1.158955{col 69}{space 3} .4151803
{txt}{space 11}26  {c |}{col 16}{res}{space 2}-.1613361{col 28}{space 2} .6705675{col 39}{space 1}   -0.24{col 48}{space 3}0.810{col 56}{space 4}-1.481867{col 69}{space 3} 1.159195
{txt}{space 11}28  {c |}{col 16}{res}{space 2}-.1989927{col 28}{space 2} .4163608{col 39}{space 1}   -0.48{col 48}{space 3}0.633{col 56}{space 4}-1.018921{col 69}{space 3} .6209358
{txt}{space 11}29  {c |}{col 16}{res}{space 2}-.5293337{col 28}{space 2} .3312955{col 39}{space 1}   -1.60{col 48}{space 3}0.111{col 56}{space 4}-1.181745{col 69}{space 3} .1230779
{txt}{space 11}30  {c |}{col 16}{res}{space 2} -.189456{col 28}{space 2} .5106132{col 39}{space 1}   -0.37{col 48}{space 3}0.711{col 56}{space 4}-1.194993{col 69}{space 3} .8160812
{txt}{space 11}31  {c |}{col 16}{res}{space 2}-.4004903{col 28}{space 2} .4500099{col 39}{space 1}   -0.89{col 48}{space 3}0.374{col 56}{space 4}-1.286683{col 69}{space 3} .4857023
{txt}{space 14} {c |}
{space 11}sal {c |}
{space 12}2  {c |}{col 16}{res}{space 2}  .138206{col 28}{space 2} .2797597{col 39}{space 1}    0.49{col 48}{space 3}0.622{col 56}{space 4}-.4127174{col 69}{space 3} .6891294
{txt}{space 12}3  {c |}{col 16}{res}{space 2} .2784973{col 28}{space 2} .2536934{col 39}{space 1}    1.10{col 48}{space 3}0.273{col 56}{space 4}-.2210946{col 69}{space 3} .7780891
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .4927436{col 28}{space 2} .2459453{col 39}{space 1}    2.00{col 48}{space 3}0.046{col 56}{space 4}   .00841{col 69}{space 3} .9770772
{txt}{space 12}5  {c |}{col 16}{res}{space 2} .4204323{col 28}{space 2} .2861358{col 39}{space 1}    1.47{col 48}{space 3}0.143{col 56}{space 4}-.1430474{col 69}{space 3} .9839121
{txt}{space 14} {c |}
{space 9}pos_2 {c |}
{space 12}2  {c |}{col 16}{res}{space 2}-.1429739{col 28}{space 2} .2904375{col 39}{space 1}   -0.49{col 48}{space 3}0.623{col 56}{space 4}-.7149249{col 69}{space 3} .4289772
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.5814784{col 28}{space 2} .2763896{col 39}{space 1}   -2.10{col 48}{space 3}0.036{col 56}{space 4}-1.125765{col 69}{space 3}-.0371916
{txt}{space 12}4  {c |}{col 16}{res}{space 2}-1.040615{col 28}{space 2} .2751274{col 39}{space 1}   -3.78{col 48}{space 3}0.000{col 56}{space 4}-1.582416{col 69}{space 3}-.4988138
{txt}{space 12}5  {c |}{col 16}{res}{space 2}-1.226988{col 28}{space 2} .2704051{col 39}{space 1}   -4.54{col 48}{space 3}0.000{col 56}{space 4} -1.75949{col 69}{space 3}-.6944865
{txt}{space 12}6  {c |}{col 16}{res}{space 2}-1.809127{col 28}{space 2} .2924239{col 39}{space 1}   -6.19{col 48}{space 3}0.000{col 56}{space 4} -2.38499{col 69}{space 3}-1.233264
{txt}{space 12}7  {c |}{col 16}{res}{space 2}-2.025557{col 28}{space 2} .3521039{col 39}{space 1}   -5.75{col 48}{space 3}0.000{col 56}{space 4}-2.718946{col 69}{space 3}-1.332168
{txt}{space 14} {c |}
{space 6}envrsp_r {c |}{col 16}{res}{space 2} .0725629{col 28}{space 2} .1587615{col 39}{space 1}    0.46{col 48}{space 3}0.648{col 56}{space 4}-.2400819{col 69}{space 3} .3852077
{txt}{space 1}religiosity_r {c |}{col 16}{res}{space 2} .3099558{col 28}{space 2} .1315832{col 39}{space 1}    2.36{col 48}{space 3}0.019{col 56}{space 4} .0508325{col 69}{space 3}  .569079
{txt}{space 8}RUDE_r {c |}{col 16}{res}{space 2}-.0785417{col 28}{space 2} .1555754{col 39}{space 1}   -0.50{col 48}{space 3}0.614{col 56}{space 4}-.3849123{col 69}{space 3} .2278288
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 5.239402{col 28}{space 2} .4604196{col 39}{space 1}   11.38{col 48}{space 3}0.000{col 56}{space 4} 4.332709{col 69}{space 3} 6.146094
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est3{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est3:est3}}{col 14}{c |}{res}{col 16}       771{col 28}  -1272.5{col 39}-1160.147{col 50}    48{col 58} 2416.294{col 69} 2639.383
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M3
{txt}
{com}. 
. esttab using TableC7.rtf, eform ///
>         label title (LR Ideol as DV) nonumbers mtitles ("M1" "M2" "M3") ///
>         starlevels(+ 0.1 * 0.05 ** 0.01 *** 0.001) ///
>         b(2) se(2) r2 ///  
>         varlabels(_cons Constant) replace
{txt}(tabulating estimates stored by eststo; specify "." to tabulate the active results)
{res}{txt}(output written to {browse  `"TableC7.rtf"'})

{com}. 
. ********************************************************************************
. 
. *Inter Treatment & Upper Class (R&R-R3): Table C8
. 
. eststo clear
{txt}
{com}. 
. eststo: logit DV_1 middleclass treatment##upperclass i.ideol_2 i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r if DV_93_1!=. & DV_96_1!=. & DV_99_1!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=. & id2<3, vce(cluster id) or

{res}{txt}Iteration 0:{space 2}Log pseudolikelihood = {res:-348.35751}  
Iteration 1:{space 2}Log pseudolikelihood = {res: -205.3924}  
Iteration 2:{space 2}Log pseudolikelihood = {res:-199.76328}  
Iteration 3:{space 2}Log pseudolikelihood = {res:-199.65027}  
Iteration 4:{space 2}Log pseudolikelihood = {res:-199.65015}  
Iteration 5:{space 2}Log pseudolikelihood = {res:-199.65015}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:514}
{txt}{col 57}{lalign 13:Wald chi2({res:49})}{col 70} = {res}{ralign 6:187.11}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-199.65015}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.4269}

{txt}{ralign 86:(Std. err. adjusted for {res:257} clusters in {res:id})}
{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 22}{c |}{col 34}    Robust
{col 1}                DV_1{col 22}{c |} Odds ratio{col 34}   std. err.{col 46}      z{col 54}   P>|z|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}middleclass {c |}{col 22}{res}{space 2} 1.347875{col 34}{space 2} .5205946{col 45}{space 1}    0.77{col 54}{space 3}0.440{col 62}{space 4} .6322475{col 75}{space 3} 2.873507
{txt}{space 9}1.treatment {c |}{col 22}{res}{space 2} .6532895{col 34}{space 2} .2297679{col 45}{space 1}   -1.21{col 54}{space 3}0.226{col 62}{space 4} .3278917{col 75}{space 3}  1.30161
{txt}{space 8}1.upperclass {c |}{col 22}{res}{space 2} 4.159001{col 34}{space 2} 1.828072{col 45}{space 1}    3.24{col 54}{space 3}0.001{col 62}{space 4} 1.757304{col 75}{space 3} 9.843085
{txt}{space 20} {c |}
treatment#upperclass {c |}
{space 16}1 1  {c |}{col 22}{res}{space 2} .7735427{col 34}{space 2} .3462611{col 45}{space 1}   -0.57{col 54}{space 3}0.566{col 62}{space 4} .3217071{col 75}{space 3} 1.859978
{txt}{space 20} {c |}
{space 13}ideol_2 {c |}
{space 18}3  {c |}{col 22}{res}{space 2} 1.014545{col 34}{space 2} .8800297{col 45}{space 1}    0.02{col 54}{space 3}0.987{col 62}{space 4} .1853226{col 75}{space 3} 5.554112
{txt}{space 18}4  {c |}{col 22}{res}{space 2} 4.814286{col 34}{space 2} 3.812571{col 45}{space 1}    1.98{col 54}{space 3}0.047{col 62}{space 4} 1.019626{col 75}{space 3} 22.73122
{txt}{space 18}5  {c |}{col 22}{res}{space 2} 22.58157{col 34}{space 2} 18.96332{col 45}{space 1}    3.71{col 54}{space 3}0.000{col 62}{space 4} 4.354525{col 75}{space 3} 117.1028
{txt}{space 18}6  {c |}{col 22}{res}{space 2} 62.61573{col 34}{space 2} 57.28155{col 45}{space 1}    4.52{col 54}{space 3}0.000{col 62}{space 4} 10.42305{col 75}{space 3} 376.1594
{txt}{space 20} {c |}
{space 17}day {c |}
{space 18}2  {c |}{col 22}{res}{space 2} .0749305{col 34}{space 2} .1423231{col 45}{space 1}   -1.36{col 54}{space 3}0.172{col 62}{space 4} .0018109{col 75}{space 3} 3.100505
{txt}{space 18}3  {c |}{col 22}{res}{space 2} .0142951{col 34}{space 2} .0244379{col 45}{space 1}   -2.48{col 54}{space 3}0.013{col 62}{space 4} .0005012{col 75}{space 3} .4077002
{txt}{space 18}4  {c |}{col 22}{res}{space 2} .3482606{col 34}{space 2} .2952876{col 45}{space 1}   -1.24{col 54}{space 3}0.213{col 62}{space 4} .0660963{col 75}{space 3} 1.834982
{txt}{space 18}5  {c |}{col 22}{res}{space 2} .2491543{col 34}{space 2} .2610358{col 45}{space 1}   -1.33{col 54}{space 3}0.185{col 62}{space 4}  .031965{col 75}{space 3} 1.942055
{txt}{space 18}6  {c |}{col 22}{res}{space 2}  .703992{col 34}{space 2} .5207545{col 45}{space 1}   -0.47{col 54}{space 3}0.635{col 62}{space 4} .1651657{col 75}{space 3} 3.000652
{txt}{space 18}7  {c |}{col 22}{res}{space 2} .2796288{col 34}{space 2}  .296263{col 45}{space 1}   -1.20{col 54}{space 3}0.229{col 62}{space 4} .0350546{col 75}{space 3} 2.230585
{txt}{space 18}8  {c |}{col 22}{res}{space 2} .2804795{col 34}{space 2} .2288302{col 45}{space 1}   -1.56{col 54}{space 3}0.119{col 62}{space 4}  .056682{col 75}{space 3} 1.387896
{txt}{space 18}9  {c |}{col 22}{res}{space 2}  .791939{col 34}{space 2} 1.073965{col 45}{space 1}   -0.17{col 54}{space 3}0.863{col 62}{space 4} .0555085{col 75}{space 3} 11.29857
{txt}{space 17}10  {c |}{col 22}{res}{space 2} .1029909{col 34}{space 2} .1142038{col 45}{space 1}   -2.05{col 54}{space 3}0.040{col 62}{space 4} .0117199{col 75}{space 3} .9050513
{txt}{space 17}11  {c |}{col 22}{res}{space 2} .1758606{col 34}{space 2} .1392134{col 45}{space 1}   -2.20{col 54}{space 3}0.028{col 62}{space 4} .0372689{col 75}{space 3} .8298323
{txt}{space 17}12  {c |}{col 22}{res}{space 2} 1.530403{col 34}{space 2} 1.704617{col 45}{space 1}    0.38{col 54}{space 3}0.702{col 62}{space 4} .1724678{col 75}{space 3} 13.58013
{txt}{space 17}13  {c |}{col 22}{res}{space 2} .1296823{col 34}{space 2} .1823782{col 45}{space 1}   -1.45{col 54}{space 3}0.146{col 62}{space 4} .0082375{col 75}{space 3} 2.041574
{txt}{space 17}14  {c |}{col 22}{res}{space 2} .0689367{col 34}{space 2} .0675556{col 45}{space 1}   -2.73{col 54}{space 3}0.006{col 62}{space 4} .0100995{col 75}{space 3} .4705424
{txt}{space 17}15  {c |}{col 22}{res}{space 2} .2599277{col 34}{space 2} .1963783{col 45}{space 1}   -1.78{col 54}{space 3}0.075{col 62}{space 4} .0591235{col 75}{space 3} 1.142733
{txt}{space 17}16  {c |}{col 22}{res}{space 2} .2106222{col 34}{space 2} .1459884{col 45}{space 1}   -2.25{col 54}{space 3}0.025{col 62}{space 4} .0541391{col 75}{space 3} .8194019
{txt}{space 17}17  {c |}{col 22}{res}{space 2} .2411722{col 34}{space 2} .2098903{col 45}{space 1}   -1.63{col 54}{space 3}0.102{col 62}{space 4} .0438059{col 75}{space 3} 1.327765
{txt}{space 17}18  {c |}{col 22}{res}{space 2} .0714549{col 34}{space 2} .0609943{col 45}{space 1}   -3.09{col 54}{space 3}0.002{col 62}{space 4} .0134104{col 75}{space 3} .3807344
{txt}{space 17}19  {c |}{col 22}{res}{space 2} .2480918{col 34}{space 2} .2103067{col 45}{space 1}   -1.64{col 54}{space 3}0.100{col 62}{space 4} .0471033{col 75}{space 3} 1.306693
{txt}{space 17}21  {c |}{col 22}{res}{space 2} .2140009{col 34}{space 2} .1760289{col 45}{space 1}   -1.87{col 54}{space 3}0.061{col 62}{space 4} .0426825{col 75}{space 3} 1.072954
{txt}{space 17}22  {c |}{col 22}{res}{space 2} .2513377{col 34}{space 2} .1916678{col 45}{space 1}   -1.81{col 54}{space 3}0.070{col 62}{space 4} .0563818{col 75}{space 3} 1.120408
{txt}{space 17}23  {c |}{col 22}{res}{space 2} .3159224{col 34}{space 2} .2341682{col 45}{space 1}   -1.55{col 54}{space 3}0.120{col 62}{space 4} .0739014{col 75}{space 3} 1.350543
{txt}{space 17}24  {c |}{col 22}{res}{space 2} .1238953{col 34}{space 2} .1451164{col 45}{space 1}   -1.78{col 54}{space 3}0.075{col 62}{space 4} .0124755{col 75}{space 3} 1.230417
{txt}{space 17}25  {c |}{col 22}{res}{space 2} .2435622{col 34}{space 2} .1959869{col 45}{space 1}   -1.76{col 54}{space 3}0.079{col 62}{space 4} .0503123{col 75}{space 3} 1.179086
{txt}{space 17}26  {c |}{col 22}{res}{space 2} 1.388675{col 34}{space 2} 4.206379{col 45}{space 1}    0.11{col 54}{space 3}0.914{col 62}{space 4} .0036666{col 75}{space 3} 525.9455
{txt}{space 17}28  {c |}{col 22}{res}{space 2} .1880705{col 34}{space 2} .2007708{col 45}{space 1}   -1.57{col 54}{space 3}0.118{col 62}{space 4}  .023208{col 75}{space 3} 1.524064
{txt}{space 17}29  {c |}{col 22}{res}{space 2} .3107132{col 34}{space 2} .2691249{col 45}{space 1}   -1.35{col 54}{space 3}0.177{col 62}{space 4} .0568971{col 75}{space 3} 1.696796
{txt}{space 17}30  {c |}{col 22}{res}{space 2} .0973573{col 34}{space 2} .1023613{col 45}{space 1}   -2.22{col 54}{space 3}0.027{col 62}{space 4} .0123999{col 75}{space 3} .7643986
{txt}{space 17}31  {c |}{col 22}{res}{space 2} .2428107{col 34}{space 2} .1991485{col 45}{space 1}   -1.73{col 54}{space 3}0.084{col 62}{space 4} .0486552{col 75}{space 3} 1.211731
{txt}{space 20} {c |}
{space 17}sal {c |}
{space 18}2  {c |}{col 22}{res}{space 2} .1990962{col 34}{space 2} .2211717{col 45}{space 1}   -1.45{col 54}{space 3}0.146{col 62}{space 4} .0225674{col 75}{space 3} 1.756484
{txt}{space 18}3  {c |}{col 22}{res}{space 2} .1846593{col 34}{space 2} .2030201{col 45}{space 1}   -1.54{col 54}{space 3}0.124{col 62}{space 4} .0214059{col 75}{space 3} 1.592973
{txt}{space 18}4  {c |}{col 22}{res}{space 2} .2530459{col 34}{space 2} .2752468{col 45}{space 1}   -1.26{col 54}{space 3}0.206{col 62}{space 4} .0300136{col 75}{space 3} 2.133441
{txt}{space 18}5  {c |}{col 22}{res}{space 2} .1941135{col 34}{space 2} .2138848{col 45}{space 1}   -1.49{col 54}{space 3}0.137{col 62}{space 4} .0223953{col 75}{space 3} 1.682502
{txt}{space 20} {c |}
{space 15}pos_2 {c |}
{space 18}2  {c |}{col 22}{res}{space 2} .1677919{col 34}{space 2} .2724214{col 45}{space 1}   -1.10{col 54}{space 3}0.272{col 62}{space 4} .0069629{col 75}{space 3} 4.043464
{txt}{space 18}3  {c |}{col 22}{res}{space 2} .2319295{col 34}{space 2}  .369562{col 45}{space 1}   -0.92{col 54}{space 3}0.359{col 62}{space 4} .0102101{col 75}{space 3} 5.268424
{txt}{space 18}4  {c |}{col 22}{res}{space 2} .0462924{col 34}{space 2} .0722881{col 45}{space 1}   -1.97{col 54}{space 3}0.049{col 62}{space 4} .0021693{col 75}{space 3} .9878885
{txt}{space 18}5  {c |}{col 22}{res}{space 2} .0444882{col 34}{space 2} .0684622{col 45}{space 1}   -2.02{col 54}{space 3}0.043{col 62}{space 4} .0021794{col 75}{space 3} .9081276
{txt}{space 18}6  {c |}{col 22}{res}{space 2}  .031255{col 34}{space 2} .0489116{col 45}{space 1}   -2.21{col 54}{space 3}0.027{col 62}{space 4}  .001455{col 75}{space 3} .6714009
{txt}{space 18}7  {c |}{col 22}{res}{space 2} .0053946{col 34}{space 2} .0091073{col 45}{space 1}   -3.09{col 54}{space 3}0.002{col 62}{space 4} .0001972{col 75}{space 3} .1475675
{txt}{space 20} {c |}
{space 12}envrsp_r {c |}{col 22}{res}{space 2} 1.856632{col 34}{space 2} .6338846{col 45}{space 1}    1.81{col 54}{space 3}0.070{col 62}{space 4} .9508492{col 75}{space 3} 3.625267
{txt}{space 7}religiosity_r {c |}{col 22}{res}{space 2} 2.082691{col 34}{space 2} .6736677{col 45}{space 1}    2.27{col 54}{space 3}0.023{col 62}{space 4} 1.104829{col 75}{space 3}  3.92604
{txt}{space 14}RUDE_r {c |}{col 22}{res}{space 2} .7704533{col 34}{space 2} .2449743{col 45}{space 1}   -0.82{col 54}{space 3}0.412{col 62}{space 4}   .41314{col 75}{space 3} 1.436797
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 27.92291{col 34}{space 2} 58.77909{col 45}{space 1}    1.58{col 54}{space 3}0.114{col 62}{space 4} .4509623{col 75}{space 3} 1728.945
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}
({res}est1{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est1:est1}}{col 14}{c |}{res}{col 16}       514{col 28}-348.3575{col 39}-199.6501{col 50}    50{col 58} 499.3003{col 69} 711.4115
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M1
{txt}
{com}. 
. *
. 
. eststo: logit DV_1 middleclass treatment##upperclass i.ideol_2 i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r if DV_93_1!=. & DV_96_1!=. & DV_99_1!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=., vce(cluster id) or

{res}{txt}Iteration 0:{space 2}Log pseudolikelihood = {res:-521.45063}  
Iteration 1:{space 2}Log pseudolikelihood = {res:-309.18898}  
Iteration 2:{space 2}Log pseudolikelihood = {res:-301.05664}  
Iteration 3:{space 2}Log pseudolikelihood = {res:-300.93457}  
Iteration 4:{space 2}Log pseudolikelihood = {res:-300.93453}  
Iteration 5:{space 2}Log pseudolikelihood = {res:-300.93453}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:771}
{txt}{col 57}{lalign 13:Wald chi2({res:49})}{col 70} = {res}{ralign 6:239.98}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-300.93453}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.4229}

{txt}{ralign 86:(Std. err. adjusted for {res:257} clusters in {res:id})}
{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 22}{c |}{col 34}    Robust
{col 1}                DV_1{col 22}{c |} Odds ratio{col 34}   std. err.{col 46}      z{col 54}   P>|z|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}middleclass {c |}{col 22}{res}{space 2} 1.244474{col 34}{space 2} .4620744{col 45}{space 1}    0.59{col 54}{space 3}0.556{col 62}{space 4} .6010822{col 75}{space 3} 2.576545
{txt}{space 9}1.treatment {c |}{col 22}{res}{space 2} .6948846{col 34}{space 2} .2021646{col 45}{space 1}   -1.25{col 54}{space 3}0.211{col 62}{space 4} .3928895{col 75}{space 3} 1.229009
{txt}{space 8}1.upperclass {c |}{col 22}{res}{space 2} 3.672771{col 34}{space 2} 1.549326{col 45}{space 1}    3.08{col 54}{space 3}0.002{col 62}{space 4} 1.606653{col 75}{space 3} 8.395868
{txt}{space 20} {c |}
treatment#upperclass {c |}
{space 16}1 1  {c |}{col 22}{res}{space 2} .9118565{col 34}{space 2} .3330953{col 45}{space 1}   -0.25{col 54}{space 3}0.801{col 62}{space 4} .4456439{col 75}{space 3} 1.865799
{txt}{space 20} {c |}
{space 13}ideol_2 {c |}
{space 18}3  {c |}{col 22}{res}{space 2} .8430506{col 34}{space 2} .6914898{col 45}{space 1}   -0.21{col 54}{space 3}0.835{col 62}{space 4} .1689189{col 75}{space 3} 4.207548
{txt}{space 18}4  {c |}{col 22}{res}{space 2} 4.411295{col 34}{space 2} 3.376942{col 45}{space 1}    1.94{col 54}{space 3}0.053{col 62}{space 4} .9839041{col 75}{space 3} 19.77787
{txt}{space 18}5  {c |}{col 22}{res}{space 2} 17.82364{col 34}{space 2} 14.28878{col 45}{space 1}    3.59{col 54}{space 3}0.000{col 62}{space 4}  3.70347{col 75}{space 3} 85.77958
{txt}{space 18}6  {c |}{col 22}{res}{space 2}   43.385{col 34}{space 2} 37.75607{col 45}{space 1}    4.33{col 54}{space 3}0.000{col 62}{space 4} 7.880904{col 75}{space 3} 238.8378
{txt}{space 20} {c |}
{space 17}day {c |}
{space 18}2  {c |}{col 22}{res}{space 2}  .202018{col 34}{space 2} .2326126{col 45}{space 1}   -1.39{col 54}{space 3}0.165{col 62}{space 4} .0211484{col 75}{space 3} 1.929753
{txt}{space 18}3  {c |}{col 22}{res}{space 2} .0548357{col 34}{space 2} .0555142{col 45}{space 1}   -2.87{col 54}{space 3}0.004{col 62}{space 4} .0075393{col 75}{space 3} .3988387
{txt}{space 18}4  {c |}{col 22}{res}{space 2} .4933929{col 34}{space 2} .3911917{col 45}{space 1}   -0.89{col 54}{space 3}0.373{col 62}{space 4} .1043059{col 75}{space 3} 2.333871
{txt}{space 18}5  {c |}{col 22}{res}{space 2} .3230618{col 34}{space 2} .2905336{col 45}{space 1}   -1.26{col 54}{space 3}0.209{col 62}{space 4} .0554356{col 75}{space 3} 1.882705
{txt}{space 18}6  {c |}{col 22}{res}{space 2} .4749392{col 34}{space 2} .3028606{col 45}{space 1}   -1.17{col 54}{space 3}0.243{col 62}{space 4} .1360948{col 75}{space 3} 1.657428
{txt}{space 18}7  {c |}{col 22}{res}{space 2} .3617553{col 34}{space 2} .2666017{col 45}{space 1}   -1.38{col 54}{space 3}0.168{col 62}{space 4} .0853312{col 75}{space 3} 1.533636
{txt}{space 18}8  {c |}{col 22}{res}{space 2} .3357763{col 34}{space 2} .2180317{col 45}{space 1}   -1.68{col 54}{space 3}0.093{col 62}{space 4} .0940446{col 75}{space 3} 1.198854
{txt}{space 18}9  {c |}{col 22}{res}{space 2} .6971353{col 34}{space 2} .6529737{col 45}{space 1}   -0.39{col 54}{space 3}0.700{col 62}{space 4} .1111826{col 75}{space 3} 4.371167
{txt}{space 17}10  {c |}{col 22}{res}{space 2} .3872307{col 34}{space 2}  .284972{col 45}{space 1}   -1.29{col 54}{space 3}0.197{col 62}{space 4} .0915274{col 75}{space 3} 1.638281
{txt}{space 17}11  {c |}{col 22}{res}{space 2} .2572819{col 34}{space 2} .1996634{col 45}{space 1}   -1.75{col 54}{space 3}0.080{col 62}{space 4} .0562128{col 75}{space 3} 1.177561
{txt}{space 17}12  {c |}{col 22}{res}{space 2}  1.99649{col 34}{space 2} 2.149015{col 45}{space 1}    0.64{col 54}{space 3}0.521{col 62}{space 4} .2421235{col 75}{space 3} 16.46256
{txt}{space 17}13  {c |}{col 22}{res}{space 2} .1013823{col 34}{space 2} .1033119{col 45}{space 1}   -2.25{col 54}{space 3}0.025{col 62}{space 4} .0137581{col 75}{space 3} .7470755
{txt}{space 17}14  {c |}{col 22}{res}{space 2} .1193999{col 34}{space 2} .0867634{col 45}{space 1}   -2.92{col 54}{space 3}0.003{col 62}{space 4} .0287388{col 75}{space 3} .4960664
{txt}{space 17}15  {c |}{col 22}{res}{space 2} .4638588{col 34}{space 2} .3093021{col 45}{space 1}   -1.15{col 54}{space 3}0.249{col 62}{space 4} .1255459{col 75}{space 3} 1.713835
{txt}{space 17}16  {c |}{col 22}{res}{space 2} .3675683{col 34}{space 2} .2336569{col 45}{space 1}   -1.57{col 54}{space 3}0.115{col 62}{space 4} .1057411{col 75}{space 3}  1.27771
{txt}{space 17}17  {c |}{col 22}{res}{space 2} .2813505{col 34}{space 2} .2065457{col 45}{space 1}   -1.73{col 54}{space 3}0.084{col 62}{space 4} .0667362{col 75}{space 3} 1.186134
{txt}{space 17}18  {c |}{col 22}{res}{space 2} .1253081{col 34}{space 2}  .099004{col 45}{space 1}   -2.63{col 54}{space 3}0.009{col 62}{space 4} .0266353{col 75}{space 3} .5895225
{txt}{space 17}19  {c |}{col 22}{res}{space 2} .3232083{col 34}{space 2} .2739327{col 45}{space 1}   -1.33{col 54}{space 3}0.183{col 62}{space 4} .0613837{col 75}{space 3} 1.701813
{txt}{space 17}21  {c |}{col 22}{res}{space 2}  .371696{col 34}{space 2} .2530771{col 45}{space 1}   -1.45{col 54}{space 3}0.146{col 62}{space 4} .0978655{col 75}{space 3} 1.411713
{txt}{space 17}22  {c |}{col 22}{res}{space 2} .4037316{col 34}{space 2} .2815696{col 45}{space 1}   -1.30{col 54}{space 3}0.193{col 62}{space 4} .1029081{col 75}{space 3} 1.583929
{txt}{space 17}23  {c |}{col 22}{res}{space 2} .4748972{col 34}{space 2} .3263895{col 45}{space 1}   -1.08{col 54}{space 3}0.279{col 62}{space 4} .1234758{col 75}{space 3}  1.82649
{txt}{space 17}24  {c |}{col 22}{res}{space 2} .2316181{col 34}{space 2} .2444456{col 45}{space 1}   -1.39{col 54}{space 3}0.166{col 62}{space 4} .0292704{col 75}{space 3} 1.832802
{txt}{space 17}25  {c |}{col 22}{res}{space 2} .4287799{col 34}{space 2} .3282373{col 45}{space 1}   -1.11{col 54}{space 3}0.269{col 62}{space 4} .0956373{col 75}{space 3} 1.922391
{txt}{space 17}26  {c |}{col 22}{res}{space 2} 1.992557{col 34}{space 2} 3.037953{col 45}{space 1}    0.45{col 54}{space 3}0.651{col 62}{space 4}  .100375{col 75}{space 3}  39.5545
{txt}{space 17}28  {c |}{col 22}{res}{space 2} .5318251{col 34}{space 2} .4384218{col 45}{space 1}   -0.77{col 54}{space 3}0.444{col 62}{space 4} .1056969{col 75}{space 3} 2.675935
{txt}{space 17}29  {c |}{col 22}{res}{space 2} .4522544{col 34}{space 2} .3414673{col 45}{space 1}   -1.05{col 54}{space 3}0.293{col 62}{space 4} .1029668{col 75}{space 3} 1.986409
{txt}{space 17}30  {c |}{col 22}{res}{space 2} .1408429{col 34}{space 2} .1483621{col 45}{space 1}   -1.86{col 54}{space 3}0.063{col 62}{space 4} .0178686{col 75}{space 3} 1.110145
{txt}{space 17}31  {c |}{col 22}{res}{space 2} .3165919{col 34}{space 2} .2583047{col 45}{space 1}   -1.41{col 54}{space 3}0.159{col 62}{space 4} .0639752{col 75}{space 3} 1.566708
{txt}{space 20} {c |}
{space 17}sal {c |}
{space 18}2  {c |}{col 22}{res}{space 2} .2826201{col 34}{space 2} .2292324{col 45}{space 1}   -1.56{col 54}{space 3}0.119{col 62}{space 4} .0576495{col 75}{space 3} 1.385512
{txt}{space 18}3  {c |}{col 22}{res}{space 2} .2778082{col 34}{space 2}  .228529{col 45}{space 1}   -1.56{col 54}{space 3}0.119{col 62}{space 4} .0554032{col 75}{space 3} 1.393014
{txt}{space 18}4  {c |}{col 22}{res}{space 2} .4395792{col 34}{space 2} .3550613{col 45}{space 1}   -1.02{col 54}{space 3}0.309{col 62}{space 4} .0902602{col 75}{space 3}  2.14081
{txt}{space 18}5  {c |}{col 22}{res}{space 2} .3216474{col 34}{space 2} .2679705{col 45}{space 1}   -1.36{col 54}{space 3}0.173{col 62}{space 4} .0628388{col 75}{space 3} 1.646387
{txt}{space 20} {c |}
{space 15}pos_2 {c |}
{space 18}2  {c |}{col 22}{res}{space 2} .2609909{col 34}{space 2} .2208609{col 45}{space 1}   -1.59{col 54}{space 3}0.112{col 62}{space 4} .0496941{col 75}{space 3} 1.370711
{txt}{space 18}3  {c |}{col 22}{res}{space 2} .3010553{col 34}{space 2} .2573848{col 45}{space 1}   -1.40{col 54}{space 3}0.160{col 62}{space 4} .0563532{col 75}{space 3} 1.608326
{txt}{space 18}4  {c |}{col 22}{res}{space 2} .0546694{col 34}{space 2}  .044443{col 45}{space 1}   -3.58{col 54}{space 3}0.000{col 62}{space 4} .0111114{col 75}{space 3} .2689807
{txt}{space 18}5  {c |}{col 22}{res}{space 2} .0534218{col 34}{space 2} .0418052{col 45}{space 1}   -3.74{col 54}{space 3}0.000{col 62}{space 4} .0115242{col 75}{space 3} .2476427
{txt}{space 18}6  {c |}{col 22}{res}{space 2} .0343693{col 34}{space 2} .0293204{col 45}{space 1}   -3.95{col 54}{space 3}0.000{col 62}{space 4} .0064567{col 75}{space 3} .1829489
{txt}{space 18}7  {c |}{col 22}{res}{space 2} .0075138{col 34}{space 2} .0076059{col 45}{space 1}   -4.83{col 54}{space 3}0.000{col 62}{space 4} .0010333{col 75}{space 3} .0546385
{txt}{space 20} {c |}
{space 12}envrsp_r {c |}{col 22}{res}{space 2} 1.861473{col 34}{space 2} .6263682{col 45}{space 1}    1.85{col 54}{space 3}0.065{col 62}{space 4}  .962577{col 75}{space 3} 3.599798
{txt}{space 7}religiosity_r {c |}{col 22}{res}{space 2} 2.294538{col 34}{space 2} .7053013{col 45}{space 1}    2.70{col 54}{space 3}0.007{col 62}{space 4} 1.256176{col 75}{space 3} 4.191214
{txt}{space 14}RUDE_r {c |}{col 22}{res}{space 2} .8025376{col 34}{space 2} .2473522{col 45}{space 1}   -0.71{col 54}{space 3}0.475{col 62}{space 4} .4386462{col 75}{space 3} 1.468305
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 10.98629{col 34}{space 2}  15.4548{col 45}{space 1}    1.70{col 54}{space 3}0.088{col 62}{space 4} .6973269{col 75}{space 3} 173.0876
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}
({res}est2{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est2:est2}}{col 14}{c |}{res}{col 16}       771{col 28}-521.4506{col 39}-300.9345{col 50}    50{col 58} 701.8691{col 69} 934.2535
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M2
{txt}
{com}. 
. *
. 
. eststo: logit DV_1 i.middleclass i.treatment_96 i.treatment_99 middle_96_bis middle_99_bis upperclass i.ideol_2 i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r if DV_93_1!=. & DV_96_1!=. & DV_99_1!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=., vce(cluster id) or

{res}{txt}Iteration 0:{space 2}Log pseudolikelihood = {res:-521.45063}  
Iteration 1:{space 2}Log pseudolikelihood = {res:-309.08337}  
Iteration 2:{space 2}Log pseudolikelihood = {res:-300.96989}  
Iteration 3:{space 2}Log pseudolikelihood = {res:-300.84802}  
Iteration 4:{space 2}Log pseudolikelihood = {res:-300.84798}  
Iteration 5:{space 2}Log pseudolikelihood = {res:-300.84798}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:771}
{txt}{col 57}{lalign 13:Wald chi2({res:51})}{col 70} = {res}{ralign 6:244.68}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-300.84798}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.4231}

{txt}{ralign 80:(Std. err. adjusted for {res:257} clusters in {res:id})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}          DV_1{col 16}{c |} Odds ratio{col 28}   std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}1.middleclass {c |}{col 16}{res}{space 2}   1.2434{col 28}{space 2} .4614237{col 39}{space 1}    0.59{col 48}{space 3}0.557{col 56}{space 4} .6008018{col 69}{space 3}   2.5733
{txt}1.treatment_96 {c |}{col 16}{res}{space 2} .7428483{col 28}{space 2} .2351669{col 39}{space 1}   -0.94{col 48}{space 3}0.348{col 56}{space 4} .3994214{col 69}{space 3} 1.381557
{txt}1.treatment_99 {c |}{col 16}{res}{space 2} .6391867{col 28}{space 2} .2093868{col 39}{space 1}   -1.37{col 48}{space 3}0.172{col 56}{space 4} .3363477{col 69}{space 3} 1.214694
{txt}{space 1}middle_96_bis {c |}{col 16}{res}{space 2} .8819106{col 28}{space 2} .3736716{col 39}{space 1}   -0.30{col 48}{space 3}0.767{col 56}{space 4} .3843834{col 69}{space 3} 2.023413
{txt}{space 1}middle_99_bis {c |}{col 16}{res}{space 2} .9580807{col 28}{space 2} .3926075{col 39}{space 1}   -0.10{col 48}{space 3}0.917{col 56}{space 4} .4291332{col 69}{space 3} 2.139006
{txt}{space 4}upperclass {c |}{col 16}{res}{space 2} 3.629952{col 28}{space 2} 1.538883{col 39}{space 1}    3.04{col 48}{space 3}0.002{col 56}{space 4} 1.581402{col 69}{space 3} 8.332196
{txt}{space 14} {c |}
{space 7}ideol_2 {c |}
{space 12}3  {c |}{col 16}{res}{space 2} .8488093{col 28}{space 2} .6947687{col 39}{space 1}   -0.20{col 48}{space 3}0.841{col 56}{space 4}  .170641{col 69}{space 3} 4.222182
{txt}{space 12}4  {c |}{col 16}{res}{space 2} 4.386703{col 28}{space 2} 3.350618{col 39}{space 1}    1.94{col 48}{space 3}0.053{col 56}{space 4} .9817023{col 69}{space 3} 19.60183
{txt}{space 12}5  {c |}{col 16}{res}{space 2} 17.73987{col 28}{space 2} 14.17958{col 39}{space 1}    3.60{col 48}{space 3}0.000{col 56}{space 4} 3.703221{col 69}{space 3} 84.98083
{txt}{space 12}6  {c |}{col 16}{res}{space 2} 43.24023{col 28}{space 2} 37.58367{col 39}{space 1}    4.33{col 48}{space 3}0.000{col 56}{space 4} 7.871146{col 69}{space 3} 237.5407
{txt}{space 14} {c |}
{space 11}day {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .2090674{col 28}{space 2} .2416732{col 39}{space 1}   -1.35{col 48}{space 3}0.176{col 56}{space 4} .0216937{col 69}{space 3} 2.014837
{txt}{space 12}3  {c |}{col 16}{res}{space 2}  .056448{col 28}{space 2} .0579128{col 39}{space 1}   -2.80{col 48}{space 3}0.005{col 56}{space 4} .0075572{col 69}{space 3} .4216362
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .4748269{col 28}{space 2} .3797691{col 39}{space 1}   -0.93{col 48}{space 3}0.352{col 56}{space 4} .0990239{col 69}{space 3} 2.276831
{txt}{space 12}5  {c |}{col 16}{res}{space 2} .3100141{col 28}{space 2} .2838536{col 39}{space 1}   -1.28{col 48}{space 3}0.201{col 56}{space 4} .0515239{col 69}{space 3} 1.865325
{txt}{space 12}6  {c |}{col 16}{res}{space 2} .4895421{col 28}{space 2} .3082201{col 39}{space 1}   -1.13{col 48}{space 3}0.257{col 56}{space 4} .1425168{col 69}{space 3} 1.681567
{txt}{space 12}7  {c |}{col 16}{res}{space 2} .3807305{col 28}{space 2} .2839205{col 39}{space 1}   -1.29{col 48}{space 3}0.195{col 56}{space 4} .0882785{col 69}{space 3} 1.642027
{txt}{space 12}8  {c |}{col 16}{res}{space 2} .3519928{col 28}{space 2} .2335331{col 39}{space 1}   -1.57{col 48}{space 3}0.116{col 56}{space 4} .0958949{col 69}{space 3} 1.292028
{txt}{space 12}9  {c |}{col 16}{res}{space 2} .7467534{col 28}{space 2} .7157544{col 39}{space 1}   -0.30{col 48}{space 3}0.761{col 56}{space 4} .1141065{col 69}{space 3} 4.887018
{txt}{space 11}10  {c |}{col 16}{res}{space 2} .4100286{col 28}{space 2} .3056263{col 39}{space 1}   -1.20{col 48}{space 3}0.232{col 56}{space 4} .0951365{col 69}{space 3} 1.767181
{txt}{space 11}11  {c |}{col 16}{res}{space 2} .2538458{col 28}{space 2} .1963113{col 39}{space 1}   -1.77{col 48}{space 3}0.076{col 56}{space 4} .0557563{col 69}{space 3} 1.155702
{txt}{space 11}12  {c |}{col 16}{res}{space 2}  1.88354{col 28}{space 2} 2.024025{col 39}{space 1}    0.59{col 48}{space 3}0.556{col 56}{space 4} .2292379{col 69}{space 3} 15.47617
{txt}{space 11}13  {c |}{col 16}{res}{space 2} .1043229{col 28}{space 2} .1048979{col 39}{space 1}   -2.25{col 48}{space 3}0.025{col 56}{space 4} .0145374{col 69}{space 3} .7486401
{txt}{space 11}14  {c |}{col 16}{res}{space 2} .1247564{col 28}{space 2} .0903027{col 39}{space 1}   -2.88{col 48}{space 3}0.004{col 56}{space 4}  .030195{col 69}{space 3} .5154542
{txt}{space 11}15  {c |}{col 16}{res}{space 2} .4760902{col 28}{space 2} .3145374{col 39}{space 1}   -1.12{col 48}{space 3}0.261{col 56}{space 4} .1304151{col 69}{space 3} 1.738003
{txt}{space 11}16  {c |}{col 16}{res}{space 2} .3718695{col 28}{space 2} .2344034{col 39}{space 1}   -1.57{col 48}{space 3}0.117{col 56}{space 4} .1081051{col 69}{space 3}  1.27919
{txt}{space 11}17  {c |}{col 16}{res}{space 2} .2897723{col 28}{space 2} .2118747{col 39}{space 1}   -1.69{col 48}{space 3}0.090{col 56}{space 4} .0691318{col 69}{space 3} 1.214606
{txt}{space 11}18  {c |}{col 16}{res}{space 2} .1257043{col 28}{space 2} .0983785{col 39}{space 1}   -2.65{col 48}{space 3}0.008{col 56}{space 4} .0271134{col 69}{space 3} .5827955
{txt}{space 11}19  {c |}{col 16}{res}{space 2} .3258533{col 28}{space 2} .2752068{col 39}{space 1}   -1.33{col 48}{space 3}0.184{col 56}{space 4} .0622473{col 69}{space 3} 1.705783
{txt}{space 11}21  {c |}{col 16}{res}{space 2} .3820365{col 28}{space 2} .2578522{col 39}{space 1}   -1.43{col 48}{space 3}0.154{col 56}{space 4}  .101764{col 69}{space 3}  1.43422
{txt}{space 11}22  {c |}{col 16}{res}{space 2} .4031021{col 28}{space 2} .2788493{col 39}{space 1}   -1.31{col 48}{space 3}0.189{col 56}{space 4} .1038937{col 69}{space 3} 1.564015
{txt}{space 11}23  {c |}{col 16}{res}{space 2} .4738974{col 28}{space 2} .3220271{col 39}{space 1}   -1.10{col 48}{space 3}0.272{col 56}{space 4} .1251031{col 69}{space 3} 1.795149
{txt}{space 11}24  {c |}{col 16}{res}{space 2} .2372697{col 28}{space 2} .2486667{col 39}{space 1}   -1.37{col 48}{space 3}0.170{col 56}{space 4} .0304197{col 69}{space 3} 1.850675
{txt}{space 11}25  {c |}{col 16}{res}{space 2} .4226753{col 28}{space 2} .3223374{col 39}{space 1}   -1.13{col 48}{space 3}0.259{col 56}{space 4} .0948135{col 69}{space 3} 1.884272
{txt}{space 11}26  {c |}{col 16}{res}{space 2}  2.01089{col 28}{space 2} 3.013008{col 39}{space 1}    0.47{col 48}{space 3}0.641{col 56}{space 4} .1066583{col 69}{space 3} 37.91247
{txt}{space 11}28  {c |}{col 16}{res}{space 2}  .562409{col 28}{space 2} .4713055{col 39}{space 1}   -0.69{col 48}{space 3}0.492{col 56}{space 4} .1088266{col 69}{space 3} 2.906494
{txt}{space 11}29  {c |}{col 16}{res}{space 2} .4514358{col 28}{space 2} .3377085{col 39}{space 1}   -1.06{col 48}{space 3}0.288{col 56}{space 4} .1041915{col 69}{space 3} 1.955959
{txt}{space 11}30  {c |}{col 16}{res}{space 2} .1361873{col 28}{space 2} .1433949{col 39}{space 1}   -1.89{col 48}{space 3}0.058{col 56}{space 4} .0172936{col 69}{space 3} 1.072476
{txt}{space 11}31  {c |}{col 16}{res}{space 2} .3074177{col 28}{space 2} .2531047{col 39}{space 1}   -1.43{col 48}{space 3}0.152{col 56}{space 4} .0612228{col 69}{space 3} 1.543634
{txt}{space 14} {c |}
{space 11}sal {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .2862178{col 28}{space 2} .2325225{col 39}{space 1}   -1.54{col 48}{space 3}0.124{col 56}{space 4} .0582349{col 69}{space 3} 1.406728
{txt}{space 12}3  {c |}{col 16}{res}{space 2} .2818962{col 28}{space 2} .2317132{col 39}{space 1}   -1.54{col 48}{space 3}0.123{col 56}{space 4} .0562883{col 69}{space 3} 1.411758
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .4460015{col 28}{space 2} .3614615{col 39}{space 1}   -1.00{col 48}{space 3}0.319{col 56}{space 4} .0910921{col 69}{space 3} 2.183694
{txt}{space 12}5  {c |}{col 16}{res}{space 2} .3231228{col 28}{space 2}  .269255{col 39}{space 1}   -1.36{col 48}{space 3}0.175{col 56}{space 4} .0631059{col 69}{space 3} 1.654494
{txt}{space 14} {c |}
{space 9}pos_2 {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .2639581{col 28}{space 2} .2249101{col 39}{space 1}   -1.56{col 48}{space 3}0.118{col 56}{space 4} .0496882{col 69}{space 3}  1.40222
{txt}{space 12}3  {c |}{col 16}{res}{space 2} .3044988{col 28}{space 2} .2618709{col 39}{space 1}   -1.38{col 48}{space 3}0.167{col 56}{space 4} .0564348{col 69}{space 3} 1.642949
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .0553981{col 28}{space 2} .0454129{col 39}{space 1}   -3.53{col 48}{space 3}0.000{col 56}{space 4} .0111101{col 69}{space 3} .2762311
{txt}{space 12}5  {c |}{col 16}{res}{space 2} .0534822{col 28}{space 2} .0421009{col 39}{space 1}   -3.72{col 48}{space 3}0.000{col 56}{space 4} .0114327{col 69}{space 3} .2501903
{txt}{space 12}6  {c |}{col 16}{res}{space 2} .0338231{col 28}{space 2} .0290912{col 39}{space 1}   -3.94{col 48}{space 3}0.000{col 56}{space 4} .0062675{col 69}{space 3} .1825286
{txt}{space 12}7  {c |}{col 16}{res}{space 2} .0075129{col 28}{space 2} .0076299{col 39}{space 1}   -4.82{col 48}{space 3}0.000{col 56}{space 4} .0010265{col 69}{space 3} .0549879
{txt}{space 14} {c |}
{space 6}envrsp_r {c |}{col 16}{res}{space 2}   1.8588{col 28}{space 2} .6243921{col 39}{space 1}    1.85{col 48}{space 3}0.065{col 56}{space 4} .9622866{col 69}{space 3}  3.59055
{txt}{space 1}religiosity_r {c |}{col 16}{res}{space 2} 2.293809{col 28}{space 2} .7055664{col 39}{space 1}    2.70{col 48}{space 3}0.007{col 56}{space 4} 1.255252{col 69}{space 3} 4.191634
{txt}{space 8}RUDE_r {c |}{col 16}{res}{space 2} .8018078{col 28}{space 2} .2472224{col 39}{space 1}   -0.72{col 48}{space 3}0.474{col 56}{space 4} .4381454{col 69}{space 3} 1.467311
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 10.77112{col 28}{space 2} 15.23957{col 39}{space 1}    1.68{col 48}{space 3}0.093{col 56}{space 4} .6728733{col 69}{space 3} 172.4202
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}
({res}est3{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est3:est3}}{col 14}{c |}{res}{col 16}       771{col 28}-521.4506{col 39} -300.848{col 50}    52{col 58}  705.696{col 69} 947.3758
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M3
{txt}
{com}. 
. esttab using TableC8.rtf, eform ///
>         label title (Inter Treatment Upper Class) nonumbers mtitles ("M1" "M2" "M3") ///
>         starlevels(+ 0.1 * 0.05 ** 0.01 *** 0.001) ///
>         b(2) se(2) r2 ///  
>         varlabels(_cons Constant) replace
{txt}(tabulating estimates stored by eststo; specify "." to tabulate the active results)
{res}{txt}(output written to {browse  `"TableC8.rtf"'})

{com}. 
. ********************************************************************************
. 
. *Mechanisms? Figures 5 & C2; Table C2
. 
. eststo clear
{txt}
{com}. 
. **Salience
. 
. eststo: logit DV_1 i.middleclass DV_93_1 upperclass i.ideol_2 i.nday i.pos_2 envrsp_r female age_r uni RUDE_r religiosity_r if (id2==2) & salient==0, or

{txt}note: {bf:6.ideol_2} != 0 predicts success perfectly;
      {bf:6.ideol_2} omitted and 14 obs not used.

note: {bf:2.nday} != 0 predicts failure perfectly;
      {bf:2.nday} omitted and 2 obs not used.

note: {bf:9.nday} != 0 predicts success perfectly;
      {bf:9.nday} omitted and 2 obs not used.

note: {bf:19.nday} != 0 predicts failure perfectly;
      {bf:19.nday} omitted and 1 obs not used.

note: {bf:21.nday} != 0 predicts failure perfectly;
      {bf:21.nday} omitted and 1 obs not used.

note: {bf:24.nday} != 0 predicts failure perfectly;
      {bf:24.nday} omitted and 3 obs not used.

note: {bf:25.nday} != 0 predicts success perfectly;
      {bf:25.nday} omitted and 1 obs not used.

note: {bf:26.nday} != 0 predicts failure perfectly;
      {bf:26.nday} omitted and 1 obs not used.

note: {bf:29.nday} != 0 predicts failure perfectly;
      {bf:29.nday} omitted and 6 obs not used.

note: {bf:31.nday} != 0 predicts success perfectly;
      {bf:31.nday} omitted and 1 obs not used.

note: {bf:2.pos_2} != 0 predicts success perfectly;
      {bf:2.pos_2} omitted and 1 obs not used.

note: {bf:7.pos_2} != 0 predicts failure perfectly;
      {bf:7.pos_2} omitted and 9 obs not used.

note: {bf:1.nday} != 0 predicts success perfectly;
      {bf:1.nday} omitted and 2 obs not used.

note: {bf:5.nday} omitted because of collinearity.
note: {bf:23.nday} omitted because of collinearity.
note: {bf:6.pos_2} omitted because of collinearity.
{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-59.521885}  
Iteration 1:{space 2}Log likelihood = {res:-30.333118}  
Iteration 2:{space 2}Log likelihood = {res:-25.562759}  
Iteration 3:{space 2}Log likelihood = {res:-24.410171}  
Iteration 4:{space 2}Log likelihood = {res:-24.377053}  
Iteration 5:{space 2}Log likelihood = {res:-24.376946}  
Iteration 6:{space 2}Log likelihood = {res:-24.376946}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:98}
{txt}{col 57}{lalign 13:LR chi2({res:26})}{col 70} = {res}{ralign 6:70.29}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-24.376946}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.5905}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         DV_1{col 15}{c |} Odds ratio{col 27}   Std. err.{col 39}      z{col 47}   P>|z|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
1.middleclass {c |}{col 15}{res}{space 2}  1.58789{col 27}{space 2} 1.805225{col 38}{space 1}    0.41{col 47}{space 3}0.684{col 55}{space 4} .1710467{col 68}{space 3} 14.74097
{txt}{space 6}DV_93_1 {c |}{col 15}{res}{space 2} 43.93617{col 27}{space 2}  55.6634{col 38}{space 1}    2.99{col 47}{space 3}0.003{col 55}{space 4}  3.66794{col 68}{space 3} 526.2865
{txt}{space 3}upperclass {c |}{col 15}{res}{space 2} 1.382196{col 27}{space 2} 1.788596{col 38}{space 1}    0.25{col 47}{space 3}0.802{col 55}{space 4} .1094194{col 68}{space 3} 17.46003
{txt}{space 13} {c |}
{space 6}ideol_2 {c |}
{space 11}3  {c |}{col 15}{res}{space 2} 3.013258{col 27}{space 2} 6.896799{col 38}{space 1}    0.48{col 47}{space 3}0.630{col 55}{space 4} .0339462{col 68}{space 3}  267.474
{txt}{space 11}4  {c |}{col 15}{res}{space 2}  2.92384{col 27}{space 2} 5.776518{col 38}{space 1}    0.54{col 47}{space 3}0.587{col 55}{space 4}  .060851{col 68}{space 3} 140.4881
{txt}{space 11}5  {c |}{col 15}{res}{space 2}  415.489{col 27}{space 2} 1045.931{col 38}{space 1}    2.40{col 47}{space 3}0.017{col 55}{space 4} 2.990801{col 68}{space 3} 57720.69
{txt}{space 11}6  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (empty)
{space 13} {c |}
{space 9}nday {c |}
{space 11}1  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (empty)
{space 11}2  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (empty)
{space 11}5  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (empty)
{space 11}6  {c |}{col 15}{res}{space 2} 1.039149{col 27}{space 2} 4.717957{col 38}{space 1}    0.01{col 47}{space 3}0.993{col 55}{space 4} .0001419{col 68}{space 3} 7608.737
{txt}{space 11}7  {c |}{col 15}{res}{space 2} 13.18988{col 27}{space 2} 31.01853{col 38}{space 1}    1.10{col 47}{space 3}0.273{col 55}{space 4} .1313645{col 68}{space 3} 1324.353
{txt}{space 11}8  {c |}{col 15}{res}{space 2} 27.33064{col 27}{space 2} 76.67805{col 38}{space 1}    1.18{col 47}{space 3}0.238{col 55}{space 4} .1118262{col 68}{space 3} 6679.688
{txt}{space 11}9  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (empty)
{space 10}10  {c |}{col 15}{res}{space 2}  90.6043{col 27}{space 2} 254.6865{col 38}{space 1}    1.60{col 47}{space 3}0.109{col 55}{space 4} .3668107{col 68}{space 3} 22379.77
{txt}{space 10}11  {c |}{col 15}{res}{space 2} 11.09918{col 27}{space 2} 27.87031{col 38}{space 1}    0.96{col 47}{space 3}0.338{col 55}{space 4} .0808914{col 68}{space 3} 1522.927
{txt}{space 10}15  {c |}{col 15}{res}{space 2}  11.3693{col 27}{space 2} 32.72777{col 38}{space 1}    0.84{col 47}{space 3}0.398{col 55}{space 4} .0403142{col 68}{space 3} 3206.343
{txt}{space 10}16  {c |}{col 15}{res}{space 2} 24.28873{col 27}{space 2} 54.70347{col 38}{space 1}    1.42{col 47}{space 3}0.157{col 55}{space 4} .2939783{col 68}{space 3} 2006.756
{txt}{space 10}17  {c |}{col 15}{res}{space 2} 205.9012{col 27}{space 2} 529.7462{col 38}{space 1}    2.07{col 47}{space 3}0.038{col 55}{space 4} 1.329452{col 68}{space 3}  31889.3
{txt}{space 10}18  {c |}{col 15}{res}{space 2} .0132982{col 27}{space 2} .0420624{col 38}{space 1}   -1.37{col 47}{space 3}0.172{col 55}{space 4}  .000027{col 68}{space 3} 6.548574
{txt}{space 10}19  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (empty)
{space 10}20  {c |}{col 15}{res}{space 2} 14.85475{col 27}{space 2} 66.29786{col 38}{space 1}    0.60{col 47}{space 3}0.545{col 55}{space 4} .0023599{col 68}{space 3} 93506.54
{txt}{space 10}21  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (empty)
{space 10}22  {c |}{col 15}{res}{space 2} 161.7255{col 27}{space 2} 448.6552{col 38}{space 1}    1.83{col 47}{space 3}0.067{col 55}{space 4} .7037105{col 68}{space 3} 37167.45
{txt}{space 10}23  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (omitted)
{space 10}24  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (empty)
{space 10}25  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (empty)
{space 10}26  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (empty)
{space 10}29  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (empty)
{space 10}31  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (empty)
{space 13} {c |}
{space 8}pos_2 {c |}
{space 11}1  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (empty)
{space 11}2  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (empty)
{space 11}3  {c |}{col 15}{res}{space 2} 47.48357{col 27}{space 2} 115.6418{col 38}{space 1}    1.59{col 47}{space 3}0.113{col 55}{space 4} .4013487{col 68}{space 3} 5617.781
{txt}{space 11}4  {c |}{col 15}{res}{space 2} 4.806468{col 27}{space 2} 9.227303{col 38}{space 1}    0.82{col 47}{space 3}0.413{col 55}{space 4} .1116134{col 68}{space 3} 206.9834
{txt}{space 11}5  {c |}{col 15}{res}{space 2} 4.209889{col 27}{space 2} 8.692632{col 38}{space 1}    0.70{col 47}{space 3}0.486{col 55}{space 4} .0735697{col 68}{space 3} 240.9031
{txt}{space 11}6  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (omitted)
{space 11}7  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (empty)
{space 13} {c |}
{space 5}envrsp_r {c |}{col 15}{res}{space 2} 8.638106{col 27}{space 2} 8.746557{col 38}{space 1}    2.13{col 47}{space 3}0.033{col 55}{space 4} 1.187217{col 68}{space 3} 62.85023
{txt}{space 7}female {c |}{col 15}{res}{space 2} 1.117266{col 27}{space 2}  1.20694{col 38}{space 1}    0.10{col 47}{space 3}0.918{col 55}{space 4} .1344734{col 68}{space 3} 9.282758
{txt}{space 8}age_r {c |}{col 15}{res}{space 2} .8242244{col 27}{space 2} .9241606{col 38}{space 1}   -0.17{col 47}{space 3}0.863{col 55}{space 4} .0915454{col 68}{space 3} 7.420859
{txt}{space 10}uni {c |}{col 15}{res}{space 2} 1.314061{col 27}{space 2} 2.100332{col 38}{space 1}    0.17{col 47}{space 3}0.864{col 55}{space 4} .0572923{col 68}{space 3} 30.13943
{txt}{space 7}RUDE_r {c |}{col 15}{res}{space 2} .4165854{col 27}{space 2} .5727528{col 38}{space 1}   -0.64{col 47}{space 3}0.524{col 55}{space 4} .0281455{col 68}{space 3} 6.165944
{txt}religiosity_r {c |}{col 15}{res}{space 2} 7.209402{col 27}{space 2} 10.38988{col 38}{space 1}    1.37{col 47}{space 3}0.170{col 55}{space 4} .4277442{col 68}{space 3} 121.5107
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} .0001549{col 27}{space 2} .0005953{col 38}{space 1}   -2.28{col 47}{space 3}0.022{col 55}{space 4} 8.28e-08{col 68}{space 3} .2896878
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}
({res}est1{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est1:est1}}{col 14}{c |}{res}{col 16}        98{col 28}-59.52189{col 39}-24.37695{col 50}    27{col 58} 102.7539{col 69}  172.548
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. margins, saving(Non-salient taxes, replace) level(90) dydx(i.middleclass)
{res}
{txt}{col 1}Average marginal effects{col 61}{lalign 13:Number of obs}{col 74} = {res}{ralign 2:98}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(DV_1), predict()}{p_end}
{p2col:dy/dx wrt:}{res:1.middleclass}{p_end}
{p2colreset}{...}

{res}{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27} Delta-method
{col 15}{c |}      dy/dx{col 27}   std. err.{col 39}      z{col 47}   P>|z|{col 55}     [90% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
1.middleclass {c |}{col 15}{res}{space 2} .0356632{col 27}{space 2} .0879977{col 38}{space 1}    0.41{col 47}{space 3}0.685{col 55}{space 4}-.1090801{col 68}{space 3} .1804065
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 79}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. 
. eststo: logit DV_1 i.middleclass DV_93_1 upperclass i.ideol_2 i.nday i.pos_2 envrsp_r female age_r uni RUDE_r religiosity_r if (id2==2) & salient==1, or

{txt}note: {bf:1.nday} != 0 predicts failure perfectly;
      {bf:1.nday} omitted and 3 obs not used.

note: {bf:2.nday} != 0 predicts success perfectly;
      {bf:2.nday} omitted and 4 obs not used.

note: {bf:3.nday} != 0 predicts success perfectly;
      {bf:3.nday} omitted and 1 obs not used.

note: {bf:8.nday} != 0 predicts success perfectly;
      {bf:8.nday} omitted and 1 obs not used.

note: {bf:30.nday} omitted because of collinearity.
{res}{txt}Iteration 0:{space 2}Log likelihood = {res: -125.7569}  
Iteration 1:{space 2}Log likelihood = {res:-51.640489}  
Iteration 2:{space 2}Log likelihood = {res:-46.485075}  
Iteration 3:{space 2}Log likelihood = {res:-45.924632}  
Iteration 4:{space 2}Log likelihood = {res:-45.916522}  
Iteration 5:{space 2}Log likelihood = {res:-45.916512}  
Iteration 6:{space 2}Log likelihood = {res:-45.916512}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:182}
{txt}{col 57}{lalign 13:LR chi2({res:33})}{col 70} = {res}{ralign 6:159.68}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-45.916512}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.6349}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         DV_1{col 15}{c |} Odds ratio{col 27}   Std. err.{col 39}      z{col 47}   P>|z|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
1.middleclass {c |}{col 15}{res}{space 2} .0621937{col 27}{space 2} .0638635{col 38}{space 1}   -2.70{col 47}{space 3}0.007{col 55}{space 4} .0083117{col 68}{space 3} .4653738
{txt}{space 6}DV_93_1 {c |}{col 15}{res}{space 2} 249.2901{col 27}{space 2}  280.952{col 38}{space 1}    4.90{col 47}{space 3}0.000{col 55}{space 4} 27.37748{col 68}{space 3} 2269.951
{txt}{space 3}upperclass {c |}{col 15}{res}{space 2} .3122735{col 27}{space 2}  .322781{col 38}{space 1}   -1.13{col 47}{space 3}0.260{col 55}{space 4} .0411805{col 68}{space 3} 2.367981
{txt}{space 13} {c |}
{space 6}ideol_2 {c |}
{space 11}3  {c |}{col 15}{res}{space 2} 1.191655{col 27}{space 2} 2.394769{col 38}{space 1}    0.09{col 47}{space 3}0.930{col 55}{space 4}  .023204{col 68}{space 3} 61.19825
{txt}{space 11}4  {c |}{col 15}{res}{space 2} 8.639965{col 27}{space 2} 15.09028{col 38}{space 1}    1.23{col 47}{space 3}0.217{col 55}{space 4} .2817286{col 68}{space 3} 264.9678
{txt}{space 11}5  {c |}{col 15}{res}{space 2} 6.896827{col 27}{space 2} 12.15378{col 38}{space 1}    1.10{col 47}{space 3}0.273{col 55}{space 4} .2180914{col 68}{space 3} 218.1022
{txt}{space 11}6  {c |}{col 15}{res}{space 2} 41.28063{col 27}{space 2} 82.46693{col 38}{space 1}    1.86{col 47}{space 3}0.063{col 55}{space 4} .8227887{col 68}{space 3} 2071.116
{txt}{space 13} {c |}
{space 9}nday {c |}
{space 11}1  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (empty)
{space 11}2  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (empty)
{space 11}3  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (empty)
{space 11}6  {c |}{col 15}{res}{space 2} .6640005{col 27}{space 2} 1.838512{col 38}{space 1}   -0.15{col 47}{space 3}0.882{col 55}{space 4} .0029196{col 68}{space 3} 151.0118
{txt}{space 11}7  {c |}{col 15}{res}{space 2} .0690262{col 27}{space 2} .2039078{col 38}{space 1}   -0.90{col 47}{space 3}0.365{col 55}{space 4} .0002111{col 68}{space 3} 22.56922
{txt}{space 11}8  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (empty)
{space 10}10  {c |}{col 15}{res}{space 2} 7.809346{col 27}{space 2} 24.60736{col 38}{space 1}    0.65{col 47}{space 3}0.514{col 55}{space 4} .0162355{col 68}{space 3} 3756.323
{txt}{space 10}11  {c |}{col 15}{res}{space 2} .3902911{col 27}{space 2} 1.062406{col 38}{space 1}   -0.35{col 47}{space 3}0.730{col 55}{space 4} .0018808{col 68}{space 3} 80.99003
{txt}{space 10}15  {c |}{col 15}{res}{space 2} 51.02092{col 27}{space 2}  130.932{col 38}{space 1}    1.53{col 47}{space 3}0.125{col 55}{space 4} .3337021{col 68}{space 3} 7800.772
{txt}{space 10}16  {c |}{col 15}{res}{space 2} 4.110958{col 27}{space 2} 10.00458{col 38}{space 1}    0.58{col 47}{space 3}0.561{col 55}{space 4}  .034868{col 68}{space 3} 484.6848
{txt}{space 10}17  {c |}{col 15}{res}{space 2} 5.474421{col 27}{space 2} 13.66561{col 38}{space 1}    0.68{col 47}{space 3}0.496{col 55}{space 4}  .041069{col 68}{space 3}  729.731
{txt}{space 10}18  {c |}{col 15}{res}{space 2} 110.7836{col 27}{space 2} 292.5878{col 38}{space 1}    1.78{col 47}{space 3}0.075{col 55}{space 4} .6257315{col 68}{space 3} 19613.85
{txt}{space 10}19  {c |}{col 15}{res}{space 2} 119.0585{col 27}{space 2} 347.4999{col 38}{space 1}    1.64{col 47}{space 3}0.102{col 55}{space 4} .3902395{col 68}{space 3} 36323.66
{txt}{space 10}22  {c |}{col 15}{res}{space 2} 21.10721{col 27}{space 2} 57.60076{col 38}{space 1}    1.12{col 47}{space 3}0.264{col 55}{space 4}  .100354{col 68}{space 3} 4439.427
{txt}{space 10}23  {c |}{col 15}{res}{space 2} 3.483072{col 27}{space 2} 8.674995{col 38}{space 1}    0.50{col 47}{space 3}0.616{col 55}{space 4} .0264208{col 68}{space 3} 459.1757
{txt}{space 10}24  {c |}{col 15}{res}{space 2} 199.7588{col 27}{space 2} 561.7331{col 38}{space 1}    1.88{col 47}{space 3}0.060{col 55}{space 4} .8070102{col 68}{space 3}  49446.2
{txt}{space 10}25  {c |}{col 15}{res}{space 2} 10.98331{col 27}{space 2} 27.29024{col 38}{space 1}    0.96{col 47}{space 3}0.335{col 55}{space 4} .0842852{col 68}{space 3} 1431.248
{txt}{space 10}29  {c |}{col 15}{res}{space 2} .1049507{col 27}{space 2} .2998547{col 38}{space 1}   -0.79{col 47}{space 3}0.430{col 55}{space 4} .0003882{col 68}{space 3} 28.37617
{txt}{space 10}30  {c |}{col 15}{res}{space 2}        1{col 27}{txt}  (omitted)
{space 13} {c |}
{space 8}pos_2 {c |}
{space 11}2  {c |}{col 15}{res}{space 2} .7021346{col 27}{space 2} 1.179665{col 38}{space 1}   -0.21{col 47}{space 3}0.833{col 55}{space 4} .0260799{col 68}{space 3} 18.90319
{txt}{space 11}3  {c |}{col 15}{res}{space 2} 3.761576{col 27}{space 2} 6.819005{col 38}{space 1}    0.73{col 47}{space 3}0.465{col 55}{space 4} .1077227{col 68}{space 3} 131.3508
{txt}{space 11}4  {c |}{col 15}{res}{space 2}  1.26257{col 27}{space 2} 2.153821{col 38}{space 1}    0.14{col 47}{space 3}0.891{col 55}{space 4} .0445851{col 68}{space 3} 35.75374
{txt}{space 11}5  {c |}{col 15}{res}{space 2} 1.266687{col 27}{space 2} 2.372657{col 38}{space 1}    0.13{col 47}{space 3}0.900{col 55}{space 4} .0322304{col 68}{space 3} 49.78204
{txt}{space 11}6  {c |}{col 15}{res}{space 2} .4232164{col 27}{space 2} .7419165{col 38}{space 1}   -0.49{col 47}{space 3}0.624{col 55}{space 4}  .013626{col 68}{space 3} 13.14484
{txt}{space 11}7  {c |}{col 15}{res}{space 2} .2808073{col 27}{space 2} .5485443{col 38}{space 1}   -0.65{col 47}{space 3}0.516{col 55}{space 4} .0061041{col 68}{space 3}  12.9179
{txt}{space 13} {c |}
{space 5}envrsp_r {c |}{col 15}{res}{space 2} 4.847278{col 27}{space 2} 3.428896{col 38}{space 1}    2.23{col 47}{space 3}0.026{col 55}{space 4} 1.211629{col 68}{space 3} 19.39215
{txt}{space 7}female {c |}{col 15}{res}{space 2} .8058767{col 27}{space 2} .5923869{col 38}{space 1}   -0.29{col 47}{space 3}0.769{col 55}{space 4} .1907938{col 68}{space 3} 3.403871
{txt}{space 8}age_r {c |}{col 15}{res}{space 2} .1993278{col 27}{space 2} .1586864{col 38}{space 1}   -2.03{col 47}{space 3}0.043{col 55}{space 4} .0418716{col 68}{space 3} .9488904
{txt}{space 10}uni {c |}{col 15}{res}{space 2} 7.215602{col 27}{space 2} 8.250127{col 38}{space 1}    1.73{col 47}{space 3}0.084{col 55}{space 4} .7674172{col 68}{space 3} 67.84435
{txt}{space 7}RUDE_r {c |}{col 15}{res}{space 2}  1.42407{col 27}{space 2} 1.114504{col 38}{space 1}    0.45{col 47}{space 3}0.651{col 55}{space 4} .3071602{col 68}{space 3} 6.602339
{txt}religiosity_r {c |}{col 15}{res}{space 2} 1.622087{col 27}{space 2} 1.165543{col 38}{space 1}    0.67{col 47}{space 3}0.501{col 55}{space 4} .3966867{col 68}{space 3} 6.632861
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} .0024632{col 27}{space 2} .0086067{col 38}{space 1}   -1.72{col 47}{space 3}0.086{col 55}{space 4} 2.61e-06{col 68}{space 3} 2.321041
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}
({res}est2{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est2:est2}}{col 14}{c |}{res}{col 16}       182{col 28}-125.7569{col 39}-45.91651{col 50}    34{col 58}  159.833{col 69} 268.7693
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. margins, saving(Salient taxes, replace) level(90) dydx(i.middleclass)
{res}
{txt}{col 1}Average marginal effects{col 60}{lalign 13:Number of obs}{col 73} = {res}{ralign 3:182}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(DV_1), predict()}{p_end}
{p2col:dy/dx wrt:}{res:1.middleclass}{p_end}
{p2colreset}{...}

{res}{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27} Delta-method
{col 15}{c |}      dy/dx{col 27}   std. err.{col 39}      z{col 47}   P>|z|{col 55}     [90% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
1.middleclass {c |}{col 15}{res}{space 2}-.2146548{col 27}{space 2} .0663587{col 38}{space 1}   -3.23{col 47}{space 3}0.001{col 55}{space 4}-.3238052{col 68}{space 3}-.1055044
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 79}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. 
. *Figure 5
. combomarginsplot "Non-salient taxes" "Salient taxes", title("") ytitle("Effects on Predicted Vote for the Right") recast(scatter) yline(0, lcolor(red) lpattern(solid)) xtitle("Tax Rates Salience") legend(label(1 "Non-salient") label(2 "Salient")) xlabel(1 "Non-salient" 2 "Salient") xscale(range(0.75(.1)2.25)) ylabel(, grid glwidth(medthin) glcolor(gs8) glpattern(dot))
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: _filenumber{p_end}
{res}{txt}
{com}. dis (-.1055044-.1090801)/2
{res}-.10729225
{txt}
{com}. 
. graph save Figure5, replace
{res}{txt}file {bf:Figure5.gph} saved

{com}. 
. **Position
. 
. eststo: logit DV_1 i.middleclass##c.taxresp DV_93_1 upperclass i.ideol_2 i.nday i.sal envrsp_r female age_r uni RUDE_r religiosity_r if (id2==2), or

{txt}note: {bf:3.nday} != 0 predicts success perfectly;
      {bf:3.nday} omitted and 1 obs not used.

note: {bf:9.nday} != 0 predicts success perfectly;
      {bf:9.nday} omitted and 2 obs not used.

note: {bf:21.nday} != 0 predicts failure perfectly;
      {bf:21.nday} omitted and 2 obs not used.

note: {bf:31.nday} != 0 predicts success perfectly;
      {bf:31.nday} omitted and 1 obs not used.

{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-217.76508}  
Iteration 1:{space 2}Log likelihood = {res:-99.640878}  
Iteration 2:{space 2}Log likelihood = {res:-93.255515}  
Iteration 3:{space 2}Log likelihood = {res: -92.61347}  
Iteration 4:{space 2}Log likelihood = {res:-92.612131}  
Iteration 5:{space 2}Log likelihood = {res:-92.612131}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:321}
{txt}{col 57}{lalign 13:LR chi2({res:39})}{col 70} = {res}{ralign 6:250.31}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-92.612131}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.5747}

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                 DV_1{col 23}{c |} Odds ratio{col 35}   Std. err.{col 47}      z{col 55}   P>|z|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}1.middleclass {c |}{col 23}{res}{space 2} 3.904931{col 35}{space 2} 7.589186{col 46}{space 1}    0.70{col 55}{space 3}0.483{col 63}{space 4} .0865593{col 76}{space 3} 176.1624
{txt}{space 14}taxresp {c |}{col 23}{res}{space 2} .7028798{col 35}{space 2} .1364485{col 46}{space 1}   -1.82{col 55}{space 3}0.069{col 63}{space 4} .4804401{col 76}{space 3} 1.028307
{txt}{space 21} {c |}
middleclass#c.taxresp {c |}
{space 19}1  {c |}{col 23}{res}{space 2} .5556751{col 35}{space 2}  .226777{col 46}{space 1}   -1.44{col 55}{space 3}0.150{col 63}{space 4} .2497103{col 76}{space 3} 1.236532
{txt}{space 21} {c |}
{space 14}DV_93_1 {c |}{col 23}{res}{space 2} 36.26289{col 35}{space 2} 18.29206{col 46}{space 1}    7.12{col 55}{space 3}0.000{col 63}{space 4} 13.49247{col 76}{space 3} 97.46154
{txt}{space 11}upperclass {c |}{col 23}{res}{space 2}  .520335{col 35}{space 2} .2986361{col 46}{space 1}   -1.14{col 55}{space 3}0.255{col 63}{space 4} .1689478{col 76}{space 3} 1.602557
{txt}{space 21} {c |}
{space 14}ideol_2 {c |}
{space 19}3  {c |}{col 23}{res}{space 2} .4869787{col 35}{space 2} .5640076{col 46}{space 1}   -0.62{col 55}{space 3}0.534{col 63}{space 4} .0503116{col 76}{space 3} 4.713593
{txt}{space 19}4  {c |}{col 23}{res}{space 2} 1.888058{col 35}{space 2} 1.890809{col 46}{space 1}    0.63{col 55}{space 3}0.526{col 63}{space 4} .2651999{col 76}{space 3} 13.44179
{txt}{space 19}5  {c |}{col 23}{res}{space 2}  5.30468{col 35}{space 2}  5.54017{col 46}{space 1}    1.60{col 55}{space 3}0.110{col 63}{space 4} .6849682{col 76}{space 3} 41.08166
{txt}{space 19}6  {c |}{col 23}{res}{space 2} 7.396409{col 35}{space 2} 8.710276{col 46}{space 1}    1.70{col 55}{space 3}0.089{col 63}{space 4} .7355555{col 76}{space 3}  74.3749
{txt}{space 21} {c |}
{space 17}nday {c |}
{space 19}2  {c |}{col 23}{res}{space 2} 2.819933{col 35}{space 2} 4.659922{col 46}{space 1}    0.63{col 55}{space 3}0.530{col 63}{space 4}  .110569{col 76}{space 3} 71.91908
{txt}{space 19}3  {c |}{col 23}{res}{space 2}        1{col 35}{txt}  (empty)
{space 19}5  {c |}{col 23}{res}{space 2} .8111798{col 35}{space 2} 3.171171{col 46}{space 1}   -0.05{col 55}{space 3}0.957{col 63}{space 4} .0003815{col 76}{space 3}  1724.83
{txt}{space 19}6  {c |}{col 23}{res}{space 2} .2158964{col 35}{space 2} .3792172{col 46}{space 1}   -0.87{col 55}{space 3}0.383{col 63}{space 4} .0069044{col 76}{space 3} 6.750907
{txt}{space 19}7  {c |}{col 23}{res}{space 2} 1.794112{col 35}{space 2} 3.104092{col 46}{space 1}    0.34{col 55}{space 3}0.735{col 63}{space 4} .0604142{col 76}{space 3} 53.27949
{txt}{space 19}8  {c |}{col 23}{res}{space 2} 12.34997{col 35}{space 2} 23.24985{col 46}{space 1}    1.34{col 55}{space 3}0.182{col 63}{space 4} .3084661{col 76}{space 3} 494.4522
{txt}{space 19}9  {c |}{col 23}{res}{space 2}        1{col 35}{txt}  (empty)
{space 18}10  {c |}{col 23}{res}{space 2} 2.154564{col 35}{space 2} 3.454749{col 46}{space 1}    0.48{col 55}{space 3}0.632{col 63}{space 4} .0930026{col 76}{space 3} 49.91415
{txt}{space 18}11  {c |}{col 23}{res}{space 2} .5243265{col 35}{space 2} .7862984{col 46}{space 1}   -0.43{col 55}{space 3}0.667{col 63}{space 4} .0277402{col 76}{space 3} 9.910454
{txt}{space 18}15  {c |}{col 23}{res}{space 2} 4.166271{col 35}{space 2} 6.325948{col 46}{space 1}    0.94{col 55}{space 3}0.347{col 63}{space 4} .2124748{col 76}{space 3} 81.69353
{txt}{space 18}16  {c |}{col 23}{res}{space 2} 1.717811{col 35}{space 2} 2.378387{col 46}{space 1}    0.39{col 55}{space 3}0.696{col 63}{space 4} .1138804{col 76}{space 3} 25.91207
{txt}{space 18}17  {c |}{col 23}{res}{space 2} 3.606418{col 35}{space 2} 5.394099{col 46}{space 1}    0.86{col 55}{space 3}0.391{col 63}{space 4} .1922821{col 76}{space 3} 67.64152
{txt}{space 18}18  {c |}{col 23}{res}{space 2}  4.59687{col 35}{space 2} 6.762322{col 46}{space 1}    1.04{col 55}{space 3}0.300{col 63}{space 4}  .257208{col 76}{space 3} 82.15615
{txt}{space 18}19  {c |}{col 23}{res}{space 2} 5.464104{col 35}{space 2} 10.89328{col 46}{space 1}    0.85{col 55}{space 3}0.394{col 63}{space 4} .1097884{col 76}{space 3} 271.9453
{txt}{space 18}20  {c |}{col 23}{res}{space 2} 1.675856{col 35}{space 2} 6.348324{col 46}{space 1}    0.14{col 55}{space 3}0.892{col 63}{space 4} .0009995{col 76}{space 3} 2809.836
{txt}{space 18}21  {c |}{col 23}{res}{space 2}        1{col 35}{txt}  (empty)
{space 18}22  {c |}{col 23}{res}{space 2}  2.07173{col 35}{space 2} 3.248978{col 46}{space 1}    0.46{col 55}{space 3}0.642{col 63}{space 4} .0958167{col 76}{space 3} 44.79454
{txt}{space 18}23  {c |}{col 23}{res}{space 2} 1.422955{col 35}{space 2} 2.067715{col 46}{space 1}    0.24{col 55}{space 3}0.808{col 63}{space 4} .0824704{col 76}{space 3} 24.55183
{txt}{space 18}24  {c |}{col 23}{res}{space 2} 4.446672{col 35}{space 2} 7.126043{col 46}{space 1}    0.93{col 55}{space 3}0.352{col 63}{space 4} .1922811{col 76}{space 3} 102.8333
{txt}{space 18}25  {c |}{col 23}{res}{space 2} 1.430895{col 35}{space 2} 2.222988{col 46}{space 1}    0.23{col 55}{space 3}0.818{col 63}{space 4}   .06811{col 76}{space 3} 30.06108
{txt}{space 18}26  {c |}{col 23}{res}{space 2} .7508836{col 35}{space 2} 4.033078{col 46}{space 1}   -0.05{col 55}{space 3}0.957{col 63}{space 4} .0000201{col 76}{space 3} 28020.09
{txt}{space 18}29  {c |}{col 23}{res}{space 2} .1973635{col 35}{space 2} .3755369{col 46}{space 1}   -0.85{col 55}{space 3}0.394{col 63}{space 4} .0047384{col 76}{space 3} 8.220643
{txt}{space 18}30  {c |}{col 23}{res}{space 2} .4621828{col 35}{space 2} .9499122{col 46}{space 1}   -0.38{col 55}{space 3}0.707{col 63}{space 4} .0082293{col 76}{space 3}  25.9577
{txt}{space 18}31  {c |}{col 23}{res}{space 2}        1{col 35}{txt}  (empty)
{space 21} {c |}
{space 18}sal {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .1958063{col 35}{space 2} .3063932{col 46}{space 1}   -1.04{col 55}{space 3}0.297{col 63}{space 4} .0091177{col 76}{space 3} 4.205015
{txt}{space 19}3  {c |}{col 23}{res}{space 2} .5782872{col 35}{space 2} .8563072{col 46}{space 1}   -0.37{col 55}{space 3}0.711{col 63}{space 4} .0317479{col 76}{space 3}  10.5335
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .3899425{col 35}{space 2} .5743346{col 46}{space 1}   -0.64{col 55}{space 3}0.523{col 63}{space 4} .0217416{col 76}{space 3} 6.993745
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .4000742{col 35}{space 2} .5941743{col 46}{space 1}   -0.62{col 55}{space 3}0.537{col 63}{space 4} .0217756{col 76}{space 3} 7.350405
{txt}{space 21} {c |}
{space 13}envrsp_r {c |}{col 23}{res}{space 2} 3.518656{col 35}{space 2} 1.571324{col 46}{space 1}    2.82{col 55}{space 3}0.005{col 63}{space 4} 1.466413{col 76}{space 3}  8.44301
{txt}{space 15}female {c |}{col 23}{res}{space 2} .8173395{col 35}{space 2} .3699283{col 46}{space 1}   -0.45{col 55}{space 3}0.656{col 63}{space 4} .3366264{col 76}{space 3} 1.984526
{txt}{space 16}age_r {c |}{col 23}{res}{space 2} .4854222{col 35}{space 2} .2154109{col 46}{space 1}   -1.63{col 55}{space 3}0.103{col 63}{space 4} .2034186{col 76}{space 3} 1.158374
{txt}{space 18}uni {c |}{col 23}{res}{space 2} 2.186476{col 35}{space 2} 1.505302{col 46}{space 1}    1.14{col 55}{space 3}0.256{col 63}{space 4} .5671875{col 76}{space 3} 8.428747
{txt}{space 15}RUDE_r {c |}{col 23}{res}{space 2} 1.514721{col 35}{space 2} .7636032{col 46}{space 1}    0.82{col 55}{space 3}0.410{col 63}{space 4} .5639284{col 76}{space 3} 4.068568
{txt}{space 8}religiosity_r {c |}{col 23}{res}{space 2} 2.023643{col 35}{space 2} .9210326{col 46}{space 1}    1.55{col 55}{space 3}0.121{col 63}{space 4} .8293188{col 76}{space 3} 4.937946
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} .6794555{col 35}{space 2} 1.717395{col 46}{space 1}   -0.15{col 55}{space 3}0.878{col 63}{space 4} .0047936{col 76}{space 3} 96.30799
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}
({res}est3{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est3:est3}}{col 14}{c |}{res}{col 16}       321{col 28}-217.7651{col 39}-92.61213{col 50}    40{col 58} 265.2243{col 69} 416.0819
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. margins, dydx(middleclass) at(taxresp=(1(1)7)) level(90)
{res}
{txt}{col 1}Average marginal effects{col 60}{lalign 13:Number of obs}{col 73} = {res}{ralign 3:321}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(DV_1), predict()}{p_end}
{p2col:dy/dx wrt:}{res:1.middleclass}{p_end}
{p2colreset}{...}
{lalign 7:1._at: }{space 0}{lalign 7:taxresp} = {res:{ralign 1:1}}
{lalign 7:2._at: }{space 0}{lalign 7:taxresp} = {res:{ralign 1:2}}
{lalign 7:3._at: }{space 0}{lalign 7:taxresp} = {res:{ralign 1:3}}
{lalign 7:4._at: }{space 0}{lalign 7:taxresp} = {res:{ralign 1:4}}
{lalign 7:5._at: }{space 0}{lalign 7:taxresp} = {res:{ralign 1:5}}
{lalign 7:6._at: }{space 0}{lalign 7:taxresp} = {res:{ralign 1:6}}
{lalign 7:7._at: }{space 0}{lalign 7:taxresp} = {res:{ralign 1:7}}

{res}{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28} Delta-method
{col 16}{c |}      dy/dx{col 28}   std. err.{col 40}      z{col 48}   P>|z|{col 56}     [90% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0.middleclass {col 16}{txt}{c |}  (base outcome)
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1.middleclass  {txt}{c |}
{space 11}_at {c |}
{space 12}1  {c |}{col 16}{res}{space 2} .0886275{col 28}{space 2} .1781224{col 39}{space 1}    0.50{col 48}{space 3}0.619{col 56}{space 4}-.2043577{col 69}{space 3} .3816127
{txt}{space 12}2  {c |}{col 16}{res}{space 2} .0208062{col 28}{space 2} .1332906{col 39}{space 1}    0.16{col 48}{space 3}0.876{col 56}{space 4}-.1984374{col 69}{space 3} .2400498
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.0422631{col 28}{space 2}  .090658{col 39}{space 1}   -0.47{col 48}{space 3}0.641{col 56}{space 4}-.1913822{col 69}{space 3} .1068561
{txt}{space 12}4  {c |}{col 16}{res}{space 2}-.0991407{col 28}{space 2} .0625668{col 39}{space 1}   -1.58{col 48}{space 3}0.113{col 56}{space 4} -.202054{col 69}{space 3} .0037726
{txt}{space 12}5  {c |}{col 16}{res}{space 2}-.1523946{col 28}{space 2} .0582815{col 39}{space 1}   -2.61{col 48}{space 3}0.009{col 56}{space 4}-.2482592{col 69}{space 3}-.0565301
{txt}{space 12}6  {c |}{col 16}{res}{space 2}-.2016128{col 28}{space 2} .0727159{col 39}{space 1}   -2.77{col 48}{space 3}0.006{col 56}{space 4}-.3212198{col 69}{space 3}-.0820059
{txt}{space 12}7  {c |}{col 16}{res}{space 2}-.2402662{col 28}{space 2} .0859812{col 39}{space 1}   -2.79{col 48}{space 3}0.005{col 56}{space 4}-.3816927{col 69}{space 3}-.0988397
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 80}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. marginsplot, yline(0) title("") ytitle("Effects of Middle-income on Voting Right") xlabel(1 `" "1" "Rich keep wealth"' 2 "2" 3 "3" 4 "4" 5 "5" 6 "6" 7 `" "7" "Tax rich" "')
{res}
{text}{p 0 0 2}Variables that uniquely identify margins: {bf:taxresp}{p_end}
{res}{txt}
{com}. 
. graph save FigureC1, replace
{txt}{p 0 4 2}
(file {bf}
FigureC1.gph{rm}
not found)
{p_end}
{res}{txt}file {bf:FigureC1.gph} saved

{com}. 
. esttab using TableC2.rtf, eform ///
>         label title (Mechanisms) nonumbers mtitles ("M1" "M2" "M3" "M4") ///
>         starlevels(+ 0.1 * 0.05 ** 0.01 *** 0.001) ///
>         b(2) se(2) r2 ///  
>         varlabels(_cons Constant) replace
{res}{txt}(output written to {browse  `"TableC2.rtf"'})

{com}. 
. ********************************************************************************
. 
. *Alternative operationalization of salience (R&R-R3)
. 
. drop salient_2
{txt}
{com}. 
. gen salient_2=0 if taxes==3 | taxes==4 | taxes==2 | taxes==0
{txt}(525 missing values generated)

{com}. replace salient_2=1 if taxes!=3 & taxes!=0 & taxes!=4 & taxes!=2
{txt}(525 real changes made)

{com}. 
. gen salient_3=0 if taxes==3 | taxes==0
{txt}(1,563 missing values generated)

{com}. replace salient_3=1 if taxes==4 | taxes==2
{txt}(1,038 real changes made)

{com}. replace salient_3=2 if taxes==1 | taxes==5
{txt}(291 real changes made)

{com}. 
. eststo clear
{txt}
{com}. 
. eststo: logit DV_1 i.middleclass##i.salient_2 DV_93_1 upperclass i.ideol_2 i.nday i.pos_2 female age_r uni if (id2==2), or

{txt}note: {bf:3.nday} != 0 predicts success perfectly;
      {bf:3.nday} omitted and 1 obs not used.

note: {bf:5.nday} != 0 predicts success perfectly;
      {bf:5.nday} omitted and 1 obs not used.

note: {bf:9.nday} != 0 predicts success perfectly;
      {bf:9.nday} omitted and 2 obs not used.

note: {bf:21.nday} != 0 predicts failure perfectly;
      {bf:21.nday} omitted and 2 obs not used.

note: {bf:31.nday} != 0 predicts success perfectly;
      {bf:31.nday} omitted and 1 obs not used.

{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-238.96773}  
Iteration 1:{space 2}Log likelihood = {res:-116.21157}  
Iteration 2:{space 2}Log likelihood = {res:-108.58027}  
Iteration 3:{space 2}Log likelihood = {res:-108.06208}  
Iteration 4:{space 2}Log likelihood = {res:  -108.057}  
Iteration 5:{space 2}Log likelihood = {res:  -108.057}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:351}
{txt}{col 57}{lalign 13:LR chi2({res:37})}{col 70} = {res}{ralign 6:261.82}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 8:-108.057}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.5478}

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                 DV_1{col 23}{c |} Odds ratio{col 35}   Std. err.{col 47}      z{col 55}   P>|z|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}1.middleclass {c |}{col 23}{res}{space 2} .3094512{col 35}{space 2} .1730006{col 46}{space 1}   -2.10{col 55}{space 3}0.036{col 63}{space 4} .1034482{col 76}{space 3} .9256814
{txt}{space 10}1.salient_2 {c |}{col 23}{res}{space 2} .8958027{col 35}{space 2} .4801392{col 46}{space 1}   -0.21{col 55}{space 3}0.837{col 63}{space 4} .3133133{col 76}{space 3} 2.561214
{txt}{space 21} {c |}
middleclass#salient_2 {c |}
{space 17}1 1  {c |}{col 23}{res}{space 2} .0218419{col 35}{space 2}  .037028{col 46}{space 1}   -2.26{col 55}{space 3}0.024{col 63}{space 4} .0007875{col 76}{space 3} .6057726
{txt}{space 21} {c |}
{space 14}DV_93_1 {c |}{col 23}{res}{space 2} 35.33452{col 35}{space 2} 16.95421{col 46}{space 1}    7.43{col 55}{space 3}0.000{col 63}{space 4} 13.79672{col 76}{space 3}  90.4946
{txt}{space 11}upperclass {c |}{col 23}{res}{space 2} .3997287{col 35}{space 2} .2167198{col 46}{space 1}   -1.69{col 55}{space 3}0.091{col 63}{space 4} .1381249{col 76}{space 3} 1.156801
{txt}{space 21} {c |}
{space 14}ideol_2 {c |}
{space 19}3  {c |}{col 23}{res}{space 2} .7987325{col 35}{space 2} .8072959{col 46}{space 1}   -0.22{col 55}{space 3}0.824{col 63}{space 4} .1101727{col 76}{space 3}  5.79067
{txt}{space 19}4  {c |}{col 23}{res}{space 2} 2.573786{col 35}{space 2} 2.213618{col 46}{space 1}    1.10{col 55}{space 3}0.272{col 63}{space 4} .4769639{col 76}{space 3} 13.88862
{txt}{space 19}5  {c |}{col 23}{res}{space 2} 5.379803{col 35}{space 2} 4.930978{col 46}{space 1}    1.84{col 55}{space 3}0.066{col 63}{space 4} .8924395{col 76}{space 3} 32.43053
{txt}{space 19}6  {c |}{col 23}{res}{space 2} 12.83547{col 35}{space 2} 13.06127{col 46}{space 1}    2.51{col 55}{space 3}0.012{col 63}{space 4}  1.74677{col 76}{space 3} 94.31653
{txt}{space 21} {c |}
{space 17}nday {c |}
{space 19}2  {c |}{col 23}{res}{space 2} 3.480129{col 35}{space 2} 6.030772{col 46}{space 1}    0.72{col 55}{space 3}0.472{col 63}{space 4} .1165559{col 76}{space 3} 103.9098
{txt}{space 19}3  {c |}{col 23}{res}{space 2}        1{col 35}{txt}  (empty)
{space 19}5  {c |}{col 23}{res}{space 2}        1{col 35}{txt}  (empty)
{space 19}6  {c |}{col 23}{res}{space 2} .4531107{col 35}{space 2} .7576019{col 46}{space 1}   -0.47{col 55}{space 3}0.636{col 63}{space 4} .0170999{col 76}{space 3} 12.00645
{txt}{space 19}7  {c |}{col 23}{res}{space 2} .4992065{col 35}{space 2}  .780655{col 46}{space 1}   -0.44{col 55}{space 3}0.657{col 63}{space 4} .0232905{col 76}{space 3} 10.69996
{txt}{space 19}8  {c |}{col 23}{res}{space 2}  2.41138{col 35}{space 2} 4.751545{col 46}{space 1}    0.45{col 55}{space 3}0.655{col 63}{space 4} .0506992{col 76}{space 3} 114.6912
{txt}{space 19}9  {c |}{col 23}{res}{space 2}        1{col 35}{txt}  (empty)
{space 18}10  {c |}{col 23}{res}{space 2} 1.166363{col 35}{space 2} 1.864576{col 46}{space 1}    0.10{col 55}{space 3}0.923{col 63}{space 4} .0508257{col 76}{space 3} 26.76608
{txt}{space 18}11  {c |}{col 23}{res}{space 2} .3865242{col 35}{space 2} .5556297{col 46}{space 1}   -0.66{col 55}{space 3}0.508{col 63}{space 4} .0230979{col 76}{space 3}  6.46817
{txt}{space 18}15  {c |}{col 23}{res}{space 2} 2.582485{col 35}{space 2} 3.737568{col 46}{space 1}    0.66{col 55}{space 3}0.512{col 63}{space 4} .1513961{col 76}{space 3} 44.05155
{txt}{space 18}16  {c |}{col 23}{res}{space 2} 1.084307{col 35}{space 2}  1.48684{col 46}{space 1}    0.06{col 55}{space 3}0.953{col 63}{space 4} .0737826{col 76}{space 3} 15.93494
{txt}{space 18}17  {c |}{col 23}{res}{space 2} 1.023966{col 35}{space 2} 1.524625{col 46}{space 1}    0.02{col 55}{space 3}0.987{col 63}{space 4}  .055322{col 76}{space 3} 18.95282
{txt}{space 18}18  {c |}{col 23}{res}{space 2} 4.027801{col 35}{space 2} 5.851854{col 46}{space 1}    0.96{col 55}{space 3}0.338{col 63}{space 4} .2335536{col 76}{space 3} 69.46235
{txt}{space 18}19  {c |}{col 23}{res}{space 2} 2.523923{col 35}{space 2} 4.512293{col 46}{space 1}    0.52{col 55}{space 3}0.605{col 63}{space 4} .0759085{col 76}{space 3} 83.91932
{txt}{space 18}20  {c |}{col 23}{res}{space 2} 13.23211{col 35}{space 2} 88.08411{col 46}{space 1}    0.39{col 55}{space 3}0.698{col 63}{space 4} .0000285{col 76}{space 3}  6136873
{txt}{space 18}21  {c |}{col 23}{res}{space 2}        1{col 35}{txt}  (empty)
{space 18}22  {c |}{col 23}{res}{space 2} 2.011663{col 35}{space 2} 2.963237{col 46}{space 1}    0.47{col 55}{space 3}0.635{col 63}{space 4} .1121271{col 76}{space 3} 36.09106
{txt}{space 18}23  {c |}{col 23}{res}{space 2}  .411781{col 35}{space 2} .6131827{col 46}{space 1}   -0.60{col 55}{space 3}0.551{col 63}{space 4} .0222404{col 76}{space 3} 7.624118
{txt}{space 18}24  {c |}{col 23}{res}{space 2} 4.805323{col 35}{space 2} 7.322294{col 46}{space 1}    1.03{col 55}{space 3}0.303{col 63}{space 4} .2424776{col 76}{space 3} 95.22992
{txt}{space 18}25  {c |}{col 23}{res}{space 2} 1.444468{col 35}{space 2}  2.14324{col 46}{space 1}    0.25{col 55}{space 3}0.804{col 63}{space 4} .0788373{col 76}{space 3} 26.46575
{txt}{space 18}26  {c |}{col 23}{res}{space 2} 57.20958{col 35}{space 2} 228.9185{col 46}{space 1}    1.01{col 55}{space 3}0.312{col 63}{space 4} .0224631{col 76}{space 3} 145702.9
{txt}{space 18}29  {c |}{col 23}{res}{space 2} .0605803{col 35}{space 2} .1137982{col 46}{space 1}   -1.49{col 55}{space 3}0.136{col 63}{space 4} .0015254{col 76}{space 3} 2.405951
{txt}{space 18}30  {c |}{col 23}{res}{space 2}  .183252{col 35}{space 2} .3676127{col 46}{space 1}   -0.85{col 55}{space 3}0.398{col 63}{space 4} .0035933{col 76}{space 3} 9.345483
{txt}{space 18}31  {c |}{col 23}{res}{space 2}        1{col 35}{txt}  (empty)
{space 21} {c |}
{space 16}pos_2 {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .8555648{col 35}{space 2} 1.001266{col 46}{space 1}   -0.13{col 55}{space 3}0.894{col 63}{space 4} .0863163{col 76}{space 3} 8.480335
{txt}{space 19}3  {c |}{col 23}{res}{space 2} 1.835254{col 35}{space 2} 1.872913{col 46}{space 1}    0.59{col 55}{space 3}0.552{col 63}{space 4} .2483294{col 76}{space 3} 13.56326
{txt}{space 19}4  {c |}{col 23}{res}{space 2}  .846095{col 35}{space 2} .8248072{col 46}{space 1}   -0.17{col 55}{space 3}0.864{col 63}{space 4} .1252085{col 76}{space 3} 5.717477
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .4816706{col 35}{space 2} .4792473{col 46}{space 1}   -0.73{col 55}{space 3}0.463{col 63}{space 4} .0685222{col 76}{space 3} 3.385861
{txt}{space 19}6  {c |}{col 23}{res}{space 2} .3649166{col 35}{space 2} .3817556{col 46}{space 1}   -0.96{col 55}{space 3}0.335{col 63}{space 4} .0469584{col 76}{space 3} 2.835788
{txt}{space 19}7  {c |}{col 23}{res}{space 2} .1293835{col 35}{space 2} .1594124{col 46}{space 1}   -1.66{col 55}{space 3}0.097{col 63}{space 4} .0115643{col 76}{space 3} 1.447564
{txt}{space 21} {c |}
{space 15}female {c |}{col 23}{res}{space 2} 1.317946{col 35}{space 2}  .521828{col 46}{space 1}    0.70{col 55}{space 3}0.486{col 63}{space 4} .6065584{col 76}{space 3} 2.863668
{txt}{space 16}age_r {c |}{col 23}{res}{space 2} .4838813{col 35}{space 2}  .204398{col 46}{space 1}   -1.72{col 55}{space 3}0.086{col 63}{space 4} .2114364{col 76}{space 3} 1.107383
{txt}{space 18}uni {c |}{col 23}{res}{space 2} 2.493223{col 35}{space 2} 1.552443{col 46}{space 1}    1.47{col 55}{space 3}0.142{col 63}{space 4} .7357791{col 76}{space 3} 8.448406
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} .1202159{col 35}{space 2} .2242225{col 46}{space 1}   -1.14{col 55}{space 3}0.256{col 63}{space 4} .0031069{col 76}{space 3} 4.651505
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}
({res}est1{txt} stored)

{com}. margins i.middleclass#i.salient_2, level(90)
{res}
{txt}{col 1}Predictive margins{col 60}{lalign 13:Number of obs}{col 73} = {res}{ralign 3:351}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(DV_1), predict()}{p_end}
{p2colreset}{...}

{res}{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35} Delta-method
{col 23}{c |}     Margin{col 35}   std. err.{col 47}      z{col 55}   P>|z|{col 63}     [90% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
middleclass#salient_2 {c |}
{space 17}0 0  {c |}{col 23}{res}{space 2} .4655432{col 35}{space 2} .0239187{col 46}{space 1}   19.46{col 55}{space 3}0.000{col 63}{space 4} .4262004{col 76}{space 3} .5048859
{txt}{space 17}0 1  {c |}{col 23}{res}{space 2} .4546981{col 35}{space 2} .0468384{col 46}{space 1}    9.71{col 55}{space 3}0.000{col 63}{space 4} .3776558{col 76}{space 3} .5317404
{txt}{space 17}1 0  {c |}{col 23}{res}{space 2} .3543342{col 35}{space 2} .0412623{col 46}{space 1}    8.59{col 55}{space 3}0.000{col 63}{space 4} .2864638{col 76}{space 3} .4222046
{txt}{space 17}1 1  {c |}{col 23}{res}{space 2} .0659243{col 35}{space 2} .0635482{col 46}{space 1}    1.04{col 55}{space 3}0.300{col 63}{space 4}-.0386033{col 76}{space 3} .1704518
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. marginsplot, recast(dot) name(figurec2a, replace) level(90) title("Alternative salience", position(12)) ytitle(Probability of Voting Right) xtitle(Income Groups) xlabel(0 "No Middle Income" 1 "Middle Income") xscale(range(-0.25 1.25)) plotopts(dcolor(white%0)) ///
> legend(order(1 "Non-salient Taxes" 2 "Salient Taxes") size(small) region(lwidth(none)) ring(0) col(1)) ylabel(, grid glwidth(medthin) glcolor(gs8) glpattern(dot))
{res}
{text}{p 0 0 2}Variables that uniquely identify margins: {bf:middleclass salient_2}{p_end}
{res}{txt}
{com}. 
. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est1:est1}}{col 14}{c |}{res}{col 16}       351{col 28}-238.9677{col 39} -108.057{col 50}    38{col 58}  292.114{col 69} 438.8239
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. 
. eststo: logit DV_1 i.middleclass##i.salient_3 DV_93_1 upperclass i.ideol_2 i.nday i.pos_2 female age_r uni if (id2==2), or

{txt}note: {bf:3.nday} != 0 predicts success perfectly;
      {bf:3.nday} omitted and 1 obs not used.

note: {bf:9.nday} != 0 predicts success perfectly;
      {bf:9.nday} omitted and 2 obs not used.

note: {bf:21.nday} != 0 predicts failure perfectly;
      {bf:21.nday} omitted and 1 obs not used.

note: {bf:31.nday} != 0 predicts success perfectly;
      {bf:31.nday} omitted and 1 obs not used.

{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-226.64279}  
Iteration 1:{space 2}Log likelihood = {res:-109.93747}  
Iteration 2:{space 2}Log likelihood = {res:-102.95417}  
Iteration 3:{space 2}Log likelihood = {res:-102.51095}  
Iteration 4:{space 2}Log likelihood = {res:-102.50913}  
Iteration 5:{space 2}Log likelihood = {res:-102.50913}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:332}
{txt}{col 57}{lalign 13:LR chi2({res:39})}{col 70} = {res}{ralign 6:248.27}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-102.50913}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.5477}

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                 DV_1{col 23}{c |} Odds ratio{col 35}   Std. err.{col 47}      z{col 55}   P>|z|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}1.middleclass {c |}{col 23}{res}{space 2} .2255098{col 35}{space 2} .1748493{col 46}{space 1}   -1.92{col 55}{space 3}0.055{col 63}{space 4} .0493384{col 76}{space 3} 1.030732
{txt}{space 21} {c |}
{space 12}salient_3 {c |}
{space 19}1  {c |}{col 23}{res}{space 2}  1.00853{col 35}{space 2} .5165827{col 46}{space 1}    0.02{col 55}{space 3}0.987{col 63}{space 4} .3695658{col 76}{space 3} 2.752237
{txt}{space 19}2  {c |}{col 23}{res}{space 2} .7992077{col 35}{space 2} .5486089{col 46}{space 1}   -0.33{col 55}{space 3}0.744{col 63}{space 4} .2081422{col 76}{space 3} 3.068734
{txt}{space 21} {c |}
middleclass#salient_3 {c |}
{space 17}1 1  {c |}{col 23}{res}{space 2}  1.47937{col 35}{space 2} 1.465409{col 46}{space 1}    0.40{col 55}{space 3}0.693{col 63}{space 4} .2122797{col 76}{space 3} 10.30968
{txt}{space 17}1 2  {c |}{col 23}{res}{space 2} .0306959{col 35}{space 2} .0572142{col 46}{space 1}   -1.87{col 55}{space 3}0.062{col 63}{space 4} .0007953{col 76}{space 3} 1.184782
{txt}{space 21} {c |}
{space 14}DV_93_1 {c |}{col 23}{res}{space 2} 49.23287{col 35}{space 2} 26.44443{col 46}{space 1}    7.25{col 55}{space 3}0.000{col 63}{space 4} 17.18105{col 76}{space 3} 141.0784
{txt}{space 11}upperclass {c |}{col 23}{res}{space 2} .3185918{col 35}{space 2} .1809053{col 46}{space 1}   -2.01{col 55}{space 3}0.044{col 63}{space 4} .1046884{col 76}{space 3} .9695506
{txt}{space 21} {c |}
{space 14}ideol_2 {c |}
{space 19}3  {c |}{col 23}{res}{space 2} .8831887{col 35}{space 2} .9055396{col 46}{space 1}   -0.12{col 55}{space 3}0.904{col 63}{space 4} .1183888{col 76}{space 3}  6.58865
{txt}{space 19}4  {c |}{col 23}{res}{space 2} 2.742392{col 35}{space 2} 2.472409{col 46}{space 1}    1.12{col 55}{space 3}0.263{col 63}{space 4} .4685186{col 76}{space 3} 16.05211
{txt}{space 19}5  {c |}{col 23}{res}{space 2} 5.572552{col 35}{space 2} 5.268223{col 46}{space 1}    1.82{col 55}{space 3}0.069{col 63}{space 4} .8736523{col 76}{space 3} 35.54428
{txt}{space 19}6  {c |}{col 23}{res}{space 2} 13.27981{col 35}{space 2} 14.06746{col 46}{space 1}    2.44{col 55}{space 3}0.015{col 63}{space 4} 1.665346{col 76}{space 3}  105.896
{txt}{space 21} {c |}
{space 17}nday {c |}
{space 19}2  {c |}{col 23}{res}{space 2} 2.851903{col 35}{space 2}  5.20417{col 46}{space 1}    0.57{col 55}{space 3}0.566{col 63}{space 4} .0797732{col 76}{space 3} 101.9559
{txt}{space 19}3  {c |}{col 23}{res}{space 2}        1{col 35}{txt}  (empty)
{space 19}6  {c |}{col 23}{res}{space 2} .3627605{col 35}{space 2} .6375232{col 46}{space 1}   -0.58{col 55}{space 3}0.564{col 63}{space 4} .0115798{col 76}{space 3} 11.36423
{txt}{space 19}7  {c |}{col 23}{res}{space 2} .1813759{col 35}{space 2} .2985486{col 46}{space 1}   -1.04{col 55}{space 3}0.300{col 63}{space 4} .0072025{col 76}{space 3} 4.567467
{txt}{space 19}8  {c |}{col 23}{res}{space 2} 2.019675{col 35}{space 2} 4.108574{col 46}{space 1}    0.35{col 55}{space 3}0.730{col 63}{space 4} .0374717{col 76}{space 3} 108.8578
{txt}{space 19}9  {c |}{col 23}{res}{space 2}        1{col 35}{txt}  (empty)
{space 18}10  {c |}{col 23}{res}{space 2} .9999402{col 35}{space 2} 1.690978{col 46}{space 1}   -0.00{col 55}{space 3}1.000{col 63}{space 4} .0363517{col 76}{space 3} 27.50576
{txt}{space 18}11  {c |}{col 23}{res}{space 2} .4547059{col 35}{space 2}  .691661{col 46}{space 1}   -0.52{col 55}{space 3}0.604{col 63}{space 4}  .023065{col 76}{space 3} 8.964124
{txt}{space 18}15  {c |}{col 23}{res}{space 2} 2.363002{col 35}{space 2} 3.583218{col 46}{space 1}    0.57{col 55}{space 3}0.571{col 63}{space 4} .1209807{col 76}{space 3} 46.15431
{txt}{space 18}16  {c |}{col 23}{res}{space 2} .9230625{col 35}{space 2} 1.335758{col 46}{space 1}   -0.06{col 55}{space 3}0.956{col 63}{space 4} .0541331{col 76}{space 3} 15.73981
{txt}{space 18}17  {c |}{col 23}{res}{space 2} .8130307{col 35}{space 2} 1.285202{col 46}{space 1}   -0.13{col 55}{space 3}0.896{col 63}{space 4} .0366915{col 76}{space 3} 18.01557
{txt}{space 18}18  {c |}{col 23}{res}{space 2} 3.573512{col 35}{space 2} 5.468408{col 46}{space 1}    0.83{col 55}{space 3}0.405{col 63}{space 4} .1780467{col 76}{space 3} 71.72266
{txt}{space 18}19  {c |}{col 23}{res}{space 2} 2.220764{col 35}{space 2} 4.084298{col 46}{space 1}    0.43{col 55}{space 3}0.664{col 63}{space 4}  .060398{col 76}{space 3} 81.65484
{txt}{space 18}20  {c |}{col 23}{res}{space 2}  8.14281{col 35}{space 2} 55.33253{col 46}{space 1}    0.31{col 55}{space 3}0.758{col 63}{space 4} .0000134{col 76}{space 3}  4953500
{txt}{space 18}21  {c |}{col 23}{res}{space 2}        1{col 35}{txt}  (empty)
{space 18}22  {c |}{col 23}{res}{space 2} 1.581871{col 35}{space 2} 2.462555{col 46}{space 1}    0.29{col 55}{space 3}0.768{col 63}{space 4} .0748299{col 76}{space 3} 33.44003
{txt}{space 18}23  {c |}{col 23}{res}{space 2} .3277541{col 35}{space 2} .5139799{col 46}{space 1}   -0.71{col 55}{space 3}0.477{col 63}{space 4} .0151602{col 76}{space 3} 7.085851
{txt}{space 18}24  {c |}{col 23}{res}{space 2} 5.377637{col 35}{space 2} 8.777111{col 46}{space 1}    1.03{col 55}{space 3}0.303{col 63}{space 4} .2194334{col 76}{space 3} 131.7893
{txt}{space 18}25  {c |}{col 23}{res}{space 2} 1.270385{col 35}{space 2} 1.972414{col 46}{space 1}    0.15{col 55}{space 3}0.877{col 63}{space 4}  .060583{col 76}{space 3} 26.63915
{txt}{space 18}26  {c |}{col 23}{res}{space 2} 60.77426{col 35}{space 2} 255.3932{col 46}{space 1}    0.98{col 55}{space 3}0.328{col 63}{space 4} .0160951{col 76}{space 3} 229480.5
{txt}{space 18}29  {c |}{col 23}{res}{space 2} .0378971{col 35}{space 2} .0757687{col 46}{space 1}   -1.64{col 55}{space 3}0.102{col 63}{space 4}  .000753{col 76}{space 3} 1.907371
{txt}{space 18}30  {c |}{col 23}{res}{space 2} .1366948{col 35}{space 2} .2874302{col 46}{space 1}   -0.95{col 55}{space 3}0.344{col 63}{space 4} .0022178{col 76}{space 3} 8.425314
{txt}{space 18}31  {c |}{col 23}{res}{space 2}        1{col 35}{txt}  (empty)
{space 21} {c |}
{space 16}pos_2 {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .7585494{col 35}{space 2} .9172053{col 46}{space 1}   -0.23{col 55}{space 3}0.819{col 63}{space 4} .0709165{col 76}{space 3} 8.113722
{txt}{space 19}3  {c |}{col 23}{res}{space 2}  1.69541{col 35}{space 2} 1.808866{col 46}{space 1}    0.49{col 55}{space 3}0.621{col 63}{space 4} .2094647{col 76}{space 3} 13.72266
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .9128819{col 35}{space 2} .9266201{col 46}{space 1}   -0.09{col 55}{space 3}0.928{col 63}{space 4} .1248542{col 76}{space 3} 6.674613
{txt}{space 19}5  {c |}{col 23}{res}{space 2}  .646752{col 35}{space 2} .6726164{col 46}{space 1}   -0.42{col 55}{space 3}0.675{col 63}{space 4} .0842356{col 76}{space 3} 4.965693
{txt}{space 19}6  {c |}{col 23}{res}{space 2} .3910651{col 35}{space 2} .4231577{col 46}{space 1}   -0.87{col 55}{space 3}0.386{col 63}{space 4} .0469023{col 76}{space 3}  3.26065
{txt}{space 19}7  {c |}{col 23}{res}{space 2} .1496739{col 35}{space 2} .1919143{col 46}{space 1}   -1.48{col 55}{space 3}0.139{col 63}{space 4} .0121261{col 76}{space 3} 1.847441
{txt}{space 21} {c |}
{space 15}female {c |}{col 23}{res}{space 2} 1.118989{col 35}{space 2} .4602858{col 46}{space 1}    0.27{col 55}{space 3}0.785{col 63}{space 4} .4996803{col 76}{space 3} 2.505877
{txt}{space 16}age_r {c |}{col 23}{res}{space 2} .3647307{col 35}{space 2} .1671829{col 46}{space 1}   -2.20{col 55}{space 3}0.028{col 63}{space 4} .1485266{col 76}{space 3} .8956544
{txt}{space 18}uni {c |}{col 23}{res}{space 2} 2.715224{col 35}{space 2} 1.761381{col 46}{space 1}    1.54{col 55}{space 3}0.124{col 63}{space 4} .7614236{col 76}{space 3} 9.682441
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} .1286863{col 35}{space 2} .2540105{col 46}{space 1}   -1.04{col 55}{space 3}0.299{col 63}{space 4} .0026876{col 76}{space 3} 6.161643
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}
({res}est2{txt} stored)

{com}. margins i.middleclass#i.salient_3, level(90)
{res}
{txt}{col 1}Predictive margins{col 60}{lalign 13:Number of obs}{col 73} = {res}{ralign 3:332}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(DV_1), predict()}{p_end}
{p2colreset}{...}

{res}{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35} Delta-method
{col 23}{c |}     Margin{col 35}   std. err.{col 47}      z{col 55}   P>|z|{col 63}     [90% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
middleclass#salient_3 {c |}
{space 17}0 0  {c |}{col 23}{res}{space 2} .4700377{col 35}{space 2} .0383218{col 46}{space 1}   12.27{col 55}{space 3}0.000{col 63}{space 4}  .407004{col 76}{space 3} .5330714
{txt}{space 17}0 1  {c |}{col 23}{res}{space 2} .4708695{col 35}{space 2}  .031086{col 46}{space 1}   15.15{col 55}{space 3}0.000{col 63}{space 4} .4197377{col 76}{space 3} .5220014
{txt}{space 17}0 2  {c |}{col 23}{res}{space 2} .4483629{col 35}{space 2} .0532043{col 46}{space 1}    8.43{col 55}{space 3}0.000{col 63}{space 4} .3608495{col 76}{space 3} .5358762
{txt}{space 17}1 0  {c |}{col 23}{res}{space 2} .3338767{col 35}{space 2} .0561168{col 46}{space 1}    5.95{col 55}{space 3}0.000{col 63}{space 4} .2415728{col 76}{space 3} .4261805
{txt}{space 17}1 1  {c |}{col 23}{res}{space 2} .3689442{col 35}{space 2} .0558534{col 46}{space 1}    6.61{col 55}{space 3}0.000{col 63}{space 4} .2770736{col 76}{space 3} .4608148
{txt}{space 17}1 2  {c |}{col 23}{res}{space 2} .0713434{col 35}{space 2} .0687026{col 46}{space 1}    1.04{col 55}{space 3}0.299{col 63}{space 4}-.0416623{col 76}{space 3} .1843492
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. marginsplot, recast(dot) name(figurec2b, replace) level(90) title("Continuous salience", position(12)) ytitle(Probability of Voting Right) xtitle(Income Groups) xlabel(0 "No Middle Income" 1 "Middle Income") xscale(range(-0.25 1.25)) plotopts(dcolor(white%0)) ///
> legend(order(1 "Non-salient Taxes" 2 "Medium-salient Taxes" 3 "High-salient Taxes") size(small) region(lwidth(none)) ring(0) col(1)) ylabel(, grid glwidth(medthin) glcolor(gs8) glpattern(dot))
{res}
{text}{p 0 0 2}Variables that uniquely identify margins: {bf:middleclass salient_3}{p_end}
{res}{txt}
{com}. 
. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est2:est2}}{col 14}{c |}{res}{col 16}       332{col 28}-226.6428{col 39}-102.5091{col 50}    40{col 58} 285.0183{col 69} 437.2237
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. 
. graph combine figurec2a figurec2b, ycommon xcommon commonscheme name(g, replace)
{res}{txt}
{com}. 
. graph save FigureC2, replace
{res}{txt}file {bf:FigureC2.gph} saved

{com}. 
. esttab using TableC9.rtf, eform ///
>         label title (Alt operationalization of salience) nonumbers mtitles ("M1" "M2" "M3" "M4") ///
>         starlevels(+ 0.1 * 0.05 ** 0.01 *** 0.001) ///
>         b(2) se(2) r2 ///  
>         varlabels(_cons Constant) replace
{res}{txt}(output written to {browse  `"TableC9.rtf"'})

{com}. 
. ********************************************************************************
. 
. *OLS Models
. 
. eststo clear
{txt}
{com}. 
. eststo: reg DV_1 middleclass##treatment upperclass i.ideol_2 i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r if DV_93_1!=. & DV_96_1!=. & DV_99_1!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=. & id2<3, vce(cluster id) 

{txt}Linear regression                               Number of obs     = {res}       514
                                                {txt}F(49, 256)        =  {res}    20.94
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.4659
                                                {txt}Root MSE          =    {res} .37864

{txt}{ralign 87:(Std. err. adjusted for {res:257} clusters in {res:id})}
{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}                 DV_1{col 23}{c |} Coefficient{col 35}  std. err.{col 47}      t{col 55}   P>|t|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}1.middleclass {c |}{col 23}{res}{space 2} .1082254{col 35}{space 2} .0614263{col 46}{space 1}    1.76{col 55}{space 3}0.079{col 63}{space 4}-.0127399{col 76}{space 3} .2291907
{txt}{space 10}1.treatment {c |}{col 23}{res}{space 2} -.039941{col 35}{space 2} .0423385{col 46}{space 1}   -0.94{col 55}{space 3}0.346{col 63}{space 4}-.1233171{col 76}{space 3} .0434351
{txt}{space 21} {c |}
middleclass#treatment {c |}
{space 17}1 1  {c |}{col 23}{res}{space 2}-.1335182{col 35}{space 2} .0621355{col 46}{space 1}   -2.15{col 55}{space 3}0.033{col 63}{space 4}-.2558799{col 76}{space 3}-.0111565
{txt}{space 21} {c |}
{space 11}upperclass {c |}{col 23}{res}{space 2} .1772762{col 35}{space 2} .0512758{col 46}{space 1}    3.46{col 55}{space 3}0.001{col 63}{space 4}    .0763{col 76}{space 3} .2782523
{txt}{space 21} {c |}
{space 14}ideol_2 {c |}
{space 19}3  {c |}{col 23}{res}{space 2}-.0286772{col 35}{space 2} .0530396{col 46}{space 1}   -0.54{col 55}{space 3}0.589{col 63}{space 4}-.1331268{col 76}{space 3} .0757724
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .1557255{col 35}{space 2} .0575955{col 46}{space 1}    2.70{col 55}{space 3}0.007{col 63}{space 4} .0423041{col 76}{space 3} .2691468
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .4460209{col 35}{space 2} .0764411{col 46}{space 1}    5.83{col 55}{space 3}0.000{col 63}{space 4} .2954874{col 76}{space 3} .5965543
{txt}{space 19}6  {c |}{col 23}{res}{space 2} .5367375{col 35}{space 2} .0805981{col 46}{space 1}    6.66{col 55}{space 3}0.000{col 63}{space 4} .3780178{col 76}{space 3} .6954573
{txt}{space 21} {c |}
{space 18}day {c |}
{space 19}2  {c |}{col 23}{res}{space 2}-.3424282{col 35}{space 2} .3513767{col 46}{space 1}   -0.97{col 55}{space 3}0.331{col 63}{space 4}-1.034385{col 76}{space 3} .3495287
{txt}{space 19}3  {c |}{col 23}{res}{space 2}-.5062707{col 35}{space 2} .1805644{col 46}{space 1}   -2.80{col 55}{space 3}0.005{col 63}{space 4}-.8618514{col 76}{space 3}  -.15069
{txt}{space 19}4  {c |}{col 23}{res}{space 2}-.1095039{col 35}{space 2} .1196951{col 46}{space 1}   -0.91{col 55}{space 3}0.361{col 63}{space 4}-.3452164{col 76}{space 3} .1262086
{txt}{space 19}5  {c |}{col 23}{res}{space 2}-.1680489{col 35}{space 2} .1304887{col 46}{space 1}   -1.29{col 55}{space 3}0.199{col 63}{space 4}-.4250169{col 76}{space 3} .0889191
{txt}{space 19}6  {c |}{col 23}{res}{space 2} .0042531{col 35}{space 2} .1111835{col 46}{space 1}    0.04{col 55}{space 3}0.970{col 63}{space 4}-.2146977{col 76}{space 3} .2232039
{txt}{space 19}7  {c |}{col 23}{res}{space 2}-.1442216{col 35}{space 2} .1540218{col 46}{space 1}   -0.94{col 55}{space 3}0.350{col 63}{space 4}-.4475327{col 76}{space 3} .1590894
{txt}{space 19}8  {c |}{col 23}{res}{space 2}-.1805878{col 35}{space 2} .1151545{col 46}{space 1}   -1.57{col 55}{space 3}0.118{col 63}{space 4}-.4073585{col 76}{space 3} .0461829
{txt}{space 19}9  {c |}{col 23}{res}{space 2} .0602698{col 35}{space 2} .3264411{col 46}{space 1}    0.18{col 55}{space 3}0.854{col 63}{space 4}-.5825821{col 76}{space 3} .7031216
{txt}{space 18}10  {c |}{col 23}{res}{space 2}-.2462827{col 35}{space 2} .1406774{col 46}{space 1}   -1.75{col 55}{space 3}0.081{col 63}{space 4} -.523315{col 76}{space 3} .0307496
{txt}{space 18}11  {c |}{col 23}{res}{space 2}-.2132672{col 35}{space 2} .1042873{col 46}{space 1}   -2.04{col 55}{space 3}0.042{col 63}{space 4}-.4186375{col 76}{space 3}-.0078969
{txt}{space 18}12  {c |}{col 23}{res}{space 2}   .11665{col 35}{space 2} .1704558{col 46}{space 1}    0.68{col 55}{space 3}0.494{col 63}{space 4}-.2190242{col 76}{space 3} .4523242
{txt}{space 18}13  {c |}{col 23}{res}{space 2}-.2334393{col 35}{space 2} .1553841{col 46}{space 1}   -1.50{col 55}{space 3}0.134{col 63}{space 4}-.5394331{col 76}{space 3} .0725546
{txt}{space 18}14  {c |}{col 23}{res}{space 2}-.2548308{col 35}{space 2} .1057401{col 46}{space 1}   -2.41{col 55}{space 3}0.017{col 63}{space 4} -.463062{col 76}{space 3}-.0465996
{txt}{space 18}15  {c |}{col 23}{res}{space 2}-.1541286{col 35}{space 2} .1072477{col 46}{space 1}   -1.44{col 55}{space 3}0.152{col 63}{space 4}-.3653286{col 76}{space 3} .0570715
{txt}{space 18}16  {c |}{col 23}{res}{space 2}-.2131564{col 35}{space 2} .0995653{col 46}{space 1}   -2.14{col 55}{space 3}0.033{col 63}{space 4}-.4092277{col 76}{space 3}-.0170851
{txt}{space 18}17  {c |}{col 23}{res}{space 2}-.1989945{col 35}{space 2} .1189778{col 46}{space 1}   -1.67{col 55}{space 3}0.096{col 63}{space 4}-.4332944{col 76}{space 3} .0353055
{txt}{space 18}18  {c |}{col 23}{res}{space 2} -.317904{col 35}{space 2} .1156979{col 46}{space 1}   -2.75{col 55}{space 3}0.006{col 63}{space 4}-.5457448{col 76}{space 3}-.0900631
{txt}{space 18}19  {c |}{col 23}{res}{space 2}-.1692391{col 35}{space 2} .1333571{col 46}{space 1}   -1.27{col 55}{space 3}0.206{col 63}{space 4}-.4318558{col 76}{space 3} .0933777
{txt}{space 18}21  {c |}{col 23}{res}{space 2}-.2109511{col 35}{space 2} .1146271{col 46}{space 1}   -1.84{col 55}{space 3}0.067{col 63}{space 4}-.4366833{col 76}{space 3} .0147811
{txt}{space 18}22  {c |}{col 23}{res}{space 2}-.2079787{col 35}{space 2} .1110522{col 46}{space 1}   -1.87{col 55}{space 3}0.062{col 63}{space 4}-.4266709{col 76}{space 3} .0107136
{txt}{space 18}23  {c |}{col 23}{res}{space 2}-.1464281{col 35}{space 2} .0999896{col 46}{space 1}   -1.46{col 55}{space 3}0.144{col 63}{space 4} -.343335{col 76}{space 3} .0504788
{txt}{space 18}24  {c |}{col 23}{res}{space 2}-.2462738{col 35}{space 2} .1146327{col 46}{space 1}   -2.15{col 55}{space 3}0.033{col 63}{space 4}-.4720169{col 76}{space 3}-.0205307
{txt}{space 18}25  {c |}{col 23}{res}{space 2}-.1595495{col 35}{space 2}  .107259{col 46}{space 1}   -1.49{col 55}{space 3}0.138{col 63}{space 4}-.3707717{col 76}{space 3} .0516728
{txt}{space 18}26  {c |}{col 23}{res}{space 2} .1482288{col 35}{space 2}  .377043{col 46}{space 1}    0.39{col 55}{space 3}0.695{col 63}{space 4}-.5942721{col 76}{space 3} .8907298
{txt}{space 18}28  {c |}{col 23}{res}{space 2}-.2350246{col 35}{space 2}  .149762{col 46}{space 1}   -1.57{col 55}{space 3}0.118{col 63}{space 4} -.529947{col 76}{space 3} .0598979
{txt}{space 18}29  {c |}{col 23}{res}{space 2}-.1505641{col 35}{space 2} .1203816{col 46}{space 1}   -1.25{col 55}{space 3}0.212{col 63}{space 4}-.3876285{col 76}{space 3} .0865003
{txt}{space 18}30  {c |}{col 23}{res}{space 2}-.3101187{col 35}{space 2}  .153053{col 46}{space 1}   -2.03{col 55}{space 3}0.044{col 63}{space 4} -.611522{col 76}{space 3}-.0087154
{txt}{space 18}31  {c |}{col 23}{res}{space 2}-.2023657{col 35}{space 2} .1107016{col 46}{space 1}   -1.83{col 55}{space 3}0.069{col 63}{space 4}-.4203674{col 76}{space 3}  .015636
{txt}{space 21} {c |}
{space 18}sal {c |}
{space 19}2  {c |}{col 23}{res}{space 2} -.269881{col 35}{space 2} .2161481{col 46}{space 1}   -1.25{col 55}{space 3}0.213{col 63}{space 4}-.6955357{col 76}{space 3} .1557738
{txt}{space 19}3  {c |}{col 23}{res}{space 2}-.2711106{col 35}{space 2} .2176188{col 46}{space 1}   -1.25{col 55}{space 3}0.214{col 63}{space 4}-.6996616{col 76}{space 3} .1574404
{txt}{space 19}4  {c |}{col 23}{res}{space 2}-.2390899{col 35}{space 2} .2176119{col 46}{space 1}   -1.10{col 55}{space 3}0.273{col 63}{space 4}-.6676273{col 76}{space 3} .1894475
{txt}{space 19}5  {c |}{col 23}{res}{space 2}-.2495949{col 35}{space 2} .2165668{col 46}{space 1}   -1.15{col 55}{space 3}0.250{col 63}{space 4}-.6760742{col 76}{space 3} .1768844
{txt}{space 21} {c |}
{space 16}pos_2 {c |}
{space 19}2  {c |}{col 23}{res}{space 2}-.1327699{col 35}{space 2} .1143438{col 46}{space 1}   -1.16{col 55}{space 3}0.247{col 63}{space 4}-.3579442{col 76}{space 3} .0924044
{txt}{space 19}3  {c |}{col 23}{res}{space 2}-.1056934{col 35}{space 2}   .10736{col 46}{space 1}   -0.98{col 55}{space 3}0.326{col 63}{space 4}-.3171147{col 76}{space 3}  .105728
{txt}{space 19}4  {c |}{col 23}{res}{space 2}-.3364567{col 35}{space 2} .1068086{col 46}{space 1}   -3.15{col 55}{space 3}0.002{col 63}{space 4}-.5467921{col 76}{space 3}-.1261213
{txt}{space 19}5  {c |}{col 23}{res}{space 2}-.3799046{col 35}{space 2} .1057774{col 46}{space 1}   -3.59{col 55}{space 3}0.000{col 63}{space 4}-.5882093{col 76}{space 3}-.1715999
{txt}{space 19}6  {c |}{col 23}{res}{space 2}-.4497335{col 35}{space 2}  .108507{col 46}{space 1}   -4.14{col 55}{space 3}0.000{col 63}{space 4}-.6634134{col 76}{space 3}-.2360535
{txt}{space 19}7  {c |}{col 23}{res}{space 2}-.5580662{col 35}{space 2} .1104116{col 46}{space 1}   -5.05{col 55}{space 3}0.000{col 63}{space 4}-.7754969{col 76}{space 3}-.3406356
{txt}{space 21} {c |}
{space 13}envrsp_r {c |}{col 23}{res}{space 2} .0755345{col 35}{space 2} .0405089{col 46}{space 1}    1.86{col 55}{space 3}0.063{col 63}{space 4}-.0042386{col 76}{space 3} .1553077
{txt}{space 8}religiosity_r {c |}{col 23}{res}{space 2}  .103241{col 35}{space 2} .0435528{col 46}{space 1}    2.37{col 55}{space 3}0.019{col 63}{space 4} .0174736{col 76}{space 3} .1890084
{txt}{space 15}RUDE_r {c |}{col 23}{res}{space 2} -.024147{col 35}{space 2} .0393551{col 46}{space 1}   -0.61{col 55}{space 3}0.540{col 63}{space 4} -.101648{col 76}{space 3}  .053354
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} .9220426{col 35}{space 2} .2570169{col 46}{space 1}    3.59{col 55}{space 3}0.000{col 63}{space 4}  .415906{col 76}{space 3} 1.428179
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est1:est1}}{col 14}{c |}{res}{col 16}       514{col 28}-365.0541{col 39}-203.8558{col 50}    50{col 58} 507.7117{col 69} 719.8229
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M1
{txt}
{com}. 
. *
. 
. eststo: reg DV_1 middleclass##treatment upperclass i.ideol_2 i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r if DV_93_1!=. & DV_96_1!=. & DV_99_1!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=., vce(cluster id) 

{txt}Linear regression                               Number of obs     = {res}       771
                                                {txt}F(49, 256)        =  {res}    25.31
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.4586
                                                {txt}Root MSE          =    {res} .37401

{txt}{ralign 87:(Std. err. adjusted for {res:257} clusters in {res:id})}
{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}                 DV_1{col 23}{c |} Coefficient{col 35}  std. err.{col 47}      t{col 55}   P>|t|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}1.middleclass {c |}{col 23}{res}{space 2} .1035827{col 35}{space 2} .0616506{col 46}{space 1}    1.68{col 55}{space 3}0.094{col 63}{space 4}-.0178243{col 76}{space 3} .2249896
{txt}{space 10}1.treatment {c |}{col 23}{res}{space 2}-.0394602{col 35}{space 2}  .031944{col 46}{space 1}   -1.24{col 55}{space 3}0.218{col 63}{space 4}-.1023667{col 76}{space 3} .0234464
{txt}{space 21} {c |}
middleclass#treatment {c |}
{space 17}1 1  {c |}{col 23}{res}{space 2} -.107199{col 35}{space 2} .0596993{col 46}{space 1}   -1.80{col 55}{space 3}0.074{col 63}{space 4}-.2247632{col 76}{space 3} .0103653
{txt}{space 21} {c |}
{space 11}upperclass {c |}{col 23}{res}{space 2} .1676136{col 35}{space 2} .0480332{col 46}{space 1}    3.49{col 55}{space 3}0.001{col 63}{space 4} .0730231{col 76}{space 3} .2622041
{txt}{space 21} {c |}
{space 14}ideol_2 {c |}
{space 19}3  {c |}{col 23}{res}{space 2}-.0389713{col 35}{space 2} .0541533{col 46}{space 1}   -0.72{col 55}{space 3}0.472{col 63}{space 4} -.145614{col 76}{space 3} .0676714
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .1583229{col 35}{space 2} .0596154{col 46}{space 1}    2.66{col 55}{space 3}0.008{col 63}{space 4} .0409238{col 76}{space 3} .2757219
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .4215121{col 35}{space 2} .0749612{col 46}{space 1}    5.62{col 55}{space 3}0.000{col 63}{space 4}  .273893{col 76}{space 3} .5691312
{txt}{space 19}6  {c |}{col 23}{res}{space 2} .4965295{col 35}{space 2} .0802246{col 46}{space 1}    6.19{col 55}{space 3}0.000{col 63}{space 4} .3385452{col 76}{space 3} .6545138
{txt}{space 21} {c |}
{space 18}day {c |}
{space 19}2  {c |}{col 23}{res}{space 2}-.1897278{col 35}{space 2} .1500892{col 46}{space 1}   -1.26{col 55}{space 3}0.207{col 63}{space 4}-.4852944{col 76}{space 3} .1058389
{txt}{space 19}3  {c |}{col 23}{res}{space 2}-.3971178{col 35}{space 2} .1481511{col 46}{space 1}   -2.68{col 55}{space 3}0.008{col 63}{space 4}-.6888678{col 76}{space 3}-.1053677
{txt}{space 19}4  {c |}{col 23}{res}{space 2}-.0605028{col 35}{space 2} .1104096{col 46}{space 1}   -0.55{col 55}{space 3}0.584{col 63}{space 4}-.2779296{col 76}{space 3}  .156924
{txt}{space 19}5  {c |}{col 23}{res}{space 2}-.1416762{col 35}{space 2} .1158513{col 46}{space 1}   -1.22{col 55}{space 3}0.222{col 63}{space 4}-.3698192{col 76}{space 3} .0864668
{txt}{space 19}6  {c |}{col 23}{res}{space 2}-.0881104{col 35}{space 2} .0913083{col 46}{space 1}   -0.96{col 55}{space 3}0.335{col 63}{space 4}-.2679215{col 76}{space 3} .0917008
{txt}{space 19}7  {c |}{col 23}{res}{space 2}-.1144591{col 35}{space 2} .0954296{col 46}{space 1}   -1.20{col 55}{space 3}0.231{col 63}{space 4} -.302386{col 76}{space 3} .0734679
{txt}{space 19}8  {c |}{col 23}{res}{space 2}-.1482147{col 35}{space 2} .0899389{col 46}{space 1}   -1.65{col 55}{space 3}0.101{col 63}{space 4} -.325329{col 76}{space 3} .0288996
{txt}{space 19}9  {c |}{col 23}{res}{space 2}-.0521557{col 35}{space 2} .1281849{col 46}{space 1}   -0.41{col 55}{space 3}0.684{col 63}{space 4}-.3045869{col 76}{space 3} .2002754
{txt}{space 18}10  {c |}{col 23}{res}{space 2}-.1396315{col 35}{space 2} .0968704{col 46}{space 1}   -1.44{col 55}{space 3}0.151{col 63}{space 4} -.330396{col 76}{space 3} .0511329
{txt}{space 18}11  {c |}{col 23}{res}{space 2}-.1735213{col 35}{space 2} .0995749{col 46}{space 1}   -1.74{col 55}{space 3}0.083{col 63}{space 4}-.3696116{col 76}{space 3} .0225689
{txt}{space 18}12  {c |}{col 23}{res}{space 2}  .127304{col 35}{space 2} .1471935{col 46}{space 1}    0.86{col 55}{space 3}0.388{col 63}{space 4}-.1625604{col 76}{space 3} .4171684
{txt}{space 18}13  {c |}{col 23}{res}{space 2}-.2460517{col 35}{space 2} .1150291{col 46}{space 1}   -2.14{col 55}{space 3}0.033{col 63}{space 4}-.4725754{col 76}{space 3} -.019528
{txt}{space 18}14  {c |}{col 23}{res}{space 2}-.2053849{col 35}{space 2} .0927378{col 46}{space 1}   -2.21{col 55}{space 3}0.028{col 63}{space 4} -.388011{col 76}{space 3}-.0227587
{txt}{space 18}15  {c |}{col 23}{res}{space 2}-.1031074{col 35}{space 2} .0948316{col 46}{space 1}   -1.09{col 55}{space 3}0.278{col 63}{space 4}-.2898568{col 76}{space 3}  .083642
{txt}{space 18}16  {c |}{col 23}{res}{space 2}-.1444789{col 35}{space 2} .0907417{col 46}{space 1}   -1.59{col 55}{space 3}0.113{col 63}{space 4}-.3231741{col 76}{space 3} .0342163
{txt}{space 18}17  {c |}{col 23}{res}{space 2}-.1707774{col 35}{space 2} .1007184{col 46}{space 1}   -1.70{col 55}{space 3}0.091{col 63}{space 4}-.3691196{col 76}{space 3} .0275647
{txt}{space 18}18  {c |}{col 23}{res}{space 2}-.2477729{col 35}{space 2} .1066272{col 46}{space 1}   -2.32{col 55}{space 3}0.021{col 63}{space 4} -.457751{col 76}{space 3}-.0377947
{txt}{space 18}19  {c |}{col 23}{res}{space 2}-.1453305{col 35}{space 2} .1329291{col 46}{space 1}   -1.09{col 55}{space 3}0.275{col 63}{space 4}-.4071044{col 76}{space 3} .1164433
{txt}{space 18}21  {c |}{col 23}{res}{space 2}-.1300076{col 35}{space 2} .0917227{col 46}{space 1}   -1.42{col 55}{space 3}0.158{col 63}{space 4}-.3106348{col 76}{space 3} .0506196
{txt}{space 18}22  {c |}{col 23}{res}{space 2}-.1316852{col 35}{space 2} .0997625{col 46}{space 1}   -1.32{col 55}{space 3}0.188{col 63}{space 4}-.3281449{col 76}{space 3} .0647744
{txt}{space 18}23  {c |}{col 23}{res}{space 2}-.0945331{col 35}{space 2} .0936456{col 46}{space 1}   -1.01{col 55}{space 3}0.314{col 63}{space 4}-.2789469{col 76}{space 3} .0898807
{txt}{space 18}24  {c |}{col 23}{res}{space 2}-.1800535{col 35}{space 2} .1082675{col 46}{space 1}   -1.66{col 55}{space 3}0.098{col 63}{space 4}-.3932618{col 76}{space 3} .0331548
{txt}{space 18}25  {c |}{col 23}{res}{space 2}-.0942114{col 35}{space 2}  .102108{col 46}{space 1}   -0.92{col 55}{space 3}0.357{col 63}{space 4}  -.29529{col 76}{space 3} .1068672
{txt}{space 18}26  {c |}{col 23}{res}{space 2} .1043818{col 35}{space 2} .1857396{col 46}{space 1}    0.56{col 55}{space 3}0.575{col 63}{space 4}-.2613902{col 76}{space 3} .4701539
{txt}{space 18}28  {c |}{col 23}{res}{space 2}-.0599687{col 35}{space 2} .1266154{col 46}{space 1}   -0.47{col 55}{space 3}0.636{col 63}{space 4} -.309309{col 76}{space 3} .1893717
{txt}{space 18}29  {c |}{col 23}{res}{space 2}-.0940148{col 35}{space 2} .1070764{col 46}{space 1}   -0.88{col 55}{space 3}0.381{col 63}{space 4}-.3048776{col 76}{space 3} .1168479
{txt}{space 18}30  {c |}{col 23}{res}{space 2} -.261479{col 35}{space 2} .1567782{col 46}{space 1}   -1.67{col 55}{space 3}0.097{col 63}{space 4}-.5702183{col 76}{space 3} .0472602
{txt}{space 18}31  {c |}{col 23}{res}{space 2}-.1576902{col 35}{space 2} .1067106{col 46}{space 1}   -1.48{col 55}{space 3}0.141{col 63}{space 4}-.3678326{col 76}{space 3} .0524521
{txt}{space 21} {c |}
{space 18}sal {c |}
{space 19}2  {c |}{col 23}{res}{space 2}-.1798084{col 35}{space 2} .1600099{col 46}{space 1}   -1.12{col 55}{space 3}0.262{col 63}{space 4}-.4949117{col 76}{space 3} .1352948
{txt}{space 19}3  {c |}{col 23}{res}{space 2}-.1861027{col 35}{space 2} .1598961{col 46}{space 1}   -1.16{col 55}{space 3}0.246{col 63}{space 4}-.5009819{col 76}{space 3} .1287765
{txt}{space 19}4  {c |}{col 23}{res}{space 2}-.1306588{col 35}{space 2} .1592686{col 46}{space 1}   -0.82{col 55}{space 3}0.413{col 63}{space 4}-.4443023{col 76}{space 3} .1829848
{txt}{space 19}5  {c |}{col 23}{res}{space 2} -.161603{col 35}{space 2} .1606864{col 46}{space 1}   -1.01{col 55}{space 3}0.316{col 63}{space 4}-.4780385{col 76}{space 3} .1548326
{txt}{space 21} {c |}
{space 16}pos_2 {c |}
{space 19}2  {c |}{col 23}{res}{space 2}-.0848532{col 35}{space 2} .0713299{col 46}{space 1}   -1.19{col 55}{space 3}0.235{col 63}{space 4}-.2253213{col 76}{space 3}  .055615
{txt}{space 19}3  {c |}{col 23}{res}{space 2}-.0621959{col 35}{space 2} .0667156{col 46}{space 1}   -0.93{col 55}{space 3}0.352{col 63}{space 4}-.1935771{col 76}{space 3} .0691854
{txt}{space 19}4  {c |}{col 23}{res}{space 2}-.3329135{col 35}{space 2} .0688708{col 46}{space 1}   -4.83{col 55}{space 3}0.000{col 63}{space 4} -.468539{col 76}{space 3}-.1972881
{txt}{space 19}5  {c |}{col 23}{res}{space 2}-.3683239{col 35}{space 2} .0676198{col 46}{space 1}   -5.45{col 55}{space 3}0.000{col 63}{space 4}-.5014859{col 76}{space 3}-.2351619
{txt}{space 19}6  {c |}{col 23}{res}{space 2}-.4335677{col 35}{space 2} .0734168{col 46}{space 1}   -5.91{col 55}{space 3}0.000{col 63}{space 4}-.5781456{col 76}{space 3}-.2889899
{txt}{space 19}7  {c |}{col 23}{res}{space 2}-.5385215{col 35}{space 2} .0760771{col 46}{space 1}   -7.08{col 55}{space 3}0.000{col 63}{space 4}-.6883381{col 76}{space 3} -.388705
{txt}{space 21} {c |}
{space 13}envrsp_r {c |}{col 23}{res}{space 2} .0763122{col 35}{space 2}  .039905{col 46}{space 1}    1.91{col 55}{space 3}0.057{col 63}{space 4}-.0022718{col 76}{space 3} .1548961
{txt}{space 8}religiosity_r {c |}{col 23}{res}{space 2} .1124348{col 35}{space 2} .0416679{col 46}{space 1}    2.70{col 55}{space 3}0.007{col 63}{space 4} .0303792{col 76}{space 3} .1944903
{txt}{space 15}RUDE_r {c |}{col 23}{res}{space 2}-.0210059{col 35}{space 2}  .038766{col 46}{space 1}   -0.54{col 55}{space 3}0.588{col 63}{space 4}-.0973467{col 76}{space 3} .0553349
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}  .771882{col 35}{space 2} .1949553{col 46}{space 1}    3.96{col 55}{space 3}0.000{col 63}{space 4} .3879616{col 76}{space 3} 1.155802
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est2{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est2:est2}}{col 14}{c |}{res}{col 16}       771{col 28}-546.4716{col 39}-309.8947{col 50}    50{col 58} 719.7895{col 69} 952.1739
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M2
{txt}
{com}. 
. *
. 
. eststo: reg DV_1 i.middleclass i.treatment_96 i.treatment_99 middle_96 middle_99 upperclass i.ideol_2 i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r if DV_93_1!=. & DV_96_1!=. & DV_99_1!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=., vce(cluster id) 

{txt}Linear regression                               Number of obs     = {res}       771
                                                {txt}F(51, 256)        =  {res}    24.33
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.4590
                                                {txt}Root MSE          =    {res} .37441

{txt}{ralign 80:(Std. err. adjusted for {res:257} clusters in {res:id})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}          DV_1{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}1.middleclass {c |}{col 16}{res}{space 2} .1028543{col 28}{space 2} .0617969{col 39}{space 1}    1.66{col 48}{space 3}0.097{col 56}{space 4}-.0188406{col 69}{space 3} .2245493
{txt}1.treatment_96 {c |}{col 16}{res}{space 2}-.0253736{col 28}{space 2} .0363777{col 39}{space 1}   -0.70{col 48}{space 3}0.486{col 56}{space 4}-.0970113{col 69}{space 3}  .046264
{txt}1.treatment_99 {c |}{col 16}{res}{space 2}-.0551387{col 28}{space 2} .0352743{col 39}{space 1}   -1.56{col 48}{space 3}0.119{col 56}{space 4}-.1246034{col 69}{space 3}  .014326
{txt}{space 5}middle_96 {c |}{col 16}{res}{space 2}-.1226576{col 28}{space 2} .0608449{col 39}{space 1}   -2.02{col 48}{space 3}0.045{col 56}{space 4}-.2424779{col 69}{space 3}-.0028374
{txt}{space 5}middle_99 {c |}{col 16}{res}{space 2}-.0906783{col 28}{space 2} .0694954{col 39}{space 1}   -1.30{col 48}{space 3}0.193{col 56}{space 4}-.2275338{col 69}{space 3} .0461772
{txt}{space 4}upperclass {c |}{col 16}{res}{space 2} .1666542{col 28}{space 2} .0482136{col 39}{space 1}    3.46{col 48}{space 3}0.001{col 56}{space 4} .0717083{col 69}{space 3} .2616001
{txt}{space 14} {c |}
{space 7}ideol_2 {c |}
{space 12}3  {c |}{col 16}{res}{space 2}-.0382331{col 28}{space 2} .0541644{col 39}{space 1}   -0.71{col 48}{space 3}0.481{col 56}{space 4}-.1448976{col 69}{space 3} .0684313
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .1580374{col 28}{space 2} .0596807{col 39}{space 1}    2.65{col 48}{space 3}0.009{col 56}{space 4} .0405097{col 69}{space 3}  .275565
{txt}{space 12}5  {c |}{col 16}{res}{space 2} .4214893{col 28}{space 2} .0749683{col 39}{space 1}    5.62{col 48}{space 3}0.000{col 56}{space 4} .2738562{col 69}{space 3} .5691224
{txt}{space 12}6  {c |}{col 16}{res}{space 2} .4958681{col 28}{space 2} .0803766{col 39}{space 1}    6.17{col 48}{space 3}0.000{col 56}{space 4} .3375847{col 69}{space 3} .6541516
{txt}{space 14} {c |}
{space 11}day {c |}
{space 12}2  {c |}{col 16}{res}{space 2}-.1811248{col 28}{space 2} .1529223{col 39}{space 1}   -1.18{col 48}{space 3}0.237{col 56}{space 4}-.4822707{col 69}{space 3} .1200211
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.3913975{col 28}{space 2} .1498038{col 39}{space 1}   -2.61{col 48}{space 3}0.010{col 56}{space 4}-.6864023{col 69}{space 3}-.0963927
{txt}{space 12}4  {c |}{col 16}{res}{space 2}-.0681514{col 28}{space 2} .1116385{col 39}{space 1}   -0.61{col 48}{space 3}0.542{col 56}{space 4}-.2879981{col 69}{space 3} .1516954
{txt}{space 12}5  {c |}{col 16}{res}{space 2}-.1452732{col 28}{space 2} .1168156{col 39}{space 1}   -1.24{col 48}{space 3}0.215{col 56}{space 4} -.375315{col 69}{space 3} .0847686
{txt}{space 12}6  {c |}{col 16}{res}{space 2} -.081212{col 28}{space 2} .0919813{col 39}{space 1}   -0.88{col 48}{space 3}0.378{col 56}{space 4}-.2623485{col 69}{space 3} .0999244
{txt}{space 12}7  {c |}{col 16}{res}{space 2}-.1035251{col 28}{space 2} .0985925{col 39}{space 1}   -1.05{col 48}{space 3}0.295{col 56}{space 4}-.2976808{col 69}{space 3} .0906305
{txt}{space 12}8  {c |}{col 16}{res}{space 2}-.1371219{col 28}{space 2} .0938983{col 39}{space 1}   -1.46{col 48}{space 3}0.145{col 56}{space 4}-.3220333{col 69}{space 3} .0477896
{txt}{space 12}9  {c |}{col 16}{res}{space 2}-.0390271{col 28}{space 2}  .132293{col 39}{space 1}   -0.30{col 48}{space 3}0.768{col 56}{space 4}-.2995483{col 69}{space 3} .2214941
{txt}{space 11}10  {c |}{col 16}{res}{space 2}-.1264884{col 28}{space 2} .0991474{col 39}{space 1}   -1.28{col 48}{space 3}0.203{col 56}{space 4}-.3217369{col 69}{space 3} .0687601
{txt}{space 11}11  {c |}{col 16}{res}{space 2}-.1725304{col 28}{space 2}  .099236{col 39}{space 1}   -1.74{col 48}{space 3}0.083{col 56}{space 4}-.3679532{col 69}{space 3} .0228924
{txt}{space 11}12  {c |}{col 16}{res}{space 2} .1223221{col 28}{space 2} .1468618{col 39}{space 1}    0.83{col 48}{space 3}0.406{col 56}{space 4}-.1668889{col 69}{space 3} .4115332
{txt}{space 11}13  {c |}{col 16}{res}{space 2}-.2415826{col 28}{space 2} .1146181{col 39}{space 1}   -2.11{col 48}{space 3}0.036{col 56}{space 4}-.4672971{col 69}{space 3}-.0158681
{txt}{space 11}14  {c |}{col 16}{res}{space 2}-.2010198{col 28}{space 2} .0933232{col 39}{space 1}   -2.15{col 48}{space 3}0.032{col 56}{space 4}-.3847987{col 69}{space 3}-.0172408
{txt}{space 11}15  {c |}{col 16}{res}{space 2}-.0975118{col 28}{space 2} .0948214{col 39}{space 1}   -1.03{col 48}{space 3}0.305{col 56}{space 4}-.2842411{col 69}{space 3} .0892176
{txt}{space 11}16  {c |}{col 16}{res}{space 2}-.1407187{col 28}{space 2}   .09092{col 39}{space 1}   -1.55{col 48}{space 3}0.123{col 56}{space 4}-.3197651{col 69}{space 3} .0383276
{txt}{space 11}17  {c |}{col 16}{res}{space 2}-.1646655{col 28}{space 2} .1010131{col 39}{space 1}   -1.63{col 48}{space 3}0.104{col 56}{space 4}-.3635879{col 69}{space 3}  .034257
{txt}{space 11}18  {c |}{col 16}{res}{space 2}-.2459899{col 28}{space 2} .1066094{col 39}{space 1}   -2.31{col 48}{space 3}0.022{col 56}{space 4} -.455933{col 69}{space 3}-.0360468
{txt}{space 11}19  {c |}{col 16}{res}{space 2}-.1427782{col 28}{space 2} .1322636{col 39}{space 1}   -1.08{col 48}{space 3}0.281{col 56}{space 4}-.4032415{col 69}{space 3}  .117685
{txt}{space 11}21  {c |}{col 16}{res}{space 2}-.1240116{col 28}{space 2} .0932933{col 39}{space 1}   -1.33{col 48}{space 3}0.185{col 56}{space 4}-.3077316{col 69}{space 3} .0597085
{txt}{space 11}22  {c |}{col 16}{res}{space 2}-.1305258{col 28}{space 2} .1000334{col 39}{space 1}   -1.30{col 48}{space 3}0.193{col 56}{space 4} -.327519{col 69}{space 3} .0664674
{txt}{space 11}23  {c |}{col 16}{res}{space 2}-.0933946{col 28}{space 2} .0936559{col 39}{space 1}   -1.00{col 48}{space 3}0.320{col 56}{space 4}-.2778287{col 69}{space 3} .0910395
{txt}{space 11}24  {c |}{col 16}{res}{space 2}-.1758718{col 28}{space 2} .1080985{col 39}{space 1}   -1.63{col 48}{space 3}0.105{col 56}{space 4}-.3887473{col 69}{space 3} .0370037
{txt}{space 11}25  {c |}{col 16}{res}{space 2} -.096417{col 28}{space 2} .1023337{col 39}{space 1}   -0.94{col 48}{space 3}0.347{col 56}{space 4}-.2979401{col 69}{space 3} .1051061
{txt}{space 11}26  {c |}{col 16}{res}{space 2} .1168297{col 28}{space 2} .1870741{col 39}{space 1}    0.62{col 48}{space 3}0.533{col 56}{space 4}-.2515706{col 69}{space 3} .4852299
{txt}{space 11}28  {c |}{col 16}{res}{space 2}-.0599736{col 28}{space 2} .1299288{col 39}{space 1}   -0.46{col 48}{space 3}0.645{col 56}{space 4}-.3158389{col 69}{space 3} .1958918
{txt}{space 11}29  {c |}{col 16}{res}{space 2}-.0953365{col 28}{space 2} .1071119{col 39}{space 1}   -0.89{col 48}{space 3}0.374{col 56}{space 4}-.3062693{col 69}{space 3} .1155962
{txt}{space 11}30  {c |}{col 16}{res}{space 2}-.2677936{col 28}{space 2} .1570118{col 39}{space 1}   -1.71{col 48}{space 3}0.089{col 56}{space 4}-.5769928{col 69}{space 3} .0414056
{txt}{space 11}31  {c |}{col 16}{res}{space 2}-.1654311{col 28}{space 2} .1071053{col 39}{space 1}   -1.54{col 48}{space 3}0.124{col 56}{space 4}-.3763508{col 69}{space 3} .0454885
{txt}{space 14} {c |}
{space 11}sal {c |}
{space 12}2  {c |}{col 16}{res}{space 2}-.1807996{col 28}{space 2} .1597705{col 39}{space 1}   -1.13{col 48}{space 3}0.259{col 56}{space 4}-.4954316{col 69}{space 3} .1338324
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.1873486{col 28}{space 2} .1597367{col 39}{space 1}   -1.17{col 48}{space 3}0.242{col 56}{space 4}-.5019139{col 69}{space 3} .1272166
{txt}{space 12}4  {c |}{col 16}{res}{space 2}-.1313806{col 28}{space 2} .1591648{col 39}{space 1}   -0.83{col 48}{space 3}0.410{col 56}{space 4}-.4448196{col 69}{space 3} .1820584
{txt}{space 12}5  {c |}{col 16}{res}{space 2}-.1626529{col 28}{space 2}  .160323{col 39}{space 1}   -1.01{col 48}{space 3}0.311{col 56}{space 4}-.4783728{col 69}{space 3} .1530669
{txt}{space 14} {c |}
{space 9}pos_2 {c |}
{space 12}2  {c |}{col 16}{res}{space 2}-.0857834{col 28}{space 2} .0717963{col 39}{space 1}   -1.19{col 48}{space 3}0.233{col 56}{space 4}  -.22717{col 69}{space 3} .0556031
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.0627707{col 28}{space 2} .0672177{col 39}{space 1}   -0.93{col 48}{space 3}0.351{col 56}{space 4}-.1951407{col 69}{space 3} .0695993
{txt}{space 12}4  {c |}{col 16}{res}{space 2}-.3337411{col 28}{space 2} .0693791{col 39}{space 1}   -4.81{col 48}{space 3}0.000{col 56}{space 4}-.4703677{col 69}{space 3}-.1971146
{txt}{space 12}5  {c |}{col 16}{res}{space 2}-.3698336{col 28}{space 2} .0680819{col 39}{space 1}   -5.43{col 48}{space 3}0.000{col 56}{space 4}-.5039054{col 69}{space 3}-.2357618
{txt}{space 12}6  {c |}{col 16}{res}{space 2}-.4381183{col 28}{space 2} .0742524{col 39}{space 1}   -5.90{col 48}{space 3}0.000{col 56}{space 4}-.5843416{col 69}{space 3}-.2918951
{txt}{space 12}7  {c |}{col 16}{res}{space 2} -.540159{col 28}{space 2}  .076565{col 39}{space 1}   -7.05{col 48}{space 3}0.000{col 56}{space 4}-.6909364{col 69}{space 3}-.3893816
{txt}{space 14} {c |}
{space 6}envrsp_r {c |}{col 16}{res}{space 2} .0761679{col 28}{space 2} .0399215{col 39}{space 1}    1.91{col 48}{space 3}0.058{col 56}{space 4}-.0024484{col 69}{space 3} .1547842
{txt}{space 1}religiosity_r {c |}{col 16}{res}{space 2} .1121132{col 28}{space 2} .0418288{col 39}{space 1}    2.68{col 48}{space 3}0.008{col 56}{space 4} .0297408{col 69}{space 3} .1944856
{txt}{space 8}RUDE_r {c |}{col 16}{res}{space 2}  -.02119{col 28}{space 2} .0388358{col 39}{space 1}   -0.55{col 48}{space 3}0.586{col 56}{space 4}-.0976683{col 69}{space 3} .0552883
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .7715651{col 28}{space 2} .1951231{col 39}{space 1}    3.95{col 48}{space 3}0.000{col 56}{space 4} .3873143{col 69}{space 3} 1.155816
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est3{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est3:est3}}{col 14}{c |}{res}{col 16}       771{col 28}-546.4716{col 39}-309.6515{col 50}    52{col 58} 723.3029{col 69} 964.9827
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M3
{txt}
{com}. 
. esttab using TableC3.rtf, ///
>         label title (OLS NZ) nonumbers mtitles ("M1" "M2" "M3") ///
>         starlevels(+ 0.1 * 0.05 ** 0.01 *** 0.001) ///
>         b(2) se(2) r2 ///  
>         varlabels(_cons Constant) replace
{txt}(tabulating estimates stored by eststo; specify "." to tabulate the active results)
{res}{txt}(output written to {browse  `"TableC3.rtf"'})

{com}. 
. ********************************************************************************
. 
. *We add ACT
. 
. gen DV_96_2=DV_96_1
{txt}(441 missing values generated)

{com}. replace DV_96_2=1 if pnvot96p==5
{txt}(162 real changes made)

{com}. 
. gen DV_99_2=DV_99_1
{txt}(501 missing values generated)

{com}. replace DV_99_2=1 if nvot99p==5
{txt}(138 real changes made)

{com}. 
. gen DV_2=DV_93_1 if id2==1
{txt}(1,594 missing values generated)

{com}. replace DV_2=DV_96_2 if id2==2
{txt}(668 real changes made)

{com}. replace DV_2=DV_99_2 if id2==3
{txt}(640 real changes made)

{com}. 
. eststo clear
{txt}
{com}. 
. eststo: logit DV_2 middleclass##treatment upperclass i.ideol_2 i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r if DV_93_1!=. & DV_96_2!=. & DV_99_2!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=. & id2<3, vce(cluster id) or

{res}{txt}Iteration 0:{space 2}Log pseudolikelihood = {res: -416.6232}  
Iteration 1:{space 2}Log pseudolikelihood = {res:-253.18689}  
Iteration 2:{space 2}Log pseudolikelihood = {res:-248.45371}  
Iteration 3:{space 2}Log pseudolikelihood = {res:-248.37235}  
Iteration 4:{space 2}Log pseudolikelihood = {res:-248.37234}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:602}
{txt}{col 57}{lalign 13:Wald chi2({res:49})}{col 70} = {res}{ralign 6:194.50}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-248.37234}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.4038}

{txt}{ralign 87:(Std. err. adjusted for {res:301} clusters in {res:id})}
{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}                 DV_2{col 23}{c |} Odds ratio{col 35}   std. err.{col 47}      z{col 55}   P>|z|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}1.middleclass {c |}{col 23}{res}{space 2} 2.458409{col 35}{space 2} .9980786{col 46}{space 1}    2.22{col 55}{space 3}0.027{col 63}{space 4} 1.109376{col 76}{space 3} 5.447907
{txt}{space 10}1.treatment {c |}{col 23}{res}{space 2} .9033126{col 35}{space 2} .2798337{col 46}{space 1}   -0.33{col 55}{space 3}0.743{col 63}{space 4} .4922069{col 76}{space 3} 1.657786
{txt}{space 21} {c |}
middleclass#treatment {c |}
{space 17}1 1  {c |}{col 23}{res}{space 2} .4748583{col 35}{space 2} .1878355{col 46}{space 1}   -1.88{col 55}{space 3}0.060{col 63}{space 4} .2187066{col 76}{space 3} 1.031018
{txt}{space 21} {c |}
{space 11}upperclass {c |}{col 23}{res}{space 2} 3.311059{col 35}{space 2} 1.189869{col 46}{space 1}    3.33{col 55}{space 3}0.001{col 63}{space 4} 1.637108{col 76}{space 3} 6.696633
{txt}{space 21} {c |}
{space 14}ideol_2 {c |}
{space 19}3  {c |}{col 23}{res}{space 2} 1.405641{col 35}{space 2} 1.156779{col 46}{space 1}    0.41{col 55}{space 3}0.679{col 63}{space 4} .2801393{col 76}{space 3} 7.053014
{txt}{space 19}4  {c |}{col 23}{res}{space 2} 6.967021{col 35}{space 2} 5.453707{col 46}{space 1}    2.48{col 55}{space 3}0.013{col 63}{space 4} 1.502228{col 76}{space 3} 32.31159
{txt}{space 19}5  {c |}{col 23}{res}{space 2}  24.5966{col 35}{space 2} 19.68559{col 46}{space 1}    4.00{col 55}{space 3}0.000{col 63}{space 4}   5.1242{col 76}{space 3} 118.0658
{txt}{space 19}6  {c |}{col 23}{res}{space 2} 69.24363{col 35}{space 2} 61.23107{col 46}{space 1}    4.79{col 55}{space 3}0.000{col 63}{space 4} 12.23702{col 76}{space 3} 391.8178
{txt}{space 21} {c |}
{space 18}day {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .1431114{col 35}{space 2} .2007422{col 46}{space 1}   -1.39{col 55}{space 3}0.166{col 63}{space 4} .0091558{col 76}{space 3} 2.236935
{txt}{space 19}3  {c |}{col 23}{res}{space 2} .0229613{col 35}{space 2} .0326526{col 46}{space 1}   -2.65{col 55}{space 3}0.008{col 63}{space 4} .0014142{col 76}{space 3} .3727919
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .3273741{col 35}{space 2} .2342527{col 46}{space 1}   -1.56{col 55}{space 3}0.119{col 63}{space 4} .0805317{col 76}{space 3} 1.330828
{txt}{space 19}5  {c |}{col 23}{res}{space 2}  .264377{col 35}{space 2} .2175531{col 46}{space 1}   -1.62{col 55}{space 3}0.106{col 63}{space 4} .0526962{col 76}{space 3} 1.326381
{txt}{space 19}6  {c |}{col 23}{res}{space 2} .6803311{col 35}{space 2} .4167366{col 46}{space 1}   -0.63{col 55}{space 3}0.529{col 63}{space 4}  .204794{col 76}{space 3} 2.260079
{txt}{space 19}7  {c |}{col 23}{res}{space 2} .2801981{col 35}{space 2} .2484711{col 46}{space 1}   -1.43{col 55}{space 3}0.151{col 63}{space 4} .0492772{col 76}{space 3} 1.593253
{txt}{space 19}8  {c |}{col 23}{res}{space 2} .2392321{col 35}{space 2} .1624336{col 46}{space 1}   -2.11{col 55}{space 3}0.035{col 63}{space 4} .0632225{col 76}{space 3} .9052478
{txt}{space 19}9  {c |}{col 23}{res}{space 2} .2020623{col 35}{space 2} .2452198{col 46}{space 1}   -1.32{col 55}{space 3}0.188{col 63}{space 4} .0187275{col 76}{space 3} 2.180174
{txt}{space 18}10  {c |}{col 23}{res}{space 2} .1009826{col 35}{space 2} .0885923{col 46}{space 1}   -2.61{col 55}{space 3}0.009{col 63}{space 4} .0180919{col 76}{space 3} .5636483
{txt}{space 18}11  {c |}{col 23}{res}{space 2} .2295644{col 35}{space 2} .1435493{col 46}{space 1}   -2.35{col 55}{space 3}0.019{col 63}{space 4} .0673967{col 76}{space 3} .7819351
{txt}{space 18}12  {c |}{col 23}{res}{space 2} 1.795554{col 35}{space 2} 1.821364{col 46}{space 1}    0.58{col 55}{space 3}0.564{col 63}{space 4} .2459017{col 76}{space 3} 13.11099
{txt}{space 18}13  {c |}{col 23}{res}{space 2}  .288422{col 35}{space 2}  .259888{col 46}{space 1}   -1.38{col 55}{space 3}0.168{col 63}{space 4} .0493216{col 76}{space 3} 1.686629
{txt}{space 18}14  {c |}{col 23}{res}{space 2}    .2321{col 35}{space 2} .2259826{col 46}{space 1}   -1.50{col 55}{space 3}0.134{col 63}{space 4} .0344277{col 76}{space 3} 1.564739
{txt}{space 18}15  {c |}{col 23}{res}{space 2} .2827155{col 35}{space 2}  .177023{col 46}{space 1}   -2.02{col 55}{space 3}0.044{col 63}{space 4} .0828643{col 76}{space 3} .9645652
{txt}{space 18}16  {c |}{col 23}{res}{space 2} .1716627{col 35}{space 2} .1042743{col 46}{space 1}   -2.90{col 55}{space 3}0.004{col 63}{space 4} .0521944{col 76}{space 3} .5645825
{txt}{space 18}17  {c |}{col 23}{res}{space 2} .2991945{col 35}{space 2} .2056181{col 46}{space 1}   -1.76{col 55}{space 3}0.079{col 63}{space 4} .0777991{col 76}{space 3} 1.150621
{txt}{space 18}18  {c |}{col 23}{res}{space 2} .0880658{col 35}{space 2} .0624817{col 46}{space 1}   -3.42{col 55}{space 3}0.001{col 63}{space 4} .0219225{col 76}{space 3} .3537737
{txt}{space 18}19  {c |}{col 23}{res}{space 2}  .110994{col 35}{space 2} .1320818{col 46}{space 1}   -1.85{col 55}{space 3}0.065{col 63}{space 4}  .010774{col 76}{space 3}  1.14346
{txt}{space 18}21  {c |}{col 23}{res}{space 2}  .475021{col 35}{space 2} .3146061{col 46}{space 1}   -1.12{col 55}{space 3}0.261{col 63}{space 4} .1297068{col 76}{space 3} 1.739655
{txt}{space 18}22  {c |}{col 23}{res}{space 2} .2276632{col 35}{space 2} .1463595{col 46}{space 1}   -2.30{col 55}{space 3}0.021{col 63}{space 4} .0645765{col 76}{space 3} .8026222
{txt}{space 18}23  {c |}{col 23}{res}{space 2} .4008655{col 35}{space 2} .2640153{col 46}{space 1}   -1.39{col 55}{space 3}0.165{col 63}{space 4} .1102519{col 76}{space 3} 1.457509
{txt}{space 18}24  {c |}{col 23}{res}{space 2} .2227019{col 35}{space 2} .1989653{col 46}{space 1}   -1.68{col 55}{space 3}0.093{col 63}{space 4} .0386587{col 76}{space 3} 1.282923
{txt}{space 18}25  {c |}{col 23}{res}{space 2} .3794404{col 35}{space 2} .2652905{col 46}{space 1}   -1.39{col 55}{space 3}0.166{col 63}{space 4} .0963863{col 76}{space 3} 1.493729
{txt}{space 18}26  {c |}{col 23}{res}{space 2} 1.391923{col 35}{space 2} 2.564186{col 46}{space 1}    0.18{col 55}{space 3}0.858{col 63}{space 4} .0376306{col 76}{space 3} 51.48609
{txt}{space 18}28  {c |}{col 23}{res}{space 2} .8891765{col 35}{space 2} 1.333313{col 46}{space 1}   -0.08{col 55}{space 3}0.938{col 63}{space 4} .0470564{col 76}{space 3} 16.80187
{txt}{space 18}29  {c |}{col 23}{res}{space 2} .3595859{col 35}{space 2}  .249512{col 46}{space 1}   -1.47{col 55}{space 3}0.140{col 63}{space 4} .0922922{col 76}{space 3} 1.401007
{txt}{space 18}30  {c |}{col 23}{res}{space 2} .1628436{col 35}{space 2} .1539513{col 46}{space 1}   -1.92{col 55}{space 3}0.055{col 63}{space 4}   .02553{col 76}{space 3} 1.038702
{txt}{space 18}31  {c |}{col 23}{res}{space 2} .3638943{col 35}{space 2} .2444863{col 46}{space 1}   -1.50{col 55}{space 3}0.132{col 63}{space 4} .0975183{col 76}{space 3} 1.357889
{txt}{space 21} {c |}
{space 18}sal {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .3623336{col 35}{space 2} .3717121{col 46}{space 1}   -0.99{col 55}{space 3}0.322{col 63}{space 4} .0485149{col 76}{space 3} 2.706091
{txt}{space 19}3  {c |}{col 23}{res}{space 2} .2787919{col 35}{space 2} .2827921{col 46}{space 1}   -1.26{col 55}{space 3}0.208{col 63}{space 4} .0381826{col 76}{space 3} 2.035612
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .3574719{col 35}{space 2} .3568313{col 46}{space 1}   -1.03{col 55}{space 3}0.303{col 63}{space 4} .0505319{col 76}{space 3}  2.52882
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .2956542{col 35}{space 2} .3005127{col 46}{space 1}   -1.20{col 55}{space 3}0.231{col 63}{space 4} .0403269{col 76}{space 3} 2.167571
{txt}{space 21} {c |}
{space 16}pos_2 {c |}
{space 19}2  {c |}{col 23}{res}{space 2}   .16577{col 35}{space 2} .2267642{col 46}{space 1}   -1.31{col 55}{space 3}0.189{col 63}{space 4}  .011353{col 76}{space 3} 2.420488
{txt}{space 19}3  {c |}{col 23}{res}{space 2} .2315356{col 35}{space 2} .3086434{col 46}{space 1}   -1.10{col 55}{space 3}0.272{col 63}{space 4} .0169802{col 76}{space 3} 3.157135
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .0701381{col 35}{space 2}  .092326{col 46}{space 1}   -2.02{col 55}{space 3}0.044{col 63}{space 4} .0053147{col 76}{space 3} .9256125
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .0591941{col 35}{space 2} .0757548{col 46}{space 1}   -2.21{col 55}{space 3}0.027{col 63}{space 4} .0048188{col 76}{space 3} .7271424
{txt}{space 19}6  {c |}{col 23}{res}{space 2} .0362569{col 35}{space 2} .0478508{col 46}{space 1}   -2.51{col 55}{space 3}0.012{col 63}{space 4}  .002729{col 76}{space 3} .4817073
{txt}{space 19}7  {c |}{col 23}{res}{space 2} .0095665{col 35}{space 2}  .013326{col 46}{space 1}   -3.34{col 55}{space 3}0.001{col 63}{space 4} .0006238{col 76}{space 3} .1467115
{txt}{space 21} {c |}
{space 13}envrsp_r {c |}{col 23}{res}{space 2} 2.053857{col 35}{space 2} .6171023{col 46}{space 1}    2.40{col 55}{space 3}0.017{col 63}{space 4} 1.139772{col 76}{space 3} 3.701028
{txt}{space 8}religiosity_r {c |}{col 23}{res}{space 2} 1.563271{col 35}{space 2} .4446296{col 46}{space 1}    1.57{col 55}{space 3}0.116{col 63}{space 4} .8952273{col 76}{space 3} 2.729827
{txt}{space 15}RUDE_r {c |}{col 23}{res}{space 2} .6844738{col 35}{space 2} .1930587{col 46}{space 1}   -1.34{col 55}{space 3}0.179{col 63}{space 4} .3937965{col 76}{space 3} 1.189712
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 9.325686{col 35}{space 2} 16.74988{col 46}{space 1}    1.24{col 55}{space 3}0.214{col 63}{space 4} .2759535{col 76}{space 3} 315.1561
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}
({res}est1{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est1:est1}}{col 14}{c |}{res}{col 16}       602{col 28}-416.6232{col 39}-248.3723{col 50}    50{col 58} 596.7447{col 69} 816.7575
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M1
{txt}
{com}. 
. *
. 
. eststo: logit DV_2 middleclass##treatment upperclass i.ideol_2 i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r if DV_93_1!=. & DV_96_2!=. & DV_99_2!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=., vce(cluster id) or

{res}{txt}Iteration 0:{space 2}Log pseudolikelihood = {res:-624.79018}  
Iteration 1:{space 2}Log pseudolikelihood = {res:-374.54642}  
Iteration 2:{space 2}Log pseudolikelihood = {res:-368.50941}  
Iteration 3:{space 2}Log pseudolikelihood = {res:-368.27663}  
Iteration 4:{space 2}Log pseudolikelihood = {res:-368.27633}  
Iteration 5:{space 2}Log pseudolikelihood = {res:-368.27633}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:903}
{txt}{col 57}{lalign 13:Wald chi2({res:49})}{col 70} = {res}{ralign 6:271.72}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-368.27633}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.4106}

{txt}{ralign 87:(Std. err. adjusted for {res:301} clusters in {res:id})}
{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}                 DV_2{col 23}{c |} Odds ratio{col 35}   std. err.{col 47}      z{col 55}   P>|z|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}1.middleclass {c |}{col 23}{res}{space 2} 2.465876{col 35}{space 2} 1.014439{col 46}{space 1}    2.19{col 55}{space 3}0.028{col 63}{space 4} 1.101019{col 76}{space 3} 5.522652
{txt}{space 10}1.treatment {c |}{col 23}{res}{space 2} 1.035279{col 35}{space 2} .2353286{col 46}{space 1}    0.15{col 55}{space 3}0.879{col 63}{space 4} .6630882{col 76}{space 3}  1.61638
{txt}{space 21} {c |}
middleclass#treatment {c |}
{space 17}1 1  {c |}{col 23}{res}{space 2} .5070287{col 35}{space 2} .1899132{col 46}{space 1}   -1.81{col 55}{space 3}0.070{col 63}{space 4} .2433355{col 76}{space 3} 1.056476
{txt}{space 21} {c |}
{space 11}upperclass {c |}{col 23}{res}{space 2} 3.054524{col 35}{space 2} 1.007582{col 46}{space 1}    3.39{col 55}{space 3}0.001{col 63}{space 4} 1.600154{col 76}{space 3} 5.830763
{txt}{space 21} {c |}
{space 14}ideol_2 {c |}
{space 19}3  {c |}{col 23}{res}{space 2} 1.022848{col 35}{space 2} .8187474{col 46}{space 1}    0.03{col 55}{space 3}0.977{col 63}{space 4}  .213039{col 76}{space 3} 4.910919
{txt}{space 19}4  {c |}{col 23}{res}{space 2} 6.077954{col 35}{space 2} 4.631797{col 46}{space 1}    2.37{col 55}{space 3}0.018{col 63}{space 4} 1.364854{col 76}{space 3} 27.06627
{txt}{space 19}5  {c |}{col 23}{res}{space 2} 20.15635{col 35}{space 2} 15.74887{col 46}{space 1}    3.84{col 55}{space 3}0.000{col 63}{space 4} 4.358507{col 76}{space 3} 93.21503
{txt}{space 19}6  {c |}{col 23}{res}{space 2} 46.35683{col 35}{space 2} 39.08856{col 46}{space 1}    4.55{col 55}{space 3}0.000{col 63}{space 4}  8.87916{col 76}{space 3} 242.0225
{txt}{space 21} {c |}
{space 18}day {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .4223648{col 35}{space 2} .3683282{col 46}{space 1}   -0.99{col 55}{space 3}0.323{col 63}{space 4} .0764517{col 76}{space 3} 2.333394
{txt}{space 19}3  {c |}{col 23}{res}{space 2} .0922434{col 35}{space 2} .0727991{col 46}{space 1}   -3.02{col 55}{space 3}0.003{col 63}{space 4} .0196409{col 76}{space 3} .4332202
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .5127353{col 35}{space 2} .3604307{col 46}{space 1}   -0.95{col 55}{space 3}0.342{col 63}{space 4} .1292812{col 76}{space 3} 2.033532
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .3466406{col 35}{space 2} .2566407{col 46}{space 1}   -1.43{col 55}{space 3}0.152{col 63}{space 4}  .081223{col 76}{space 3}  1.47938
{txt}{space 19}6  {c |}{col 23}{res}{space 2}  .439009{col 35}{space 2} .2374675{col 46}{space 1}   -1.52{col 55}{space 3}0.128{col 63}{space 4} .1520701{col 76}{space 3} 1.267368
{txt}{space 19}7  {c |}{col 23}{res}{space 2} .4089588{col 35}{space 2} .2565095{col 46}{space 1}   -1.43{col 55}{space 3}0.154{col 63}{space 4} .1196145{col 76}{space 3} 1.398219
{txt}{space 19}8  {c |}{col 23}{res}{space 2} .3576362{col 35}{space 2}  .201811{col 46}{space 1}   -1.82{col 55}{space 3}0.068{col 63}{space 4} .1183357{col 76}{space 3} 1.080854
{txt}{space 19}9  {c |}{col 23}{res}{space 2} .6711711{col 35}{space 2} .5094706{col 46}{space 1}   -0.53{col 55}{space 3}0.599{col 63}{space 4} .1516023{col 76}{space 3} 2.971398
{txt}{space 18}10  {c |}{col 23}{res}{space 2} .3312197{col 35}{space 2} .2110147{col 46}{space 1}   -1.73{col 55}{space 3}0.083{col 63}{space 4} .0950232{col 76}{space 3} 1.154524
{txt}{space 18}11  {c |}{col 23}{res}{space 2} .3474588{col 35}{space 2} .2301448{col 46}{space 1}   -1.60{col 55}{space 3}0.110{col 63}{space 4} .0948629{col 76}{space 3} 1.272653
{txt}{space 18}12  {c |}{col 23}{res}{space 2} 2.423681{col 35}{space 2} 2.450601{col 46}{space 1}    0.88{col 55}{space 3}0.381{col 63}{space 4} .3340562{col 76}{space 3} 17.58456
{txt}{space 18}13  {c |}{col 23}{res}{space 2} .1719505{col 35}{space 2} .1396462{col 46}{space 1}   -2.17{col 55}{space 3}0.030{col 63}{space 4} .0350039{col 76}{space 3} .8446758
{txt}{space 18}14  {c |}{col 23}{res}{space 2}  .222905{col 35}{space 2} .1670464{col 46}{space 1}   -2.00{col 55}{space 3}0.045{col 63}{space 4} .0513126{col 76}{space 3} .9683124
{txt}{space 18}15  {c |}{col 23}{res}{space 2} .5975557{col 35}{space 2} .3244441{col 46}{space 1}   -0.95{col 55}{space 3}0.343{col 63}{space 4} .2061659{col 76}{space 3} 1.731968
{txt}{space 18}16  {c |}{col 23}{res}{space 2} .3157825{col 35}{space 2} .1838283{col 46}{space 1}   -1.98{col 55}{space 3}0.048{col 63}{space 4} .1008958{col 76}{space 3} .9883325
{txt}{space 18}17  {c |}{col 23}{res}{space 2} .3498503{col 35}{space 2} .2271257{col 46}{space 1}   -1.62{col 55}{space 3}0.106{col 63}{space 4} .0980111{col 76}{space 3} 1.248789
{txt}{space 18}18  {c |}{col 23}{res}{space 2}  .169141{col 35}{space 2} .1166935{col 46}{space 1}   -2.58{col 55}{space 3}0.010{col 63}{space 4} .0437511{col 76}{space 3} .6538957
{txt}{space 18}19  {c |}{col 23}{res}{space 2} .1787255{col 35}{space 2} .2084484{col 46}{space 1}   -1.48{col 55}{space 3}0.140{col 63}{space 4}  .018173{col 76}{space 3} 1.757709
{txt}{space 18}21  {c |}{col 23}{res}{space 2} .5710764{col 35}{space 2} .3327413{col 46}{space 1}   -0.96{col 55}{space 3}0.336{col 63}{space 4} .1822788{col 76}{space 3} 1.789173
{txt}{space 18}22  {c |}{col 23}{res}{space 2}  .451443{col 35}{space 2} .2733243{col 46}{space 1}   -1.31{col 55}{space 3}0.189{col 63}{space 4} .1377991{col 76}{space 3}  1.47897
{txt}{space 18}23  {c |}{col 23}{res}{space 2} .7382993{col 35}{space 2}  .473086{col 46}{space 1}   -0.47{col 55}{space 3}0.636{col 63}{space 4} .2102816{col 76}{space 3} 2.592171
{txt}{space 18}24  {c |}{col 23}{res}{space 2} .4019864{col 35}{space 2} .3281628{col 46}{space 1}   -1.12{col 55}{space 3}0.264{col 63}{space 4} .0811578{col 76}{space 3} 1.991096
{txt}{space 18}25  {c |}{col 23}{res}{space 2} .6436861{col 35}{space 2} .4539548{col 46}{space 1}   -0.62{col 55}{space 3}0.532{col 63}{space 4} .1615737{col 76}{space 3} 2.564352
{txt}{space 18}26  {c |}{col 23}{res}{space 2} 2.210769{col 35}{space 2} 2.470966{col 46}{space 1}    0.71{col 55}{space 3}0.478{col 63}{space 4} .2472632{col 76}{space 3} 19.76638
{txt}{space 18}28  {c |}{col 23}{res}{space 2} .8323662{col 35}{space 2} .6669702{col 46}{space 1}   -0.23{col 55}{space 3}0.819{col 63}{space 4} .1730819{col 76}{space 3} 4.002923
{txt}{space 18}29  {c |}{col 23}{res}{space 2} .5491205{col 35}{space 2} .3517372{col 46}{space 1}   -0.94{col 55}{space 3}0.349{col 63}{space 4} .1564709{col 76}{space 3} 1.927089
{txt}{space 18}30  {c |}{col 23}{res}{space 2} .2433434{col 35}{space 2} .2431818{col 46}{space 1}   -1.41{col 55}{space 3}0.157{col 63}{space 4} .0343229{col 76}{space 3} 1.725265
{txt}{space 18}31  {c |}{col 23}{res}{space 2}  .480615{col 35}{space 2} .3509057{col 46}{space 1}   -1.00{col 55}{space 3}0.316{col 63}{space 4} .1148999{col 76}{space 3} 2.010365
{txt}{space 21} {c |}
{space 18}sal {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .3722545{col 35}{space 2} .2987637{col 46}{space 1}   -1.23{col 55}{space 3}0.218{col 63}{space 4} .0772117{col 76}{space 3} 1.794719
{txt}{space 19}3  {c |}{col 23}{res}{space 2} .4401067{col 35}{space 2} .3563309{col 46}{space 1}   -1.01{col 55}{space 3}0.311{col 63}{space 4} .0900296{col 76}{space 3} 2.151446
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .5956667{col 35}{space 2} .4736488{col 46}{space 1}   -0.65{col 55}{space 3}0.515{col 63}{space 4} .1253615{col 76}{space 3} 2.830366
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .4657555{col 35}{space 2}  .386711{col 46}{space 1}   -0.92{col 55}{space 3}0.357{col 63}{space 4} .0914989{col 76}{space 3} 2.370828
{txt}{space 21} {c |}
{space 16}pos_2 {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .3269332{col 35}{space 2}  .227259{col 46}{space 1}   -1.61{col 55}{space 3}0.108{col 63}{space 4} .0837083{col 76}{space 3} 1.276878
{txt}{space 19}3  {c |}{col 23}{res}{space 2}  .314795{col 35}{space 2}  .224651{col 46}{space 1}   -1.62{col 55}{space 3}0.105{col 63}{space 4} .0777274{col 76}{space 3} 1.274915
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .0749592{col 35}{space 2} .0510083{col 46}{space 1}   -3.81{col 55}{space 3}0.000{col 63}{space 4} .0197515{col 76}{space 3} .2844796
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .0629172{col 35}{space 2} .0407365{col 46}{space 1}   -4.27{col 55}{space 3}0.000{col 63}{space 4} .0176868{col 76}{space 3} .2238154
{txt}{space 19}6  {c |}{col 23}{res}{space 2}  .037082{col 35}{space 2} .0263159{col 46}{space 1}   -4.64{col 55}{space 3}0.000{col 63}{space 4} .0092277{col 76}{space 3} .1490163
{txt}{space 19}7  {c |}{col 23}{res}{space 2} .0137948{col 35}{space 2} .0113812{col 46}{space 1}   -5.19{col 55}{space 3}0.000{col 63}{space 4}  .002738{col 76}{space 3} .0695004
{txt}{space 21} {c |}
{space 13}envrsp_r {c |}{col 23}{res}{space 2} 1.823333{col 35}{space 2}  .530959{col 46}{space 1}    2.06{col 55}{space 3}0.039{col 63}{space 4} 1.030372{col 76}{space 3} 3.226547
{txt}{space 8}religiosity_r {c |}{col 23}{res}{space 2} 1.700477{col 35}{space 2} .4764373{col 46}{space 1}    1.89{col 55}{space 3}0.058{col 63}{space 4} .9819337{col 76}{space 3} 2.944823
{txt}{space 15}RUDE_r {c |}{col 23}{res}{space 2} .6989925{col 35}{space 2} .1947221{col 46}{space 1}   -1.29{col 55}{space 3}0.199{col 63}{space 4} .4049009{col 76}{space 3} 1.206692
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 3.752147{col 35}{space 2} 4.891101{col 46}{space 1}    1.01{col 55}{space 3}0.310{col 63}{space 4} .2915401{col 76}{space 3} 48.29045
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}
({res}est2{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est2:est2}}{col 14}{c |}{res}{col 16}       903{col 28}-624.7902{col 39}-368.2763{col 50}    50{col 58} 836.5527{col 69} 1076.839
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M2
{txt}
{com}. 
. *
. 
. eststo: logit DV_2 i.middleclass i.treatment_96 i.treatment_99 middle_96 middle_99 upperclass i.ideol_2 i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r if DV_93_1!=. & DV_96_2!=. & DV_99_2!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=., vce(cluster id) or

{res}{txt}Iteration 0:{space 2}Log pseudolikelihood = {res:-624.79018}  
Iteration 1:{space 2}Log pseudolikelihood = {res:-373.99364}  
Iteration 2:{space 2}Log pseudolikelihood = {res: -368.0471}  
Iteration 3:{space 2}Log pseudolikelihood = {res:-367.82399}  
Iteration 4:{space 2}Log pseudolikelihood = {res:-367.82371}  
Iteration 5:{space 2}Log pseudolikelihood = {res:-367.82371}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:903}
{txt}{col 57}{lalign 13:Wald chi2({res:51})}{col 70} = {res}{ralign 6:271.12}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-367.82371}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.4113}

{txt}{ralign 80:(Std. err. adjusted for {res:301} clusters in {res:id})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}          DV_2{col 16}{c |} Odds ratio{col 28}   std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}1.middleclass {c |}{col 16}{res}{space 2} 2.446981{col 28}{space 2} 1.008376{col 39}{space 1}    2.17{col 48}{space 3}0.030{col 56}{space 4} 1.091086{col 69}{space 3} 5.487848
{txt}1.treatment_96 {c |}{col 16}{res}{space 2} 1.191837{col 28}{space 2}  .316144{col 39}{space 1}    0.66{col 48}{space 3}0.508{col 56}{space 4} .7086458{col 69}{space 3} 2.004494
{txt}1.treatment_99 {c |}{col 16}{res}{space 2} .8913713{col 28}{space 2} .2197777{col 39}{space 1}   -0.47{col 48}{space 3}0.641{col 56}{space 4} .5497753{col 69}{space 3} 1.445214
{txt}{space 5}middle_96 {c |}{col 16}{res}{space 2} .4756561{col 28}{space 2} .1938602{col 39}{space 1}   -1.82{col 48}{space 3}0.068{col 56}{space 4} .2139804{col 69}{space 3} 1.057334
{txt}{space 5}middle_99 {c |}{col 16}{res}{space 2}   .54747{col 28}{space 2} .2307116{col 39}{space 1}   -1.43{col 48}{space 3}0.153{col 56}{space 4} .2396911{col 69}{space 3} 1.250457
{txt}{space 4}upperclass {c |}{col 16}{res}{space 2} 3.024615{col 28}{space 2} .9984449{col 39}{space 1}    3.35{col 48}{space 3}0.001{col 56}{space 4} 1.583737{col 69}{space 3} 5.776399
{txt}{space 14} {c |}
{space 7}ideol_2 {c |}
{space 12}3  {c |}{col 16}{res}{space 2}  1.02313{col 28}{space 2} .8167176{col 39}{space 1}    0.03{col 48}{space 3}0.977{col 56}{space 4} .2140207{col 69}{space 3} 4.891092
{txt}{space 12}4  {c |}{col 16}{res}{space 2} 6.005522{col 28}{space 2} 4.576857{col 39}{space 1}    2.35{col 48}{space 3}0.019{col 56}{space 4} 1.348476{col 69}{space 3} 26.74597
{txt}{space 12}5  {c |}{col 16}{res}{space 2} 19.97626{col 28}{space 2} 15.58484{col 39}{space 1}    3.84{col 48}{space 3}0.000{col 56}{space 4} 4.329464{col 69}{space 3} 92.17101
{txt}{space 12}6  {c |}{col 16}{res}{space 2} 46.01167{col 28}{space 2} 38.73386{col 39}{space 1}    4.55{col 48}{space 3}0.000{col 56}{space 4} 8.836976{col 69}{space 3} 239.5699
{txt}{space 14} {c |}
{space 11}day {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .4621122{col 28}{space 2} .4069816{col 39}{space 1}   -0.88{col 48}{space 3}0.381{col 56}{space 4} .0822423{col 69}{space 3} 2.596567
{txt}{space 12}3  {c |}{col 16}{res}{space 2} .0966091{col 28}{space 2} .0774316{col 39}{space 1}   -2.92{col 48}{space 3}0.004{col 56}{space 4}  .020081{col 69}{space 3} .4647834
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .4699571{col 28}{space 2} .3345449{col 39}{space 1}   -1.06{col 48}{space 3}0.289{col 56}{space 4} .1164447{col 69}{space 3} 1.896692
{txt}{space 12}5  {c |}{col 16}{res}{space 2} .3275096{col 28}{space 2} .2447745{col 39}{space 1}   -1.49{col 48}{space 3}0.135{col 56}{space 4} .0756924{col 69}{space 3} 1.417086
{txt}{space 12}6  {c |}{col 16}{res}{space 2} .4708621{col 28}{space 2} .2499617{col 39}{space 1}   -1.42{col 48}{space 3}0.156{col 56}{space 4} .1663509{col 69}{space 3} 1.332792
{txt}{space 12}7  {c |}{col 16}{res}{space 2} .4603976{col 28}{space 2} .2938746{col 39}{space 1}   -1.22{col 48}{space 3}0.224{col 56}{space 4} .1317668{col 69}{space 3} 1.608645
{txt}{space 12}8  {c |}{col 16}{res}{space 2} .4036866{col 28}{space 2} .2329256{col 39}{space 1}   -1.57{col 48}{space 3}0.116{col 56}{space 4}  .130288{col 69}{space 3}  1.25079
{txt}{space 12}9  {c |}{col 16}{res}{space 2} .7567805{col 28}{space 2} .5911305{col 39}{space 1}   -0.36{col 48}{space 3}0.721{col 56}{space 4} .1637141{col 69}{space 3} 3.498274
{txt}{space 11}10  {c |}{col 16}{res}{space 2}  .374152{col 28}{space 2} .2413834{col 39}{space 1}   -1.52{col 48}{space 3}0.128{col 56}{space 4} .1056567{col 69}{space 3} 1.324949
{txt}{space 11}11  {c |}{col 16}{res}{space 2} .3454342{col 28}{space 2} .2274588{col 39}{space 1}   -1.61{col 48}{space 3}0.106{col 56}{space 4} .0950326{col 69}{space 3} 1.255619
{txt}{space 11}12  {c |}{col 16}{res}{space 2} 2.215567{col 28}{space 2} 2.233626{col 39}{space 1}    0.79{col 48}{space 3}0.430{col 56}{space 4}  .307146{col 69}{space 3} 15.98176
{txt}{space 11}13  {c |}{col 16}{res}{space 2} .1789842{col 28}{space 2} .1417511{col 39}{space 1}   -2.17{col 48}{space 3}0.030{col 56}{space 4} .0379039{col 69}{space 3} .8451724
{txt}{space 11}14  {c |}{col 16}{res}{space 2} .2255418{col 28}{space 2} .1687147{col 39}{space 1}   -1.99{col 48}{space 3}0.046{col 56}{space 4} .0520586{col 69}{space 3} .9771504
{txt}{space 11}15  {c |}{col 16}{res}{space 2} .6386696{col 28}{space 2} .3448146{col 39}{space 1}   -0.83{col 48}{space 3}0.406{col 56}{space 4}  .221675{col 69}{space 3} 1.840076
{txt}{space 11}16  {c |}{col 16}{res}{space 2} .3284508{col 28}{space 2} .1888272{col 39}{space 1}   -1.94{col 48}{space 3}0.053{col 56}{space 4} .1064419{col 69}{space 3}  1.01351
{txt}{space 11}17  {c |}{col 16}{res}{space 2} .3730287{col 28}{space 2} .2393417{col 39}{space 1}   -1.54{col 48}{space 3}0.124{col 56}{space 4}  .106071{col 69}{space 3} 1.311861
{txt}{space 11}18  {c |}{col 16}{res}{space 2} .1717706{col 28}{space 2}   .11731{col 39}{space 1}   -2.58{col 48}{space 3}0.010{col 56}{space 4} .0450427{col 69}{space 3} .6550486
{txt}{space 11}19  {c |}{col 16}{res}{space 2} .1801084{col 28}{space 2} .2108688{col 39}{space 1}   -1.46{col 48}{space 3}0.143{col 56}{space 4} .0181534{col 69}{space 3} 1.786943
{txt}{space 11}21  {c |}{col 16}{res}{space 2} .6012121{col 28}{space 2} .3480584{col 39}{space 1}   -0.88{col 48}{space 3}0.379{col 56}{space 4} .1933052{col 69}{space 3} 1.869873
{txt}{space 11}22  {c |}{col 16}{res}{space 2} .4569139{col 28}{space 2}  .275352{col 39}{space 1}   -1.30{col 48}{space 3}0.194{col 56}{space 4} .1402398{col 69}{space 3} 1.488667
{txt}{space 11}23  {c |}{col 16}{res}{space 2} .7473783{col 28}{space 2} .4746706{col 39}{space 1}   -0.46{col 48}{space 3}0.647{col 56}{space 4} .2152436{col 69}{space 3}  2.59508
{txt}{space 11}24  {c |}{col 16}{res}{space 2}  .425979{col 28}{space 2} .3438419{col 39}{space 1}   -1.06{col 48}{space 3}0.290{col 56}{space 4} .0875619{col 69}{space 3} 2.072342
{txt}{space 11}25  {c |}{col 16}{res}{space 2} .6275541{col 28}{space 2} .4365687{col 39}{space 1}   -0.67{col 48}{space 3}0.503{col 56}{space 4} .1605086{col 69}{space 3} 2.453602
{txt}{space 11}26  {c |}{col 16}{res}{space 2} 2.392304{col 28}{space 2} 2.620496{col 39}{space 1}    0.80{col 48}{space 3}0.426{col 56}{space 4} .2795261{col 69}{space 3} 20.47437
{txt}{space 11}28  {c |}{col 16}{res}{space 2} .8812176{col 28}{space 2} .7001669{col 39}{space 1}   -0.16{col 48}{space 3}0.874{col 56}{space 4} .1856801{col 69}{space 3} 4.182163
{txt}{space 11}29  {c |}{col 16}{res}{space 2} .5451882{col 28}{space 2} .3456798{col 39}{space 1}   -0.96{col 48}{space 3}0.339{col 56}{space 4} .1573392{col 69}{space 3} 1.889104
{txt}{space 11}30  {c |}{col 16}{res}{space 2} .2267836{col 28}{space 2} .2292426{col 39}{space 1}   -1.47{col 48}{space 3}0.142{col 56}{space 4} .0312738{col 69}{space 3} 1.644534
{txt}{space 11}31  {c |}{col 16}{res}{space 2}  .443735{col 28}{space 2}  .323199{col 39}{space 1}   -1.12{col 48}{space 3}0.265{col 56}{space 4} .1064491{col 69}{space 3} 1.849717
{txt}{space 14} {c |}
{space 11}sal {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .3738423{col 28}{space 2} .2935134{col 39}{space 1}   -1.25{col 48}{space 3}0.210{col 56}{space 4} .0802394{col 69}{space 3} 1.741763
{txt}{space 12}3  {c |}{col 16}{res}{space 2} .4422872{col 28}{space 2} .3493994{col 39}{space 1}   -1.03{col 48}{space 3}0.302{col 56}{space 4} .0940307{col 69}{space 3} 2.080364
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .5943178{col 28}{space 2} .4608467{col 39}{space 1}   -0.67{col 48}{space 3}0.502{col 56}{space 4} .1300106{col 69}{space 3} 2.716806
{txt}{space 12}5  {c |}{col 16}{res}{space 2} .4621049{col 28}{space 2}  .374177{col 39}{space 1}   -0.95{col 48}{space 3}0.340{col 56}{space 4} .0945155{col 69}{space 3} 2.259322
{txt}{space 14} {c |}
{space 9}pos_2 {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .3340036{col 28}{space 2} .2315087{col 39}{space 1}   -1.58{col 48}{space 3}0.114{col 56}{space 4}  .085853{col 69}{space 3} 1.299411
{txt}{space 12}3  {c |}{col 16}{res}{space 2} .3160086{col 28}{space 2} .2245519{col 39}{space 1}   -1.62{col 48}{space 3}0.105{col 56}{space 4} .0784956{col 69}{space 3} 1.272191
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .0756266{col 28}{space 2} .0511816{col 39}{space 1}   -3.82{col 48}{space 3}0.000{col 56}{space 4} .0200728{col 69}{space 3} .2849314
{txt}{space 12}5  {c |}{col 16}{res}{space 2} .0626821{col 28}{space 2} .0404496{col 39}{space 1}   -4.29{col 48}{space 3}0.000{col 56}{space 4} .0176951{col 69}{space 3} .2220421
{txt}{space 12}6  {c |}{col 16}{res}{space 2} .0355631{col 28}{space 2}  .025339{col 39}{space 1}   -4.68{col 48}{space 3}0.000{col 56}{space 4} .0088006{col 69}{space 3} .1437104
{txt}{space 12}7  {c |}{col 16}{res}{space 2} .0136332{col 28}{space 2} .0112311{col 39}{space 1}   -5.21{col 48}{space 3}0.000{col 56}{space 4} .0027125{col 69}{space 3} .0685209
{txt}{space 14} {c |}
{space 6}envrsp_r {c |}{col 16}{res}{space 2} 1.819894{col 28}{space 2} .5284729{col 39}{space 1}    2.06{col 48}{space 3}0.039{col 56}{space 4} 1.030074{col 69}{space 3} 3.215316
{txt}{space 1}religiosity_r {c |}{col 16}{res}{space 2} 1.705022{col 28}{space 2} .4767742{col 39}{space 1}    1.91{col 48}{space 3}0.056{col 56}{space 4} .9856188{col 69}{space 3} 2.949517
{txt}{space 8}RUDE_r {c |}{col 16}{res}{space 2} .6966703{col 28}{space 2} .1934185{col 39}{space 1}   -1.30{col 48}{space 3}0.193{col 56}{space 4} .4043019{col 69}{space 3} 1.200463
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 3.679322{col 28}{space 2} 4.760672{col 39}{space 1}    1.01{col 48}{space 3}0.314{col 56}{space 4} .2913389{col 69}{space 3} 46.46618
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}
({res}est3{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est3:est3}}{col 14}{c |}{res}{col 16}       903{col 28}-624.7902{col 39}-367.8237{col 50}    52{col 58} 839.6474{col 69} 1089.545
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M3
{txt}
{com}. 
. esttab using TableC4.rtf, eform ///
>         label title (ACT) nonumbers mtitles ("M1" "M2" "M3") ///
>         starlevels(+ 0.1 * 0.05 ** 0.01 *** 0.001) ///
>         b(2) se(2) r2 ///  
>         varlabels(_cons Constant) replace
{txt}(tabulating estimates stored by eststo; specify "." to tabulate the active results)
{res}{txt}(output written to {browse  `"TableC4.rtf"'})

{com}. 
. ********************************************************************************
. 
. *Alternative Operationalization of Social Class
. 
. eststo clear
{txt}
{com}. 
. eststo: logit DV_1 middleclass3##treatment upperclass3 i.ideol_2 i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r if DV_93_1!=. & DV_96_1!=. & DV_99_1!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=. & id2<3, vce(cluster id) or

{res}{txt}Iteration 0:{space 2}Log pseudolikelihood = {res:-348.35751}  
Iteration 1:{space 2}Log pseudolikelihood = {res:-206.97661}  
Iteration 2:{space 2}Log pseudolikelihood = {res:-201.34547}  
Iteration 3:{space 2}Log pseudolikelihood = {res: -201.2182}  
Iteration 4:{space 2}Log pseudolikelihood = {res:-201.21808}  
Iteration 5:{space 2}Log pseudolikelihood = {res:-201.21808}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:514}
{txt}{col 57}{lalign 13:Wald chi2({res:49})}{col 70} = {res}{ralign 6:187.29}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-201.21808}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.4224}

{txt}{ralign 88:(Std. err. adjusted for {res:257} clusters in {res:id})}
{hline 23}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 24}{c |}{col 36}    Robust
{col 1}                  DV_1{col 24}{c |} Odds ratio{col 36}   std. err.{col 48}      z{col 56}   P>|z|{col 64}     [95% con{col 77}f. interval]
{hline 23}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}1.middleclass3 {c |}{col 24}{res}{space 2} 2.673712{col 36}{space 2} 1.138199{col 47}{space 1}    2.31{col 56}{space 3}0.021{col 64}{space 4} 1.160802{col 77}{space 3} 6.158445
{txt}{space 11}1.treatment {c |}{col 24}{res}{space 2} .8161855{col 36}{space 2} .2766834{col 47}{space 1}   -0.60{col 56}{space 3}0.549{col 64}{space 4} .4199864{col 77}{space 3} 1.586144
{txt}{space 22} {c |}
middleclass3#treatment {c |}
{space 18}1 1  {c |}{col 24}{res}{space 2} .4490484{col 36}{space 2} .2009503{col 47}{space 1}   -1.79{col 56}{space 3}0.074{col 64}{space 4} .1868006{col 77}{space 3} 1.079463
{txt}{space 22} {c |}
{space 11}upperclass3 {c |}{col 24}{res}{space 2} 3.345556{col 36}{space 2}   1.5121{col 47}{space 1}    2.67{col 56}{space 3}0.008{col 64}{space 4} 1.379584{col 77}{space 3} 8.113125
{txt}{space 22} {c |}
{space 15}ideol_2 {c |}
{space 20}3  {c |}{col 24}{res}{space 2} .9927667{col 36}{space 2} .8532334{col 47}{space 1}   -0.01{col 56}{space 3}0.993{col 64}{space 4} .1841967{col 77}{space 3} 5.350723
{txt}{space 20}4  {c |}{col 24}{res}{space 2} 4.655104{col 36}{space 2} 3.665008{col 47}{space 1}    1.95{col 56}{space 3}0.051{col 64}{space 4} .9948791{col 77}{space 3} 21.78153
{txt}{space 20}5  {c |}{col 24}{res}{space 2} 22.75029{col 36}{space 2} 18.86468{col 47}{space 1}    3.77{col 56}{space 3}0.000{col 64}{space 4} 4.478843{col 77}{space 3} 115.5602
{txt}{space 20}6  {c |}{col 24}{res}{space 2} 62.04281{col 36}{space 2} 56.46553{col 47}{space 1}    4.54{col 56}{space 3}0.000{col 64}{space 4} 10.42336{col 77}{space 3} 369.2964
{txt}{space 22} {c |}
{space 19}day {c |}
{space 20}2  {c |}{col 24}{res}{space 2} .0717056{col 36}{space 2} .1300496{col 47}{space 1}   -1.45{col 56}{space 3}0.146{col 64}{space 4}   .00205{col 77}{space 3} 2.508089
{txt}{space 20}3  {c |}{col 24}{res}{space 2} .0171624{col 36}{space 2} .0272816{col 47}{space 1}   -2.56{col 56}{space 3}0.011{col 64}{space 4} .0007612{col 77}{space 3} .3869589
{txt}{space 20}4  {c |}{col 24}{res}{space 2} .3532438{col 36}{space 2} .2937133{col 47}{space 1}   -1.25{col 56}{space 3}0.211{col 64}{space 4} .0692344{col 77}{space 3} 1.802301
{txt}{space 20}5  {c |}{col 24}{res}{space 2} .2377436{col 36}{space 2} .2369028{col 47}{space 1}   -1.44{col 56}{space 3}0.149{col 64}{space 4} .0337223{col 77}{space 3} 1.676101
{txt}{space 20}6  {c |}{col 24}{res}{space 2} .7802395{col 36}{space 2} .5505788{col 47}{space 1}   -0.35{col 56}{space 3}0.725{col 64}{space 4} .1956926{col 77}{space 3} 3.110867
{txt}{space 20}7  {c |}{col 24}{res}{space 2} .2524357{col 36}{space 2} .2671242{col 47}{space 1}   -1.30{col 56}{space 3}0.193{col 64}{space 4} .0317264{col 77}{space 3} 2.008544
{txt}{space 20}8  {c |}{col 24}{res}{space 2} .2483509{col 36}{space 2} .2355719{col 47}{space 1}   -1.47{col 56}{space 3}0.142{col 64}{space 4} .0386958{col 77}{space 3} 1.593926
{txt}{space 20}9  {c |}{col 24}{res}{space 2} .6230205{col 36}{space 2} .7633802{col 47}{space 1}   -0.39{col 56}{space 3}0.699{col 64}{space 4} .0564332{col 77}{space 3} 6.878129
{txt}{space 19}10  {c |}{col 24}{res}{space 2} .1229226{col 36}{space 2} .1306957{col 47}{space 1}   -1.97{col 56}{space 3}0.049{col 64}{space 4} .0152969{col 77}{space 3} .9877779
{txt}{space 19}11  {c |}{col 24}{res}{space 2} .1719726{col 36}{space 2}  .132796{col 47}{space 1}   -2.28{col 56}{space 3}0.023{col 64}{space 4} .0378589{col 77}{space 3} .7811799
{txt}{space 19}12  {c |}{col 24}{res}{space 2} 1.486876{col 36}{space 2} 1.642408{col 47}{space 1}    0.36{col 56}{space 3}0.720{col 64}{space 4}  .170622{col 77}{space 3}  12.9573
{txt}{space 19}13  {c |}{col 24}{res}{space 2} .1245242{col 36}{space 2} .1689485{col 47}{space 1}   -1.54{col 56}{space 3}0.125{col 64}{space 4} .0087173{col 77}{space 3} 1.778787
{txt}{space 19}14  {c |}{col 24}{res}{space 2} .0594046{col 36}{space 2} .0573156{col 47}{space 1}   -2.93{col 56}{space 3}0.003{col 64}{space 4}  .008965{col 77}{space 3}   .39363
{txt}{space 19}15  {c |}{col 24}{res}{space 2} .2936243{col 36}{space 2} .2080512{col 47}{space 1}   -1.73{col 56}{space 3}0.084{col 64}{space 4} .0732255{col 77}{space 3} 1.177393
{txt}{space 19}16  {c |}{col 24}{res}{space 2} .2264935{col 36}{space 2} .1500955{col 47}{space 1}   -2.24{col 56}{space 3}0.025{col 64}{space 4} .0617975{col 77}{space 3} .8301189
{txt}{space 19}17  {c |}{col 24}{res}{space 2} .2468901{col 36}{space 2}  .200791{col 47}{space 1}   -1.72{col 56}{space 3}0.085{col 64}{space 4} .0501462{col 77}{space 3} 1.215541
{txt}{space 19}18  {c |}{col 24}{res}{space 2} .0780042{col 36}{space 2} .0619457{col 47}{space 1}   -3.21{col 56}{space 3}0.001{col 64}{space 4} .0164494{col 77}{space 3} .3699003
{txt}{space 19}19  {c |}{col 24}{res}{space 2} .2710623{col 36}{space 2} .2221005{col 47}{space 1}   -1.59{col 56}{space 3}0.111{col 64}{space 4} .0544026{col 77}{space 3} 1.350575
{txt}{space 19}21  {c |}{col 24}{res}{space 2} .2052743{col 36}{space 2} .1664377{col 47}{space 1}   -1.95{col 56}{space 3}0.051{col 64}{space 4} .0418962{col 77}{space 3} 1.005759
{txt}{space 19}22  {c |}{col 24}{res}{space 2} .2684998{col 36}{space 2} .2061668{col 47}{space 1}   -1.71{col 56}{space 3}0.087{col 64}{space 4} .0596144{col 77}{space 3} 1.209307
{txt}{space 19}23  {c |}{col 24}{res}{space 2} .3174793{col 36}{space 2} .2219489{col 47}{space 1}   -1.64{col 56}{space 3}0.101{col 64}{space 4} .0806571{col 77}{space 3} 1.249649
{txt}{space 19}24  {c |}{col 24}{res}{space 2} .1146034{col 36}{space 2} .1363816{col 47}{space 1}   -1.82{col 56}{space 3}0.069{col 64}{space 4} .0111235{col 77}{space 3} 1.180738
{txt}{space 19}25  {c |}{col 24}{res}{space 2} .2193847{col 36}{space 2} .1738596{col 47}{space 1}   -1.91{col 56}{space 3}0.056{col 64}{space 4} .0464131{col 77}{space 3} 1.036985
{txt}{space 19}26  {c |}{col 24}{res}{space 2} 1.133974{col 36}{space 2} 3.869677{col 47}{space 1}    0.04{col 56}{space 3}0.971{col 64}{space 4} .0014122{col 77}{space 3} 910.5861
{txt}{space 19}28  {c |}{col 24}{res}{space 2} .1745841{col 36}{space 2} .1772519{col 47}{space 1}   -1.72{col 56}{space 3}0.086{col 64}{space 4} .0238669{col 77}{space 3} 1.277066
{txt}{space 19}29  {c |}{col 24}{res}{space 2} .3515743{col 36}{space 2} .2893889{col 47}{space 1}   -1.27{col 56}{space 3}0.204{col 64}{space 4} .0700444{col 77}{space 3} 1.764659
{txt}{space 19}30  {c |}{col 24}{res}{space 2} .1025701{col 36}{space 2} .1033561{col 47}{space 1}   -2.26{col 56}{space 3}0.024{col 64}{space 4}  .014233{col 77}{space 3} .7391722
{txt}{space 19}31  {c |}{col 24}{res}{space 2} .2835044{col 36}{space 2} .2239517{col 47}{space 1}   -1.60{col 56}{space 3}0.111{col 64}{space 4} .0602783{col 77}{space 3} 1.333395
{txt}{space 22} {c |}
{space 19}sal {c |}
{space 20}2  {c |}{col 24}{res}{space 2} .2104579{col 36}{space 2} .2335466{col 47}{space 1}   -1.40{col 56}{space 3}0.160{col 64}{space 4} .0239101{col 77}{space 3} 1.852462
{txt}{space 20}3  {c |}{col 24}{res}{space 2} .2033836{col 36}{space 2} .2214693{col 47}{space 1}   -1.46{col 56}{space 3}0.144{col 64}{space 4}  .024067{col 77}{space 3} 1.718738
{txt}{space 20}4  {c |}{col 24}{res}{space 2} .2779145{col 36}{space 2} .2980879{col 47}{space 1}   -1.19{col 56}{space 3}0.233{col 64}{space 4} .0339565{col 77}{space 3} 2.274575
{txt}{space 20}5  {c |}{col 24}{res}{space 2} .2020986{col 36}{space 2} .2211361{col 47}{space 1}   -1.46{col 56}{space 3}0.144{col 64}{space 4}  .023669{col 77}{space 3} 1.725628
{txt}{space 22} {c |}
{space 17}pos_2 {c |}
{space 20}2  {c |}{col 24}{res}{space 2} .1975064{col 36}{space 2} .2674504{col 47}{space 1}   -1.20{col 56}{space 3}0.231{col 64}{space 4} .0138976{col 77}{space 3} 2.806876
{txt}{space 20}3  {c |}{col 24}{res}{space 2} .2998328{col 36}{space 2} .3983119{col 47}{space 1}   -0.91{col 56}{space 3}0.365{col 64}{space 4} .0221872{col 77}{space 3} 4.051866
{txt}{space 20}4  {c |}{col 24}{res}{space 2} .0543727{col 36}{space 2} .0698734{col 47}{space 1}   -2.27{col 56}{space 3}0.023{col 64}{space 4} .0043804{col 77}{space 3} .6749078
{txt}{space 20}5  {c |}{col 24}{res}{space 2}  .050784{col 36}{space 2} .0645676{col 47}{space 1}   -2.34{col 56}{space 3}0.019{col 64}{space 4} .0042024{col 77}{space 3} .6137015
{txt}{space 20}6  {c |}{col 24}{res}{space 2} .0357673{col 36}{space 2}   .04697{col 47}{space 1}   -2.54{col 56}{space 3}0.011{col 64}{space 4}  .002727{col 77}{space 3}  .469129
{txt}{space 20}7  {c |}{col 24}{res}{space 2} .0057878{col 36}{space 2} .0083452{col 47}{space 1}   -3.57{col 56}{space 3}0.000{col 64}{space 4} .0003429{col 77}{space 3} .0976845
{txt}{space 22} {c |}
{space 14}envrsp_r {c |}{col 24}{res}{space 2} 1.837198{col 36}{space 2} .6293537{col 47}{space 1}    1.78{col 56}{space 3}0.076{col 64}{space 4} .9387869{col 77}{space 3} 3.595382
{txt}{space 9}religiosity_r {c |}{col 24}{res}{space 2} 1.877903{col 36}{space 2} .5870021{col 47}{space 1}    2.02{col 56}{space 3}0.044{col 64}{space 4} 1.017657{col 77}{space 3} 3.465333
{txt}{space 16}RUDE_r {c |}{col 24}{res}{space 2} .7963124{col 36}{space 2} .2488737{col 47}{space 1}   -0.73{col 56}{space 3}0.466{col 64}{space 4} .4315739{col 77}{space 3} 1.469305
{txt}{space 17}_cons {c |}{col 24}{res}{space 2}  20.3413{col 36}{space 2} 38.54252{col 47}{space 1}    1.59{col 56}{space 3}0.112{col 64}{space 4} .4960547{col 77}{space 3}  834.119
{txt}{hline 23}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}
({res}est1{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est1:est1}}{col 14}{c |}{res}{col 16}       514{col 28}-348.3575{col 39}-201.2181{col 50}    50{col 58} 502.4362{col 69} 714.5473
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M1
{txt}
{com}. 
. *
. 
. eststo: logit DV_1 middleclass3##treatment upperclass3 i.ideol_2 i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r if DV_93_1!=. & DV_96_1!=. & DV_99_1!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=., vce(cluster id) or

{res}{txt}Iteration 0:{space 2}Log pseudolikelihood = {res:-521.45063}  
Iteration 1:{space 2}Log pseudolikelihood = {res:-311.95344}  
Iteration 2:{space 2}Log pseudolikelihood = {res:-303.85825}  
Iteration 3:{space 2}Log pseudolikelihood = {res:-303.71552}  
Iteration 4:{space 2}Log pseudolikelihood = {res:-303.71547}  
Iteration 5:{space 2}Log pseudolikelihood = {res:-303.71547}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:771}
{txt}{col 57}{lalign 13:Wald chi2({res:49})}{col 70} = {res}{ralign 6:240.43}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-303.71547}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.4176}

{txt}{ralign 88:(Std. err. adjusted for {res:257} clusters in {res:id})}
{hline 23}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 24}{c |}{col 36}    Robust
{col 1}                  DV_1{col 24}{c |} Odds ratio{col 36}   std. err.{col 48}      z{col 56}   P>|z|{col 64}     [95% con{col 77}f. interval]
{hline 23}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}1.middleclass3 {c |}{col 24}{res}{space 2} 2.731421{col 36}{space 2} 1.109793{col 47}{space 1}    2.47{col 56}{space 3}0.013{col 64}{space 4}   1.2318{col 77}{space 3} 6.056715
{txt}{space 11}1.treatment {c |}{col 24}{res}{space 2} .8984837{col 36}{space 2} .2379486{col 47}{space 1}   -0.40{col 56}{space 3}0.686{col 64}{space 4} .5346671{col 77}{space 3} 1.509861
{txt}{space 22} {c |}
middleclass3#treatment {c |}
{space 18}1 1  {c |}{col 24}{res}{space 2} .4915031{col 36}{space 2} .1871313{col 47}{space 1}   -1.87{col 56}{space 3}0.062{col 64}{space 4} .2330484{col 77}{space 3} 1.036589
{txt}{space 22} {c |}
{space 11}upperclass3 {c |}{col 24}{res}{space 2} 3.214865{col 36}{space 2} 1.305432{col 47}{space 1}    2.88{col 56}{space 3}0.004{col 64}{space 4} 1.450517{col 77}{space 3} 7.125293
{txt}{space 22} {c |}
{space 15}ideol_2 {c |}
{space 20}3  {c |}{col 24}{res}{space 2} .8398042{col 36}{space 2} .6936245{col 47}{space 1}   -0.21{col 56}{space 3}0.833{col 64}{space 4} .1663949{col 77}{space 3} 4.238537
{txt}{space 20}4  {c |}{col 24}{res}{space 2} 4.424693{col 36}{space 2} 3.403526{col 47}{space 1}    1.93{col 56}{space 3}0.053{col 64}{space 4} .9797804{col 77}{space 3} 19.98193
{txt}{space 20}5  {c |}{col 24}{res}{space 2} 18.51838{col 36}{space 2} 14.86015{col 47}{space 1}    3.64{col 56}{space 3}0.000{col 64}{space 4} 3.841959{col 77}{space 3} 89.25927
{txt}{space 20}6  {c |}{col 24}{res}{space 2} 45.07415{col 36}{space 2} 39.48972{col 47}{space 1}    4.35{col 56}{space 3}0.000{col 64}{space 4} 8.094406{col 77}{space 3} 250.9979
{txt}{space 22} {c |}
{space 19}day {c |}
{space 20}2  {c |}{col 24}{res}{space 2} .2005208{col 36}{space 2} .2077428{col 47}{space 1}   -1.55{col 56}{space 3}0.121{col 64}{space 4} .0263209{col 77}{space 3} 1.527629
{txt}{space 20}3  {c |}{col 24}{res}{space 2} .0592599{col 36}{space 2}  .058024{col 47}{space 1}   -2.89{col 56}{space 3}0.004{col 64}{space 4} .0086959{col 77}{space 3} .4038407
{txt}{space 20}4  {c |}{col 24}{res}{space 2} .5332258{col 36}{space 2} .4171643{col 47}{space 1}   -0.80{col 56}{space 3}0.422{col 64}{space 4} .1150751{col 77}{space 3} 2.470818
{txt}{space 20}5  {c |}{col 24}{res}{space 2} .3157101{col 36}{space 2} .2766935{col 47}{space 1}   -1.32{col 56}{space 3}0.188{col 64}{space 4} .0566607{col 77}{space 3} 1.759119
{txt}{space 20}6  {c |}{col 24}{res}{space 2} .5215847{col 36}{space 2} .3199947{col 47}{space 1}   -1.06{col 56}{space 3}0.289{col 64}{space 4} .1567143{col 77}{space 3} 1.735965
{txt}{space 20}7  {c |}{col 24}{res}{space 2} .3927069{col 36}{space 2} .2805896{col 47}{space 1}   -1.31{col 56}{space 3}0.191{col 64}{space 4} .0968019{col 77}{space 3} 1.593137
{txt}{space 20}8  {c |}{col 24}{res}{space 2} .3393173{col 36}{space 2} .2137637{col 47}{space 1}   -1.72{col 56}{space 3}0.086{col 64}{space 4} .0987108{col 77}{space 3}   1.1664
{txt}{space 20}9  {c |}{col 24}{res}{space 2} .6332677{col 36}{space 2} .5781261{col 47}{space 1}   -0.50{col 56}{space 3}0.617{col 64}{space 4} .1058044{col 77}{space 3} 3.790276
{txt}{space 19}10  {c |}{col 24}{res}{space 2} .4546311{col 36}{space 2}  .328032{col 47}{space 1}   -1.09{col 56}{space 3}0.275{col 64}{space 4}  .110532{col 77}{space 3} 1.869951
{txt}{space 19}11  {c |}{col 24}{res}{space 2} .2667212{col 36}{space 2} .2027202{col 47}{space 1}   -1.74{col 56}{space 3}0.082{col 64}{space 4}  .060132{col 77}{space 3} 1.183067
{txt}{space 19}12  {c |}{col 24}{res}{space 2}  2.04501{col 36}{space 2} 2.197862{col 47}{space 1}    0.67{col 56}{space 3}0.506{col 64}{space 4} .2488123{col 77}{space 3} 16.80812
{txt}{space 19}13  {c |}{col 24}{res}{space 2} .0994577{col 36}{space 2} .0983712{col 47}{space 1}   -2.33{col 56}{space 3}0.020{col 64}{space 4} .0143132{col 77}{space 3} .6911008
{txt}{space 19}14  {c |}{col 24}{res}{space 2} .1116924{col 36}{space 2} .0805496{col 47}{space 1}   -3.04{col 56}{space 3}0.002{col 64}{space 4} .0271744{col 77}{space 3} .4590789
{txt}{space 19}15  {c |}{col 24}{res}{space 2} .5344539{col 36}{space 2} .3306614{col 47}{space 1}   -1.01{col 56}{space 3}0.311{col 64}{space 4} .1589572{col 77}{space 3} 1.796968
{txt}{space 19}16  {c |}{col 24}{res}{space 2} .4160532{col 36}{space 2} .2582748{col 47}{space 1}   -1.41{col 56}{space 3}0.158{col 64}{space 4} .1232383{col 77}{space 3} 1.404598
{txt}{space 19}17  {c |}{col 24}{res}{space 2} .2933789{col 36}{space 2} .2132082{col 47}{space 1}   -1.69{col 56}{space 3}0.092{col 64}{space 4} .0706045{col 77}{space 3}  1.21906
{txt}{space 19}18  {c |}{col 24}{res}{space 2} .1423803{col 36}{space 2} .1062392{col 47}{space 1}   -2.61{col 56}{space 3}0.009{col 64}{space 4} .0329847{col 77}{space 3}  .614592
{txt}{space 19}19  {c |}{col 24}{res}{space 2} .3686581{col 36}{space 2} .3103855{col 47}{space 1}   -1.19{col 56}{space 3}0.236{col 64}{space 4} .0707895{col 77}{space 3}   1.9199
{txt}{space 19}21  {c |}{col 24}{res}{space 2} .3990942{col 36}{space 2} .2603763{col 47}{space 1}   -1.41{col 56}{space 3}0.159{col 64}{space 4} .1111056{col 77}{space 3} 1.433556
{txt}{space 19}22  {c |}{col 24}{res}{space 2} .4773412{col 36}{space 2}  .339964{col 47}{space 1}   -1.04{col 56}{space 3}0.299{col 64}{space 4} .1181953{col 77}{space 3}  1.92778
{txt}{space 19}23  {c |}{col 24}{res}{space 2} .5020796{col 36}{space 2} .3266062{col 47}{space 1}   -1.06{col 56}{space 3}0.290{col 64}{space 4} .1403008{col 77}{space 3} 1.796739
{txt}{space 19}24  {c |}{col 24}{res}{space 2}  .261429{col 36}{space 2} .2649121{col 47}{space 1}   -1.32{col 56}{space 3}0.186{col 64}{space 4} .0358766{col 77}{space 3} 1.905005
{txt}{space 19}25  {c |}{col 24}{res}{space 2} .4068805{col 36}{space 2} .3104722{col 47}{space 1}   -1.18{col 56}{space 3}0.239{col 64}{space 4} .0911913{col 77}{space 3} 1.815434
{txt}{space 19}26  {c |}{col 24}{res}{space 2}  1.67635{col 36}{space 2}  2.73834{col 47}{space 1}    0.32{col 56}{space 3}0.752{col 64}{space 4} .0682205{col 77}{space 3} 41.19211
{txt}{space 19}28  {c |}{col 24}{res}{space 2} .5146449{col 36}{space 2} .4079137{col 47}{space 1}   -0.84{col 56}{space 3}0.402{col 64}{space 4} .1088517{col 77}{space 3} 2.433213
{txt}{space 19}29  {c |}{col 24}{res}{space 2} .5101112{col 36}{space 2} .3722472{col 47}{space 1}   -0.92{col 56}{space 3}0.356{col 64}{space 4} .1220426{col 77}{space 3} 2.132153
{txt}{space 19}30  {c |}{col 24}{res}{space 2} .1535059{col 36}{space 2} .1542546{col 47}{space 1}   -1.86{col 56}{space 3}0.062{col 64}{space 4} .0214177{col 77}{space 3} 1.100217
{txt}{space 19}31  {c |}{col 24}{res}{space 2} .3973282{col 36}{space 2} .3222227{col 47}{space 1}   -1.14{col 56}{space 3}0.255{col 64}{space 4} .0810676{col 77}{space 3} 1.947383
{txt}{space 22} {c |}
{space 19}sal {c |}
{space 20}2  {c |}{col 24}{res}{space 2} .2559928{col 36}{space 2} .2001003{col 47}{space 1}   -1.74{col 56}{space 3}0.081{col 64}{space 4}  .055319{col 77}{space 3} 1.184626
{txt}{space 20}3  {c |}{col 24}{res}{space 2} .2796349{col 36}{space 2} .2174039{col 47}{space 1}   -1.64{col 56}{space 3}0.101{col 64}{space 4} .0609284{col 77}{space 3} 1.283403
{txt}{space 20}4  {c |}{col 24}{res}{space 2} .4206382{col 36}{space 2} .3207188{col 47}{space 1}   -1.14{col 56}{space 3}0.256{col 64}{space 4} .0943851{col 77}{space 3} 1.874622
{txt}{space 20}5  {c |}{col 24}{res}{space 2}  .305131{col 36}{space 2} .2405211{col 47}{space 1}   -1.51{col 56}{space 3}0.132{col 64}{space 4} .0650912{col 77}{space 3} 1.430377
{txt}{space 22} {c |}
{space 17}pos_2 {c |}
{space 20}2  {c |}{col 24}{res}{space 2} .2937473{col 36}{space 2}  .226356{col 47}{space 1}   -1.59{col 56}{space 3}0.112{col 64}{space 4} .0648716{col 77}{space 3} 1.330128
{txt}{space 20}3  {c |}{col 24}{res}{space 2} .3475706{col 36}{space 2} .2695498{col 47}{space 1}   -1.36{col 56}{space 3}0.173{col 64}{space 4} .0760177{col 77}{space 3} 1.589174
{txt}{space 20}4  {c |}{col 24}{res}{space 2} .0603848{col 36}{space 2} .0439481{col 47}{space 1}   -3.86{col 56}{space 3}0.000{col 64}{space 4} .0145018{col 77}{space 3} .2514389
{txt}{space 20}5  {c |}{col 24}{res}{space 2} .0581617{col 36}{space 2}  .041253{col 47}{space 1}   -4.01{col 56}{space 3}0.000{col 64}{space 4} .0144842{col 77}{space 3} .2335491
{txt}{space 20}6  {c |}{col 24}{res}{space 2} .0360078{col 36}{space 2} .0283029{col 47}{space 1}   -4.23{col 56}{space 3}0.000{col 64}{space 4} .0077149{col 77}{space 3} .1680584
{txt}{space 20}7  {c |}{col 24}{res}{space 2} .0077036{col 36}{space 2} .0072833{col 47}{space 1}   -5.15{col 56}{space 3}0.000{col 64}{space 4} .0012076{col 77}{space 3} .0491424
{txt}{space 22} {c |}
{space 14}envrsp_r {c |}{col 24}{res}{space 2} 1.858104{col 36}{space 2} .6214744{col 47}{space 1}    1.85{col 56}{space 3}0.064{col 64}{space 4} .9646532{col 77}{space 3} 3.579058
{txt}{space 9}religiosity_r {c |}{col 24}{res}{space 2} 2.052284{col 36}{space 2} .6134057{col 47}{space 1}    2.41{col 56}{space 3}0.016{col 64}{space 4} 1.142412{col 77}{space 3} 3.686825
{txt}{space 16}RUDE_r {c |}{col 24}{res}{space 2} .8243915{col 36}{space 2} .2518715{col 47}{space 1}   -0.63{col 56}{space 3}0.527{col 64}{space 4} .4529715{col 77}{space 3} 1.500362
{txt}{space 17}_cons {c |}{col 24}{res}{space 2} 8.209003{col 36}{space 2} 10.95772{col 47}{space 1}    1.58{col 56}{space 3}0.115{col 64}{space 4} .5998891{col 77}{space 3} 112.3336
{txt}{hline 23}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}
({res}est2{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est2:est2}}{col 14}{c |}{res}{col 16}       771{col 28}-521.4506{col 39}-303.7155{col 50}    50{col 58} 707.4309{col 69} 939.8154
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M2
{txt}
{com}. 
. *
. 
. gen middle2_96=middleclass3*treatment_96
{txt}(321 missing values generated)

{com}. gen middle2_99=middleclass3*treatment_99
{txt}(321 missing values generated)

{com}. 
. eststo: logit DV_1 i.middleclass3 i.treatment_96 i.treatment_99 middle2_96 middle2_99 upperclass3 i.ideol_2 i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r if DV_93_1!=. & DV_96_1!=. & DV_99_1!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=., vce(cluster id) or

{res}{txt}Iteration 0:{space 2}Log pseudolikelihood = {res:-521.45063}  
Iteration 1:{space 2}Log pseudolikelihood = {res:-311.84425}  
Iteration 2:{space 2}Log pseudolikelihood = {res:-303.77816}  
Iteration 3:{space 2}Log pseudolikelihood = {res: -303.6362}  
Iteration 4:{space 2}Log pseudolikelihood = {res:-303.63616}  
Iteration 5:{space 2}Log pseudolikelihood = {res:-303.63616}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:771}
{txt}{col 57}{lalign 13:Wald chi2({res:51})}{col 70} = {res}{ralign 6:240.87}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-303.63616}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.4177}

{txt}{ralign 80:(Std. err. adjusted for {res:257} clusters in {res:id})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}          DV_1{col 16}{c |} Odds ratio{col 28}   std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
1.middleclass3 {c |}{col 16}{res}{space 2} 2.720879{col 28}{space 2} 1.107344{col 39}{space 1}    2.46{col 48}{space 3}0.014{col 56}{space 4} 1.225425{col 69}{space 3} 6.041316
{txt}1.treatment_96 {c |}{col 16}{res}{space 2} .9611052{col 28}{space 2} .2871639{col 39}{space 1}   -0.13{col 48}{space 3}0.894{col 56}{space 4} .5351118{col 69}{space 3} 1.726224
{txt}1.treatment_99 {c |}{col 16}{res}{space 2} .8305128{col 28}{space 2}   .24367{col 39}{space 1}   -0.63{col 48}{space 3}0.527{col 56}{space 4} .4673113{col 69}{space 3}    1.476
{txt}{space 4}middle2_96 {c |}{col 16}{res}{space 2} .4679541{col 28}{space 2} .1990245{col 39}{space 1}   -1.79{col 48}{space 3}0.074{col 56}{space 4} .2033202{col 69}{space 3} 1.077025
{txt}{space 4}middle2_99 {c |}{col 16}{res}{space 2} .5201011{col 28}{space 2} .2193474{col 39}{space 1}   -1.55{col 48}{space 3}0.121{col 56}{space 4} .2275632{col 69}{space 3} 1.188703
{txt}{space 3}upperclass3 {c |}{col 16}{res}{space 2} 3.194325{col 28}{space 2} 1.297266{col 39}{space 1}    2.86{col 48}{space 3}0.004{col 56}{space 4} 1.441095{col 69}{space 3} 7.080528
{txt}{space 14} {c |}
{space 7}ideol_2 {c |}
{space 12}3  {c |}{col 16}{res}{space 2} .8427305{col 28}{space 2} .6941057{col 39}{space 1}   -0.21{col 48}{space 3}0.835{col 56}{space 4} .1677282{col 69}{space 3} 4.234201
{txt}{space 12}4  {c |}{col 16}{res}{space 2} 4.386212{col 28}{space 2} 3.371117{col 39}{space 1}    1.92{col 48}{space 3}0.054{col 56}{space 4} .9724795{col 69}{space 3}  19.7833
{txt}{space 12}5  {c |}{col 16}{res}{space 2} 18.40448{col 28}{space 2} 14.73825{col 39}{space 1}    3.64{col 48}{space 3}0.000{col 56}{space 4} 3.830752{col 69}{space 3} 88.42258
{txt}{space 12}6  {c |}{col 16}{res}{space 2} 44.71154{col 28}{space 2} 39.11791{col 39}{space 1}    4.34{col 48}{space 3}0.000{col 56}{space 4} 8.048363{col 69}{space 3} 248.3887
{txt}{space 14} {c |}
{space 11}day {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .2053707{col 28}{space 2} .2150177{col 39}{space 1}   -1.51{col 48}{space 3}0.131{col 56}{space 4} .0263847{col 69}{space 3} 1.598542
{txt}{space 12}3  {c |}{col 16}{res}{space 2} .0610007{col 28}{space 2} .0602354{col 39}{space 1}   -2.83{col 48}{space 3}0.005{col 56}{space 4} .0088067{col 69}{space 3} .4225295
{txt}{space 12}4  {c |}{col 16}{res}{space 2}  .511809{col 28}{space 2} .4078589{col 39}{space 1}   -0.84{col 48}{space 3}0.401{col 56}{space 4} .1073466{col 69}{space 3} 2.440213
{txt}{space 12}5  {c |}{col 16}{res}{space 2} .3061601{col 28}{space 2} .2721912{col 39}{space 1}   -1.33{col 48}{space 3}0.183{col 56}{space 4}  .053603{col 69}{space 3} 1.748671
{txt}{space 12}6  {c |}{col 16}{res}{space 2} .5332306{col 28}{space 2} .3231682{col 39}{space 1}   -1.04{col 48}{space 3}0.299{col 56}{space 4} .1625692{col 69}{space 3} 1.749008
{txt}{space 12}7  {c |}{col 16}{res}{space 2} .4111543{col 28}{space 2} .2991032{col 39}{space 1}   -1.22{col 48}{space 3}0.222{col 56}{space 4} .0988052{col 69}{space 3} 1.710921
{txt}{space 12}8  {c |}{col 16}{res}{space 2} .3562501{col 28}{space 2} .2303822{col 39}{space 1}   -1.60{col 48}{space 3}0.110{col 56}{space 4} .1002985{col 69}{space 3} 1.265364
{txt}{space 12}9  {c |}{col 16}{res}{space 2}  .669619{col 28}{space 2} .6190114{col 39}{space 1}   -0.43{col 48}{space 3}0.664{col 56}{space 4} .1093849{col 69}{space 3} 4.099192
{txt}{space 11}10  {c |}{col 16}{res}{space 2} .4776065{col 28}{space 2} .3485922{col 39}{space 1}   -1.01{col 48}{space 3}0.311{col 56}{space 4} .1142355{col 69}{space 3} 1.996822
{txt}{space 11}11  {c |}{col 16}{res}{space 2} .2634016{col 28}{space 2}  .200222{col 39}{space 1}   -1.76{col 48}{space 3}0.079{col 56}{space 4} .0593726{col 69}{space 3} 1.168558
{txt}{space 11}12  {c |}{col 16}{res}{space 2} 1.949582{col 28}{space 2} 2.103443{col 39}{space 1}    0.62{col 48}{space 3}0.536{col 56}{space 4} .2352685{col 69}{space 3} 16.15547
{txt}{space 11}13  {c |}{col 16}{res}{space 2} .1023441{col 28}{space 2} .0998649{col 39}{space 1}   -2.34{col 48}{space 3}0.019{col 56}{space 4} .0151175{col 69}{space 3} .6928583
{txt}{space 11}14  {c |}{col 16}{res}{space 2} .1145129{col 28}{space 2} .0830888{col 39}{space 1}   -2.99{col 48}{space 3}0.003{col 56}{space 4} .0276208{col 69}{space 3} .4747589
{txt}{space 11}15  {c |}{col 16}{res}{space 2} .5439055{col 28}{space 2} .3330778{col 39}{space 1}   -0.99{col 48}{space 3}0.320{col 56}{space 4} .1637808{col 69}{space 3} 1.806275
{txt}{space 11}16  {c |}{col 16}{res}{space 2} .4196191{col 28}{space 2} .2591948{col 39}{space 1}   -1.41{col 48}{space 3}0.160{col 56}{space 4} .1250478{col 69}{space 3} 1.408103
{txt}{space 11}17  {c |}{col 16}{res}{space 2} .3011724{col 28}{space 2}  .216925{col 39}{space 1}   -1.67{col 48}{space 3}0.096{col 56}{space 4} .0734043{col 69}{space 3} 1.235688
{txt}{space 11}18  {c |}{col 16}{res}{space 2} .1422023{col 28}{space 2} .1055801{col 39}{space 1}   -2.63{col 48}{space 3}0.009{col 56}{space 4} .0331834{col 69}{space 3} .6093866
{txt}{space 11}19  {c |}{col 16}{res}{space 2} .3697141{col 28}{space 2} .3101056{col 39}{space 1}   -1.19{col 48}{space 3}0.236{col 56}{space 4} .0714336{col 69}{space 3} 1.913505
{txt}{space 11}21  {c |}{col 16}{res}{space 2} .4049186{col 28}{space 2} .2642465{col 39}{space 1}   -1.39{col 48}{space 3}0.166{col 56}{space 4} .1126888{col 69}{space 3} 1.454972
{txt}{space 11}22  {c |}{col 16}{res}{space 2} .4718292{col 28}{space 2} .3376091{col 39}{space 1}   -1.05{col 48}{space 3}0.294{col 56}{space 4} .1160707{col 69}{space 3} 1.917994
{txt}{space 11}23  {c |}{col 16}{res}{space 2} .5015275{col 28}{space 2} .3236989{col 39}{space 1}   -1.07{col 48}{space 3}0.285{col 56}{space 4} .1415491{col 69}{space 3}  1.77698
{txt}{space 11}24  {c |}{col 16}{res}{space 2}    .2666{col 28}{space 2} .2693202{col 39}{space 1}   -1.31{col 48}{space 3}0.191{col 56}{space 4} .0368107{col 69}{space 3} 1.930842
{txt}{space 11}25  {c |}{col 16}{res}{space 2} .4023005{col 28}{space 2} .3064231{col 39}{space 1}   -1.20{col 48}{space 3}0.232{col 56}{space 4} .0904086{col 69}{space 3} 1.790158
{txt}{space 11}26  {c |}{col 16}{res}{space 2} 1.744014{col 28}{space 2} 2.838618{col 39}{space 1}    0.34{col 48}{space 3}0.733{col 56}{space 4} .0717967{col 69}{space 3} 42.36385
{txt}{space 11}28  {c |}{col 16}{res}{space 2} .5281141{col 28}{space 2} .4273059{col 39}{space 1}   -0.79{col 48}{space 3}0.430{col 56}{space 4}  .108145{col 69}{space 3} 2.578986
{txt}{space 11}29  {c |}{col 16}{res}{space 2}  .508745{col 28}{space 2} .3685619{col 39}{space 1}   -0.93{col 48}{space 3}0.351{col 56}{space 4} .1229828{col 69}{space 3} 2.104533
{txt}{space 11}30  {c |}{col 16}{res}{space 2} .1483032{col 28}{space 2} .1483591{col 39}{space 1}   -1.91{col 48}{space 3}0.056{col 56}{space 4} .0208751{col 69}{space 3} 1.053594
{txt}{space 11}31  {c |}{col 16}{res}{space 2} .3832615{col 28}{space 2} .3111466{col 39}{space 1}   -1.18{col 48}{space 3}0.237{col 56}{space 4} .0780651{col 69}{space 3} 1.881628
{txt}{space 14} {c |}
{space 11}sal {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .2581374{col 28}{space 2} .2005008{col 39}{space 1}   -1.74{col 48}{space 3}0.081{col 56}{space 4} .0563254{col 69}{space 3} 1.183034
{txt}{space 12}3  {c |}{col 16}{res}{space 2} .2806721{col 28}{space 2} .2166934{col 39}{space 1}   -1.65{col 48}{space 3}0.100{col 56}{space 4} .0618056{col 69}{space 3} 1.274591
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .4230652{col 28}{space 2} .3203408{col 39}{space 1}   -1.14{col 48}{space 3}0.256{col 56}{space 4} .0959148{col 69}{space 3} 1.866074
{txt}{space 12}5  {c |}{col 16}{res}{space 2} .3051917{col 28}{space 2} .2384512{col 39}{space 1}   -1.52{col 48}{space 3}0.129{col 56}{space 4} .0659956{col 69}{space 3} 1.411336
{txt}{space 14} {c |}
{space 9}pos_2 {c |}
{space 12}2  {c |}{col 16}{res}{space 2}  .297426{col 28}{space 2} .2298307{col 39}{space 1}   -1.57{col 48}{space 3}0.117{col 56}{space 4} .0654076{col 69}{space 3} 1.352477
{txt}{space 12}3  {c |}{col 16}{res}{space 2} .3536096{col 28}{space 2} .2751842{col 39}{space 1}   -1.34{col 48}{space 3}0.182{col 56}{space 4} .0769319{col 69}{space 3}  1.62533
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .0611978{col 28}{space 2}  .044503{col 39}{space 1}   -3.84{col 48}{space 3}0.000{col 56}{space 4} .0147144{col 69}{space 3} .2545239
{txt}{space 12}5  {c |}{col 16}{res}{space 2} .0585429{col 28}{space 2} .0415907{col 39}{space 1}   -3.99{col 48}{space 3}0.000{col 56}{space 4} .0145464{col 69}{space 3} .2356101
{txt}{space 12}6  {c |}{col 16}{res}{space 2} .0356768{col 28}{space 2} .0281856{col 39}{space 1}   -4.22{col 48}{space 3}0.000{col 56}{space 4} .0075843{col 69}{space 3} .1678249
{txt}{space 12}7  {c |}{col 16}{res}{space 2}   .00772{col 28}{space 2} .0072918{col 39}{space 1}   -5.15{col 48}{space 3}0.000{col 56}{space 4} .0012123{col 69}{space 3} .0491601
{txt}{space 14} {c |}
{space 6}envrsp_r {c |}{col 16}{res}{space 2} 1.857699{col 28}{space 2} .6206103{col 39}{space 1}    1.85{col 48}{space 3}0.064{col 56}{space 4} .9651849{col 69}{space 3} 3.575529
{txt}{space 1}religiosity_r {c |}{col 16}{res}{space 2} 2.054511{col 28}{space 2} .6146607{col 39}{space 1}    2.41{col 48}{space 3}0.016{col 56}{space 4} 1.143008{col 69}{space 3} 3.692901
{txt}{space 8}RUDE_r {c |}{col 16}{res}{space 2} .8233531{col 28}{space 2} .2512449{col 39}{space 1}   -0.64{col 48}{space 3}0.524{col 56}{space 4} .4527342{col 69}{space 3} 1.497369
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 8.121922{col 28}{space 2} 10.79456{col 39}{space 1}    1.58{col 48}{space 3}0.115{col 56}{space 4} .6002847{col 69}{space 3} 109.8905
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}
({res}est3{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est3:est3}}{col 14}{c |}{res}{col 16}       771{col 28}-521.4506{col 39}-303.6362{col 50}    52{col 58} 711.2723{col 69} 952.9521
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M3
{txt}
{com}. 
. esttab using TableC5.rtf, eform ///
>         label title (Alt Class NZ) nonumbers mtitles ("M1" "M2" "M3") ///
>         starlevels(+ 0.1 * 0.05 ** 0.01 *** 0.001) ///
>         b(2) se(2) r2 ///  
>         varlabels(_cons Constant) replace
{txt}(tabulating estimates stored by eststo; specify "." to tabulate the active results)
{res}{txt}(output written to {browse  `"TableC5.rtf"'})

{com}. 
. ********************************************************************************
. 
. *Additional Controls
. 
. eststo clear
{txt}
{com}. 
. eststo: logit DV_1 middleclass##treatment upperclass i.ideol_2 i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r female age_r uni if DV_93_1!=. & DV_96_1!=. & DV_99_1!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=. & id2<3, vce(cluster id) or

{res}{txt}Iteration 0:{space 2}Log pseudolikelihood = {res:-342.99313}  
Iteration 1:{space 2}Log pseudolikelihood = {res: -199.2009}  
Iteration 2:{space 2}Log pseudolikelihood = {res:-193.32938}  
Iteration 3:{space 2}Log pseudolikelihood = {res:-193.21044}  
Iteration 4:{space 2}Log pseudolikelihood = {res:-193.21034}  
Iteration 5:{space 2}Log pseudolikelihood = {res:-193.21034}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:508}
{txt}{col 57}{lalign 13:Wald chi2({res:52})}{col 70} = {res}{ralign 6:190.16}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-193.21034}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.4367}

{txt}{ralign 87:(Std. err. adjusted for {res:254} clusters in {res:id})}
{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}                 DV_1{col 23}{c |} Odds ratio{col 35}   std. err.{col 47}      z{col 55}   P>|z|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}1.middleclass {c |}{col 23}{res}{space 2} 2.315581{col 35}{space 2} 1.083124{col 46}{space 1}    1.80{col 55}{space 3}0.073{col 63}{space 4} .9257773{col 76}{space 3}   5.7918
{txt}{space 10}1.treatment {c |}{col 23}{res}{space 2} .8372444{col 35}{space 2} .2792406{col 46}{space 1}   -0.53{col 55}{space 3}0.594{col 63}{space 4} .4354684{col 76}{space 3} 1.609711
{txt}{space 21} {c |}
middleclass#treatment {c |}
{space 17}1 1  {c |}{col 23}{res}{space 2} .3328329{col 35}{space 2} .1610019{col 46}{space 1}   -2.27{col 55}{space 3}0.023{col 63}{space 4} .1289653{col 76}{space 3} .8589734
{txt}{space 21} {c |}
{space 11}upperclass {c |}{col 23}{res}{space 2} 3.884649{col 35}{space 2} 1.821685{col 46}{space 1}    2.89{col 55}{space 3}0.004{col 63}{space 4} 1.549478{col 76}{space 3} 9.739082
{txt}{space 21} {c |}
{space 14}ideol_2 {c |}
{space 19}3  {c |}{col 23}{res}{space 2} .7931681{col 35}{space 2} .6827234{col 46}{space 1}   -0.27{col 55}{space 3}0.788{col 63}{space 4} .1467876{col 76}{space 3} 4.285892
{txt}{space 19}4  {c |}{col 23}{res}{space 2} 4.000364{col 35}{space 2} 3.036013{col 46}{space 1}    1.83{col 55}{space 3}0.068{col 63}{space 4} .9038444{col 76}{space 3} 17.70539
{txt}{space 19}5  {c |}{col 23}{res}{space 2} 21.24609{col 35}{space 2} 17.17498{col 46}{space 1}    3.78{col 55}{space 3}0.000{col 63}{space 4} 4.356941{col 76}{space 3} 103.6039
{txt}{space 19}6  {c |}{col 23}{res}{space 2} 55.12389{col 35}{space 2} 48.50956{col 46}{space 1}    4.56{col 55}{space 3}0.000{col 63}{space 4} 9.823677{col 76}{space 3} 309.3183
{txt}{space 21} {c |}
{space 18}day {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .0826821{col 35}{space 2} .1503021{col 46}{space 1}   -1.37{col 55}{space 3}0.170{col 63}{space 4} .0023446{col 76}{space 3} 2.915758
{txt}{space 19}3  {c |}{col 23}{res}{space 2} .0178038{col 35}{space 2}  .028577{col 46}{space 1}   -2.51{col 55}{space 3}0.012{col 63}{space 4}  .000766{col 76}{space 3} .4137924
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .3463544{col 35}{space 2} .2884988{col 46}{space 1}   -1.27{col 55}{space 3}0.203{col 63}{space 4}  .067687{col 76}{space 3} 1.772296
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .2963259{col 35}{space 2} .2912686{col 46}{space 1}   -1.24{col 55}{space 3}0.216{col 63}{space 4} .0431614{col 76}{space 3} 2.034436
{txt}{space 19}6  {c |}{col 23}{res}{space 2} .7157821{col 35}{space 2} .4816908{col 46}{space 1}   -0.50{col 55}{space 3}0.619{col 63}{space 4} .1914073{col 76}{space 3} 2.676721
{txt}{space 19}7  {c |}{col 23}{res}{space 2} .3085441{col 35}{space 2} .3270261{col 46}{space 1}   -1.11{col 55}{space 3}0.267{col 63}{space 4} .0386481{col 76}{space 3} 2.463238
{txt}{space 19}8  {c |}{col 23}{res}{space 2} .2979382{col 35}{space 2} .2437658{col 46}{space 1}   -1.48{col 55}{space 3}0.139{col 63}{space 4} .0599368{col 76}{space 3} 1.481012
{txt}{space 19}9  {c |}{col 23}{res}{space 2} 1.030335{col 35}{space 2} 1.221815{col 46}{space 1}    0.03{col 55}{space 3}0.980{col 63}{space 4} .1008296{col 76}{space 3} 10.52856
{txt}{space 18}10  {c |}{col 23}{res}{space 2} .1222762{col 35}{space 2} .1330078{col 46}{space 1}   -1.93{col 55}{space 3}0.053{col 63}{space 4} .0145022{col 76}{space 3} 1.030978
{txt}{space 18}11  {c |}{col 23}{res}{space 2}  .200058{col 35}{space 2} .1513785{col 46}{space 1}   -2.13{col 55}{space 3}0.033{col 63}{space 4}  .045402{col 76}{space 3}   .88153
{txt}{space 18}12  {c |}{col 23}{res}{space 2} 1.621629{col 35}{space 2}  1.99715{col 46}{space 1}    0.39{col 55}{space 3}0.695{col 63}{space 4} .1450898{col 76}{space 3} 18.12449
{txt}{space 18}13  {c |}{col 23}{res}{space 2} .1543803{col 35}{space 2} .1972647{col 46}{space 1}   -1.46{col 55}{space 3}0.144{col 63}{space 4} .0126165{col 76}{space 3} 1.889051
{txt}{space 18}14  {c |}{col 23}{res}{space 2} .0568104{col 35}{space 2} .0568987{col 46}{space 1}   -2.86{col 55}{space 3}0.004{col 63}{space 4} .0079782{col 76}{space 3} .4045314
{txt}{space 18}15  {c |}{col 23}{res}{space 2} .2935663{col 35}{space 2} .2063105{col 46}{space 1}   -1.74{col 55}{space 3}0.081{col 63}{space 4} .0740465{col 76}{space 3} 1.163879
{txt}{space 18}16  {c |}{col 23}{res}{space 2} .2282093{col 35}{space 2} .1490721{col 46}{space 1}   -2.26{col 55}{space 3}0.024{col 63}{space 4} .0634318{col 76}{space 3} .8210312
{txt}{space 18}17  {c |}{col 23}{res}{space 2} .2697556{col 35}{space 2}  .212126{col 46}{space 1}   -1.67{col 55}{space 3}0.096{col 63}{space 4} .0577586{col 76}{space 3} 1.259866
{txt}{space 18}18  {c |}{col 23}{res}{space 2} .0871052{col 35}{space 2} .0713424{col 46}{space 1}   -2.98{col 55}{space 3}0.003{col 63}{space 4} .0174935{col 76}{space 3} .4337208
{txt}{space 18}19  {c |}{col 23}{res}{space 2} .2852388{col 35}{space 2} .2370037{col 46}{space 1}   -1.51{col 55}{space 3}0.131{col 63}{space 4} .0559692{col 76}{space 3} 1.453678
{txt}{space 18}21  {c |}{col 23}{res}{space 2} .1716405{col 35}{space 2} .1343098{col 46}{space 1}   -2.25{col 55}{space 3}0.024{col 63}{space 4} .0370296{col 76}{space 3}  .795592
{txt}{space 18}22  {c |}{col 23}{res}{space 2} .2555777{col 35}{space 2} .1913878{col 46}{space 1}   -1.82{col 55}{space 3}0.068{col 63}{space 4} .0588987{col 76}{space 3} 1.109022
{txt}{space 18}23  {c |}{col 23}{res}{space 2} .3679287{col 35}{space 2} .2580413{col 46}{space 1}   -1.43{col 55}{space 3}0.154{col 63}{space 4}  .093065{col 76}{space 3} 1.454592
{txt}{space 18}24  {c |}{col 23}{res}{space 2} .1151272{col 35}{space 2} .1439011{col 46}{space 1}   -1.73{col 55}{space 3}0.084{col 63}{space 4} .0099365{col 76}{space 3} 1.333896
{txt}{space 18}25  {c |}{col 23}{res}{space 2} .2644481{col 35}{space 2}  .202132{col 46}{space 1}   -1.74{col 55}{space 3}0.082{col 63}{space 4} .0591182{col 76}{space 3} 1.182932
{txt}{space 18}26  {c |}{col 23}{res}{space 2}  1.89541{col 35}{space 2}  7.24027{col 46}{space 1}    0.17{col 55}{space 3}0.867{col 63}{space 4} .0010622{col 76}{space 3} 3382.246
{txt}{space 18}28  {c |}{col 23}{res}{space 2} .1644863{col 35}{space 2} .1737477{col 46}{space 1}   -1.71{col 55}{space 3}0.088{col 63}{space 4} .0207492{col 76}{space 3} 1.303942
{txt}{space 18}29  {c |}{col 23}{res}{space 2} .3287882{col 35}{space 2} .2802767{col 46}{space 1}   -1.30{col 55}{space 3}0.192{col 63}{space 4} .0618452{col 76}{space 3} 1.747939
{txt}{space 18}30  {c |}{col 23}{res}{space 2} .0983657{col 35}{space 2} .1013811{col 46}{space 1}   -2.25{col 55}{space 3}0.024{col 63}{space 4} .0130481{col 76}{space 3} .7415479
{txt}{space 18}31  {c |}{col 23}{res}{space 2} .2432405{col 35}{space 2} .1848832{col 46}{space 1}   -1.86{col 55}{space 3}0.063{col 63}{space 4} .0548342{col 76}{space 3} 1.078998
{txt}{space 21} {c |}
{space 18}sal {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .1732728{col 35}{space 2} .1811889{col 46}{space 1}   -1.68{col 55}{space 3}0.094{col 63}{space 4} .0223173{col 76}{space 3} 1.345302
{txt}{space 19}3  {c |}{col 23}{res}{space 2} .1748034{col 35}{space 2} .1810185{col 46}{space 1}   -1.68{col 55}{space 3}0.092{col 63}{space 4} .0229659{col 76}{space 3} 1.330502
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .2201217{col 35}{space 2} .2261764{col 46}{space 1}   -1.47{col 55}{space 3}0.141{col 63}{space 4} .0293797{col 76}{space 3} 1.649216
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .1987133{col 35}{space 2} .2055828{col 46}{space 1}   -1.56{col 55}{space 3}0.118{col 63}{space 4} .0261577{col 76}{space 3} 1.509575
{txt}{space 21} {c |}
{space 16}pos_2 {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .1562431{col 35}{space 2} .2401531{col 46}{space 1}   -1.21{col 55}{space 3}0.227{col 63}{space 4} .0076818{col 76}{space 3} 3.177886
{txt}{space 19}3  {c |}{col 23}{res}{space 2} .2300786{col 35}{space 2} .3467415{col 46}{space 1}   -0.97{col 55}{space 3}0.330{col 63}{space 4} .0119968{col 76}{space 3} 4.412507
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .0466243{col 35}{space 2} .0689172{col 46}{space 1}   -2.07{col 55}{space 3}0.038{col 63}{space 4} .0025729{col 76}{space 3} .8449058
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .0438851{col 35}{space 2} .0632957{col 46}{space 1}   -2.17{col 55}{space 3}0.030{col 63}{space 4} .0025979{col 76}{space 3} .7413242
{txt}{space 19}6  {c |}{col 23}{res}{space 2} .0327315{col 35}{space 2} .0486843{col 46}{space 1}   -2.30{col 55}{space 3}0.022{col 63}{space 4} .0017738{col 76}{space 3} .6039894
{txt}{space 19}7  {c |}{col 23}{res}{space 2} .0060599{col 35}{space 2} .0096414{col 46}{space 1}   -3.21{col 55}{space 3}0.001{col 63}{space 4}  .000268{col 76}{space 3} .1370044
{txt}{space 21} {c |}
{space 13}envrsp_r {c |}{col 23}{res}{space 2} 1.823312{col 35}{space 2}   .62684{col 46}{space 1}    1.75{col 55}{space 3}0.081{col 63}{space 4} .9294476{col 76}{space 3} 3.576821
{txt}{space 8}religiosity_r {c |}{col 23}{res}{space 2} 2.033556{col 35}{space 2} .7020355{col 46}{space 1}    2.06{col 55}{space 3}0.040{col 63}{space 4} 1.033712{col 76}{space 3} 4.000485
{txt}{space 15}RUDE_r {c |}{col 23}{res}{space 2} .7285897{col 35}{space 2} .2365141{col 46}{space 1}   -0.98{col 55}{space 3}0.329{col 63}{space 4} .3856264{col 76}{space 3} 1.376573
{txt}{space 15}female {c |}{col 23}{res}{space 2}  1.12649{col 35}{space 2} .3911902{col 46}{space 1}    0.34{col 55}{space 3}0.732{col 63}{space 4} .5703414{col 76}{space 3} 2.224946
{txt}{space 16}age_r {c |}{col 23}{res}{space 2} 1.158765{col 35}{space 2} .4089045{col 46}{space 1}    0.42{col 55}{space 3}0.676{col 63}{space 4} .5802616{col 76}{space 3} 2.314019
{txt}{space 18}uni {c |}{col 23}{res}{space 2} 1.651678{col 35}{space 2} .7698099{col 46}{space 1}    1.08{col 55}{space 3}0.282{col 63}{space 4} .6625207{col 76}{space 3} 4.117667
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 23.31035{col 35}{space 2} 45.93788{col 46}{space 1}    1.60{col 55}{space 3}0.110{col 63}{space 4} .4898685{col 76}{space 3} 1109.221
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}
({res}est1{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est1:est1}}{col 14}{c |}{res}{col 16}       508{col 28}-342.9931{col 39}-193.2103{col 50}    53{col 58} 492.4207{col 69} 716.6362
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M1
{txt}
{com}. 
. *
. 
. eststo: logit DV_1 middleclass##treatment upperclass i.ideol_2 i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r female age_r uni if DV_93_1!=. & DV_96_1!=. & DV_99_1!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=., vce(cluster id) or

{res}{txt}Iteration 0:{space 2}Log pseudolikelihood = {res:-513.31751}  
Iteration 1:{space 2}Log pseudolikelihood = {res:-300.82201}  
Iteration 2:{space 2}Log pseudolikelihood = {res:-292.59237}  
Iteration 3:{space 2}Log pseudolikelihood = {res:-292.08221}  
Iteration 4:{space 2}Log pseudolikelihood = {res:-292.08056}  
Iteration 5:{space 2}Log pseudolikelihood = {res:-292.08056}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:762}
{txt}{col 57}{lalign 13:Wald chi2({res:52})}{col 70} = {res}{ralign 6:227.43}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-292.08056}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.4310}

{txt}{ralign 87:(Std. err. adjusted for {res:254} clusters in {res:id})}
{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}                 DV_1{col 23}{c |} Odds ratio{col 35}   std. err.{col 47}      z{col 55}   P>|z|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}1.middleclass {c |}{col 23}{res}{space 2} 2.324193{col 35}{space 2} 1.059701{col 46}{space 1}    1.85{col 55}{space 3}0.064{col 63}{space 4} .9509821{col 76}{space 3} 5.680309
{txt}{space 10}1.treatment {c |}{col 23}{res}{space 2} .8732481{col 35}{space 2} .2178358{col 46}{space 1}   -0.54{col 55}{space 3}0.587{col 63}{space 4} .5355518{col 76}{space 3} 1.423881
{txt}{space 21} {c |}
middleclass#treatment {c |}
{space 17}1 1  {c |}{col 23}{res}{space 2} .3951849{col 35}{space 2} .1824949{col 46}{space 1}   -2.01{col 55}{space 3}0.044{col 63}{space 4} .1598522{col 76}{space 3}  .976972
{txt}{space 21} {c |}
{space 11}upperclass {c |}{col 23}{res}{space 2}  3.63016{col 35}{space 2} 1.481642{col 46}{space 1}    3.16{col 55}{space 3}0.002{col 63}{space 4} 1.631209{col 76}{space 3} 8.078709
{txt}{space 21} {c |}
{space 14}ideol_2 {c |}
{space 19}3  {c |}{col 23}{res}{space 2} .7236214{col 35}{space 2} .6191522{col 46}{space 1}   -0.38{col 55}{space 3}0.705{col 63}{space 4} .1352689{col 76}{space 3} 3.871016
{txt}{space 19}4  {c |}{col 23}{res}{space 2} 3.875248{col 35}{space 2} 2.985119{col 46}{space 1}    1.76{col 55}{space 3}0.079{col 63}{space 4} .8562797{col 76}{space 3} 17.53814
{txt}{space 19}5  {c |}{col 23}{res}{space 2} 16.78943{col 35}{space 2} 13.55282{col 46}{space 1}    3.49{col 55}{space 3}0.000{col 63}{space 4} 3.450848{col 76}{space 3} 81.68566
{txt}{space 19}6  {c |}{col 23}{res}{space 2}  40.8305{col 35}{space 2} 35.86148{col 46}{space 1}    4.22{col 55}{space 3}0.000{col 63}{space 4} 7.300849{col 76}{space 3} 228.3474
{txt}{space 21} {c |}
{space 18}day {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .2304793{col 35}{space 2} .2466544{col 46}{space 1}   -1.37{col 55}{space 3}0.170{col 63}{space 4} .0282939{col 76}{space 3} 1.877461
{txt}{space 19}3  {c |}{col 23}{res}{space 2} .0595094{col 35}{space 2} .0574753{col 46}{space 1}   -2.92{col 55}{space 3}0.003{col 63}{space 4} .0089635{col 76}{space 3} .3950861
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .4840204{col 35}{space 2} .3718667{col 46}{space 1}   -0.94{col 55}{space 3}0.345{col 63}{space 4} .1073733{col 76}{space 3}  2.18188
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .3400312{col 35}{space 2} .2984824{col 46}{space 1}   -1.23{col 55}{space 3}0.219{col 63}{space 4} .0608592{col 76}{space 3} 1.899814
{txt}{space 19}6  {c |}{col 23}{res}{space 2}  .489031{col 35}{space 2} .2839027{col 46}{space 1}   -1.23{col 55}{space 3}0.218{col 63}{space 4} .1567396{col 76}{space 3} 1.525788
{txt}{space 19}7  {c |}{col 23}{res}{space 2} .3052752{col 35}{space 2} .2205848{col 46}{space 1}   -1.64{col 55}{space 3}0.101{col 63}{space 4} .0740684{col 76}{space 3} 1.258201
{txt}{space 19}8  {c |}{col 23}{res}{space 2} .3555199{col 35}{space 2} .2175141{col 46}{space 1}   -1.69{col 55}{space 3}0.091{col 63}{space 4} .1071721{col 76}{space 3} 1.179359
{txt}{space 19}9  {c |}{col 23}{res}{space 2}  .737685{col 35}{space 2} .6507673{col 46}{space 1}   -0.34{col 55}{space 3}0.730{col 63}{space 4} .1309068{col 76}{space 3} 4.156997
{txt}{space 18}10  {c |}{col 23}{res}{space 2} .4196166{col 35}{space 2}  .289534{col 46}{space 1}   -1.26{col 55}{space 3}0.208{col 63}{space 4} .1085242{col 76}{space 3} 1.622478
{txt}{space 18}11  {c |}{col 23}{res}{space 2} .2786131{col 35}{space 2} .2052319{col 46}{space 1}   -1.73{col 55}{space 3}0.083{col 63}{space 4} .0657642{col 76}{space 3} 1.180357
{txt}{space 18}12  {c |}{col 23}{res}{space 2} 2.005976{col 35}{space 2}  2.40576{col 46}{space 1}    0.58{col 55}{space 3}0.562{col 63}{space 4} .1911977{col 76}{space 3} 21.04596
{txt}{space 18}13  {c |}{col 23}{res}{space 2}  .109372{col 35}{space 2} .1060009{col 46}{space 1}   -2.28{col 55}{space 3}0.022{col 63}{space 4} .0163659{col 76}{space 3} .7309225
{txt}{space 18}14  {c |}{col 23}{res}{space 2} .1292383{col 35}{space 2} .0880717{col 46}{space 1}   -3.00{col 55}{space 3}0.003{col 63}{space 4} .0339879{col 76}{space 3} .4914252
{txt}{space 18}15  {c |}{col 23}{res}{space 2} .4616013{col 35}{space 2} .2860865{col 46}{space 1}   -1.25{col 55}{space 3}0.212{col 63}{space 4} .1369992{col 76}{space 3} 1.555307
{txt}{space 18}16  {c |}{col 23}{res}{space 2} .3684741{col 35}{space 2} .2177919{col 46}{space 1}   -1.69{col 55}{space 3}0.091{col 63}{space 4}  .115689{col 76}{space 3} 1.173605
{txt}{space 18}17  {c |}{col 23}{res}{space 2} .2842435{col 35}{space 2} .1934705{col 46}{space 1}   -1.85{col 55}{space 3}0.065{col 63}{space 4} .0748721{col 76}{space 3} 1.079099
{txt}{space 18}18  {c |}{col 23}{res}{space 2} .1483237{col 35}{space 2}  .111263{col 46}{space 1}   -2.54{col 55}{space 3}0.011{col 63}{space 4} .0340952{col 76}{space 3} .6452493
{txt}{space 18}19  {c |}{col 23}{res}{space 2} .3583378{col 35}{space 2}  .300797{col 46}{space 1}   -1.22{col 55}{space 3}0.221{col 63}{space 4} .0691471{col 76}{space 3} 1.856996
{txt}{space 18}21  {c |}{col 23}{res}{space 2} .3557279{col 35}{space 2} .2324609{col 46}{space 1}   -1.58{col 55}{space 3}0.114{col 63}{space 4} .0988269{col 76}{space 3} 1.280445
{txt}{space 18}22  {c |}{col 23}{res}{space 2} .4295394{col 35}{space 2} .2874927{col 46}{space 1}   -1.26{col 55}{space 3}0.207{col 63}{space 4} .1156884{col 76}{space 3} 1.594837
{txt}{space 18}23  {c |}{col 23}{res}{space 2}  .533641{col 35}{space 2} .3372878{col 46}{space 1}   -0.99{col 55}{space 3}0.320{col 63}{space 4} .1546135{col 76}{space 3} 1.841837
{txt}{space 18}24  {c |}{col 23}{res}{space 2} .2097901{col 35}{space 2} .2356823{col 46}{space 1}   -1.39{col 55}{space 3}0.165{col 63}{space 4} .0232021{col 76}{space 3} 1.896888
{txt}{space 18}25  {c |}{col 23}{res}{space 2} .4328994{col 35}{space 2}  .321216{col 46}{space 1}   -1.13{col 55}{space 3}0.259{col 63}{space 4} .1011082{col 76}{space 3} 1.853479
{txt}{space 18}26  {c |}{col 23}{res}{space 2} 1.878424{col 35}{space 2} 3.177597{col 46}{space 1}    0.37{col 55}{space 3}0.709{col 63}{space 4} .0682144{col 76}{space 3} 51.72624
{txt}{space 18}28  {c |}{col 23}{res}{space 2} .6155088{col 35}{space 2} .4814781{col 46}{space 1}   -0.62{col 55}{space 3}0.535{col 63}{space 4} .1328578{col 76}{space 3} 2.851554
{txt}{space 18}29  {c |}{col 23}{res}{space 2} .4748397{col 35}{space 2} .3310298{col 46}{space 1}   -1.07{col 55}{space 3}0.285{col 63}{space 4}  .121099{col 76}{space 3} 1.861889
{txt}{space 18}30  {c |}{col 23}{res}{space 2} .1384629{col 35}{space 2} .1410603{col 46}{space 1}   -1.94{col 55}{space 3}0.052{col 63}{space 4} .0188003{col 76}{space 3}  1.01977
{txt}{space 18}31  {c |}{col 23}{res}{space 2} .3371928{col 35}{space 2} .2605545{col 46}{space 1}   -1.41{col 55}{space 3}0.159{col 63}{space 4}  .074155{col 76}{space 3}  1.53326
{txt}{space 21} {c |}
{space 18}sal {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .2477557{col 35}{space 2} .1957822{col 46}{space 1}   -1.77{col 55}{space 3}0.077{col 63}{space 4} .0526484{col 76}{space 3} 1.165903
{txt}{space 19}3  {c |}{col 23}{res}{space 2} .2591726{col 35}{space 2} .2073357{col 46}{space 1}   -1.69{col 55}{space 3}0.091{col 63}{space 4} .0540301{col 76}{space 3} 1.243205
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .3851299{col 35}{space 2} .3007768{col 46}{space 1}   -1.22{col 55}{space 3}0.222{col 63}{space 4} .0833374{col 76}{space 3} 1.779813
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .3111319{col 35}{space 2} .2525262{col 46}{space 1}   -1.44{col 55}{space 3}0.150{col 63}{space 4} .0633983{col 76}{space 3} 1.526903
{txt}{space 21} {c |}
{space 16}pos_2 {c |}
{space 19}2  {c |}{col 23}{res}{space 2} .2498412{col 35}{space 2} .2092303{col 46}{space 1}   -1.66{col 55}{space 3}0.098{col 63}{space 4} .0483975{col 76}{space 3} 1.289749
{txt}{space 19}3  {c |}{col 23}{res}{space 2} .2844404{col 35}{space 2} .2417958{col 46}{space 1}   -1.48{col 55}{space 3}0.139{col 63}{space 4} .0537534{col 76}{space 3}  1.50514
{txt}{space 19}4  {c |}{col 23}{res}{space 2} .0516503{col 35}{space 2} .0413954{col 46}{space 1}   -3.70{col 55}{space 3}0.000{col 63}{space 4} .0107368{col 76}{space 3} .2484695
{txt}{space 19}5  {c |}{col 23}{res}{space 2} .0490566{col 35}{space 2} .0378556{col 46}{space 1}   -3.91{col 55}{space 3}0.000{col 63}{space 4} .0108106{col 76}{space 3} .2226108
{txt}{space 19}6  {c |}{col 23}{res}{space 2} .0333023{col 35}{space 2} .0281495{col 46}{space 1}   -4.02{col 55}{space 3}0.000{col 63}{space 4}  .006353{col 76}{space 3} .1745706
{txt}{space 19}7  {c |}{col 23}{res}{space 2} .0078082{col 35}{space 2} .0077662{col 46}{space 1}   -4.88{col 55}{space 3}0.000{col 63}{space 4} .0011116{col 76}{space 3} .0548495
{txt}{space 21} {c |}
{space 13}envrsp_r {c |}{col 23}{res}{space 2} 1.840694{col 35}{space 2} .6030835{col 46}{space 1}    1.86{col 55}{space 3}0.063{col 63}{space 4} .9684888{col 76}{space 3} 3.498393
{txt}{space 8}religiosity_r {c |}{col 23}{res}{space 2} 2.167595{col 35}{space 2} .7029328{col 46}{space 1}    2.39{col 55}{space 3}0.017{col 63}{space 4} 1.147997{col 76}{space 3} 4.092754
{txt}{space 15}RUDE_r {c |}{col 23}{res}{space 2} .7432856{col 35}{space 2} .2374984{col 46}{space 1}   -0.93{col 55}{space 3}0.353{col 63}{space 4}  .397352{col 76}{space 3} 1.390388
{txt}{space 15}female {c |}{col 23}{res}{space 2} 1.279034{col 35}{space 2}  .412863{col 46}{space 1}    0.76{col 55}{space 3}0.446{col 63}{space 4} .6793915{col 76}{space 3}  2.40793
{txt}{space 16}age_r {c |}{col 23}{res}{space 2} 1.101662{col 35}{space 2} .3615414{col 46}{space 1}    0.30{col 55}{space 3}0.768{col 63}{space 4} .5790324{col 76}{space 3} 2.096014
{txt}{space 18}uni {c |}{col 23}{res}{space 2} 1.712653{col 35}{space 2} .7543183{col 46}{space 1}    1.22{col 55}{space 3}0.222{col 63}{space 4} .7223826{col 76}{space 3} 4.060423
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 9.046944{col 35}{space 2}  12.2873{col 46}{space 1}    1.62{col 55}{space 3}0.105{col 63}{space 4} .6315743{col 76}{space 3} 129.5923
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}
({res}est2{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est2:est2}}{col 14}{c |}{res}{col 16}       762{col 28}-513.3175{col 39}-292.0806{col 50}    53{col 58} 690.1611{col 69} 935.8663
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M2
{txt}
{com}. 
. *
. 
. eststo: logit DV_1 i.middleclass i.treatment_96 i.treatment_99 middle_96 middle_99 upperclass i.ideol_2 i.day i.sal i.pos_2 envrsp_r religiosity_r RUDE_r female age_r uni if DV_93_1!=. & DV_96_1!=. & DV_99_1!=. & taxresp!=. & ptaxr!=. & staxr!=. & taxr!=. & ptax!=. & stax!=. & nday!=. & qday!=. & sday!=., vce(cluster id) or

{res}{txt}Iteration 0:{space 2}Log pseudolikelihood = {res:-513.31751}  
Iteration 1:{space 2}Log pseudolikelihood = {res:-300.61946}  
Iteration 2:{space 2}Log pseudolikelihood = {res:  -292.422}  
Iteration 3:{space 2}Log pseudolikelihood = {res:-291.92167}  
Iteration 4:{space 2}Log pseudolikelihood = {res:-291.92008}  
Iteration 5:{space 2}Log pseudolikelihood = {res:-291.92008}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:762}
{txt}{col 57}{lalign 13:Wald chi2({res:54})}{col 70} = {res}{ralign 6:227.40}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-291.92008}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.4313}

{txt}{ralign 80:(Std. err. adjusted for {res:254} clusters in {res:id})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}          DV_1{col 16}{c |} Odds ratio{col 28}   std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}1.middleclass {c |}{col 16}{res}{space 2} 2.322379{col 28}{space 2} 1.060023{col 39}{space 1}    1.85{col 48}{space 3}0.065{col 56}{space 4} .9493184{col 69}{space 3} 5.681385
{txt}1.treatment_96 {c |}{col 16}{res}{space 2}  .941311{col 28}{space 2} .2690058{col 39}{space 1}   -0.21{col 48}{space 3}0.832{col 56}{space 4} .5376239{col 69}{space 3} 1.648116
{txt}1.treatment_99 {c |}{col 16}{res}{space 2} .8041212{col 28}{space 2} .2206429{col 39}{space 1}   -0.79{col 48}{space 3}0.427{col 56}{space 4} .4696347{col 69}{space 3} 1.376838
{txt}{space 5}middle_96 {c |}{col 16}{res}{space 2} .3388349{col 28}{space 2}  .159644{col 39}{space 1}   -2.30{col 48}{space 3}0.022{col 56}{space 4} .1345674{col 69}{space 3} .8531721
{txt}{space 5}middle_99 {c |}{col 16}{res}{space 2} .4623759{col 28}{space 2} .2570672{col 39}{space 1}   -1.39{col 48}{space 3}0.165{col 56}{space 4} .1555079{col 69}{space 3} 1.374794
{txt}{space 4}upperclass {c |}{col 16}{res}{space 2} 3.630856{col 28}{space 2} 1.479566{col 39}{space 1}    3.16{col 48}{space 3}0.002{col 56}{space 4} 1.633602{col 69}{space 3} 8.069967
{txt}{space 14} {c |}
{space 7}ideol_2 {c |}
{space 12}3  {c |}{col 16}{res}{space 2} .7186666{col 28}{space 2} .6128976{col 39}{space 1}   -0.39{col 48}{space 3}0.698{col 56}{space 4}  .135083{col 69}{space 3} 3.823441
{txt}{space 12}4  {c |}{col 16}{res}{space 2} 3.814505{col 28}{space 2} 2.938778{col 39}{space 1}    1.74{col 48}{space 3}0.082{col 56}{space 4}  .842663{col 69}{space 3} 17.26722
{txt}{space 12}5  {c |}{col 16}{res}{space 2} 16.60427{col 28}{space 2} 13.37088{col 39}{space 1}    3.49{col 48}{space 3}0.000{col 56}{space 4} 3.425898{col 69}{space 3} 80.47574
{txt}{space 12}6  {c |}{col 16}{res}{space 2} 40.27046{col 28}{space 2} 35.31312{col 39}{space 1}    4.21{col 48}{space 3}0.000{col 56}{space 4} 7.220526{col 69}{space 3} 224.5972
{txt}{space 14} {c |}
{space 11}day {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .2319207{col 28}{space 2}   .25254{col 39}{space 1}   -1.34{col 48}{space 3}0.180{col 56}{space 4} .0274448{col 69}{space 3}  1.95983
{txt}{space 12}3  {c |}{col 16}{res}{space 2} .0612886{col 28}{space 2}  .059554{col 39}{space 1}   -2.87{col 48}{space 3}0.004{col 56}{space 4} .0091258{col 69}{space 3} .4116138
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .4668176{col 28}{space 2} .3667561{col 39}{space 1}   -0.97{col 48}{space 3}0.332{col 56}{space 4}  .100092{col 69}{space 3} 2.177185
{txt}{space 12}5  {c |}{col 16}{res}{space 2} .3388153{col 28}{space 2} .3021628{col 39}{space 1}   -1.21{col 48}{space 3}0.225{col 56}{space 4} .0589988{col 69}{space 3} 1.945731
{txt}{space 12}6  {c |}{col 16}{res}{space 2} .4988969{col 28}{space 2} .2886787{col 39}{space 1}   -1.20{col 48}{space 3}0.229{col 56}{space 4} .1605006{col 69}{space 3} 1.550761
{txt}{space 12}7  {c |}{col 16}{res}{space 2}  .318651{col 28}{space 2} .2348285{col 39}{space 1}   -1.55{col 48}{space 3}0.121{col 56}{space 4} .0751668{col 69}{space 3} 1.350843
{txt}{space 12}8  {c |}{col 16}{res}{space 2}  .371174{col 28}{space 2} .2343732{col 39}{space 1}   -1.57{col 48}{space 3}0.117{col 56}{space 4} .1076706{col 69}{space 3} 1.279552
{txt}{space 12}9  {c |}{col 16}{res}{space 2} .7740502{col 28}{space 2} .6940259{col 39}{space 1}   -0.29{col 48}{space 3}0.775{col 56}{space 4} .1335267{col 69}{space 3} 4.487146
{txt}{space 11}10  {c |}{col 16}{res}{space 2} .4417577{col 28}{space 2} .3100612{col 39}{space 1}   -1.16{col 48}{space 3}0.244{col 56}{space 4}   .11162{col 69}{space 3}  1.74834
{txt}{space 11}11  {c |}{col 16}{res}{space 2} .2774666{col 28}{space 2}  .204793{col 39}{space 1}   -1.74{col 48}{space 3}0.082{col 56}{space 4} .0653063{col 69}{space 3} 1.178872
{txt}{space 11}12  {c |}{col 16}{res}{space 2} 1.955146{col 28}{space 2} 2.370743{col 39}{space 1}    0.55{col 48}{space 3}0.580{col 56}{space 4} .1815688{col 69}{space 3} 21.05315
{txt}{space 11}13  {c |}{col 16}{res}{space 2} .1124786{col 28}{space 2} .1078375{col 39}{space 1}   -2.28{col 48}{space 3}0.023{col 56}{space 4} .0171787{col 69}{space 3} .7364602
{txt}{space 11}14  {c |}{col 16}{res}{space 2} .1275921{col 28}{space 2} .0885631{col 39}{space 1}   -2.97{col 48}{space 3}0.003{col 56}{space 4} .0327337{col 69}{space 3} .4973384
{txt}{space 11}15  {c |}{col 16}{res}{space 2} .4679423{col 28}{space 2} .2867923{col 39}{space 1}   -1.24{col 48}{space 3}0.215{col 56}{space 4} .1407694{col 69}{space 3} 1.555523
{txt}{space 11}16  {c |}{col 16}{res}{space 2} .3727763{col 28}{space 2} .2196004{col 39}{space 1}   -1.68{col 48}{space 3}0.094{col 56}{space 4} .1174925{col 69}{space 3} 1.182732
{txt}{space 11}17  {c |}{col 16}{res}{space 2} .2908707{col 28}{space 2} .1971356{col 39}{space 1}   -1.82{col 48}{space 3}0.068{col 56}{space 4} .0770555{col 69}{space 3} 1.097984
{txt}{space 11}18  {c |}{col 16}{res}{space 2} .1482195{col 28}{space 2} .1110861{col 39}{space 1}   -2.55{col 48}{space 3}0.011{col 56}{space 4} .0341158{col 69}{space 3} .6439552
{txt}{space 11}19  {c |}{col 16}{res}{space 2}  .360208{col 28}{space 2} .3030303{col 39}{space 1}   -1.21{col 48}{space 3}0.225{col 56}{space 4} .0692576{col 69}{space 3} 1.873437
{txt}{space 11}21  {c |}{col 16}{res}{space 2} .3607838{col 28}{space 2} .2350266{col 39}{space 1}   -1.56{col 48}{space 3}0.118{col 56}{space 4} .1006343{col 69}{space 3} 1.293445
{txt}{space 11}22  {c |}{col 16}{res}{space 2} .4252868{col 28}{space 2} .2867133{col 39}{space 1}   -1.27{col 48}{space 3}0.205{col 56}{space 4} .1134572{col 69}{space 3}  1.59416
{txt}{space 11}23  {c |}{col 16}{res}{space 2} .5331872{col 28}{space 2} .3370063{col 39}{space 1}   -0.99{col 48}{space 3}0.320{col 56}{space 4} .1544789{col 69}{space 3} 1.840307
{txt}{space 11}24  {c |}{col 16}{res}{space 2} .2154488{col 28}{space 2} .2405274{col 39}{space 1}   -1.37{col 48}{space 3}0.169{col 56}{space 4}  .024158{col 69}{space 3} 1.921441
{txt}{space 11}25  {c |}{col 16}{res}{space 2} .4320959{col 28}{space 2} .3193935{col 39}{space 1}   -1.14{col 48}{space 3}0.256{col 56}{space 4} .1014834{col 69}{space 3} 1.839777
{txt}{space 11}26  {c |}{col 16}{res}{space 2} 2.023983{col 28}{space 2} 3.481772{col 39}{space 1}    0.41{col 48}{space 3}0.682{col 56}{space 4} .0694897{col 69}{space 3} 58.95125
{txt}{space 11}28  {c |}{col 16}{res}{space 2} .6088399{col 28}{space 2}  .498507{col 39}{space 1}   -0.61{col 48}{space 3}0.544{col 56}{space 4} .1223362{col 69}{space 3} 3.030061
{txt}{space 11}29  {c |}{col 16}{res}{space 2} .4717899{col 28}{space 2} .3304211{col 39}{space 1}   -1.07{col 48}{space 3}0.283{col 56}{space 4}  .119565{col 69}{space 3} 1.861629
{txt}{space 11}30  {c |}{col 16}{res}{space 2} .1335901{col 28}{space 2} .1363257{col 39}{space 1}   -1.97{col 48}{space 3}0.049{col 56}{space 4} .0180776{col 69}{space 3} .9872033
{txt}{space 11}31  {c |}{col 16}{res}{space 2} .3230125{col 28}{space 2} .2495272{col 39}{space 1}   -1.46{col 48}{space 3}0.144{col 56}{space 4} .0710667{col 69}{space 3} 1.468158
{txt}{space 14} {c |}
{space 11}sal {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .2458496{col 28}{space 2} .1924266{col 39}{space 1}   -1.79{col 48}{space 3}0.073{col 56}{space 4} .0530193{col 69}{space 3} 1.140001
{txt}{space 12}3  {c |}{col 16}{res}{space 2} .2565496{col 28}{space 2}  .202795{col 39}{space 1}   -1.72{col 48}{space 3}0.085{col 56}{space 4} .0544906{col 69}{space 3} 1.207874
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .3819992{col 28}{space 2} .2951299{col 39}{space 1}   -1.25{col 48}{space 3}0.213{col 56}{space 4} .0840292{col 69}{space 3}  1.73658
{txt}{space 12}5  {c |}{col 16}{res}{space 2} .3080236{col 28}{space 2} .2468221{col 39}{space 1}   -1.47{col 48}{space 3}0.142{col 56}{space 4} .0640484{col 69}{space 3} 1.481356
{txt}{space 14} {c |}
{space 9}pos_2 {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .2559711{col 28}{space 2} .2142443{col 39}{space 1}   -1.63{col 48}{space 3}0.104{col 56}{space 4} .0496303{col 69}{space 3} 1.320185
{txt}{space 12}3  {c |}{col 16}{res}{space 2} .2928226{col 28}{space 2}  .247752{col 39}{space 1}   -1.45{col 48}{space 3}0.147{col 56}{space 4} .0557722{col 69}{space 3} 1.537415
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .0527169{col 28}{space 2} .0419716{col 39}{space 1}   -3.70{col 48}{space 3}0.000{col 56}{space 4} .0110726{col 69}{space 3} .2509863
{txt}{space 12}5  {c |}{col 16}{res}{space 2} .0500412{col 28}{space 2} .0385485{col 39}{space 1}   -3.89{col 48}{space 3}0.000{col 56}{space 4} .0110565{col 69}{space 3} .2264844
{txt}{space 12}6  {c |}{col 16}{res}{space 2} .0333494{col 28}{space 2} .0282353{col 39}{space 1}   -4.02{col 48}{space 3}0.000{col 56}{space 4} .0063448{col 69}{space 3} .1752907
{txt}{space 12}7  {c |}{col 16}{res}{space 2} .0078566{col 28}{space 2} .0078182{col 39}{space 1}   -4.87{col 48}{space 3}0.000{col 56}{space 4} .0011174{col 69}{space 3} .0552423
{txt}{space 14} {c |}
{space 6}envrsp_r {c |}{col 16}{res}{space 2} 1.848215{col 28}{space 2} .6048631{col 39}{space 1}    1.88{col 48}{space 3}0.061{col 56}{space 4} .9731521{col 69}{space 3} 3.510138
{txt}{space 1}religiosity_r {c |}{col 16}{res}{space 2} 2.168012{col 28}{space 2} .7028459{col 39}{space 1}    2.39{col 48}{space 3}0.017{col 56}{space 4} 1.148448{col 69}{space 3} 4.092719
{txt}{space 8}RUDE_r {c |}{col 16}{res}{space 2} .7385536{col 28}{space 2} .2355337{col 39}{space 1}   -0.95{col 48}{space 3}0.342{col 56}{space 4}  .395297{col 69}{space 3} 1.379877
{txt}{space 8}female {c |}{col 16}{res}{space 2} 1.281626{col 28}{space 2} .4134596{col 39}{space 1}    0.77{col 48}{space 3}0.442{col 56}{space 4} .6810184{col 69}{space 3} 2.411924
{txt}{space 9}age_r {c |}{col 16}{res}{space 2} 1.100791{col 28}{space 2} .3608685{col 39}{space 1}    0.29{col 48}{space 3}0.770{col 56}{space 4} .5789732{col 69}{space 3} 2.092914
{txt}{space 11}uni {c |}{col 16}{res}{space 2}  1.71485{col 28}{space 2} .7544641{col 39}{space 1}    1.23{col 48}{space 3}0.220{col 56}{space 4} .7239896{col 69}{space 3} 4.061815
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 8.993983{col 28}{space 2} 12.18031{col 39}{space 1}    1.62{col 48}{space 3}0.105{col 56}{space 4}  .632693{col 69}{space 3}  127.853
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}
({res}est3{txt} stored)

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay est3:est3}}{col 14}{c |}{res}{col 16}       762{col 28}-513.3175{col 39}-291.9201{col 50}    55{col 58} 693.8402{col 69} 948.8172
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. estimates store M3
{txt}
{com}. 
. esttab using TableC6.rtf, eform ///
>         label title (Add Controls) nonumbers mtitles ("M1" "M2" "M3") ///
>         starlevels(+ 0.1 * 0.05 ** 0.01 *** 0.001) ///
>         b(2) se(2) r2 ///  
>         varlabels(_cons Constant) replace
{txt}(tabulating estimates stored by eststo; specify "." to tabulate the active results)
{res}{txt}(output written to {browse  `"TableC6.rtf"'})

{com}.         
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\rober\Downloads\Replication\log New Zealand.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}11 Apr 2024, 23:15:19
{txt}{.-}
{smcl}
{txt}{sf}{ul off}